{"pages":[{"title":"About","date":"2018-12-21T13:34:48.000Z","path":"about/index.html","text":""},{"title":"categories","date":"2018-12-21T11:05:03.000Z","path":"categories/index-1.html","text":"\b"},{"title":"Categories","date":"2018-12-21T13:34:48.000Z","path":"categories/index.html","text":""},{"title":"CV","date":"2018-11-01T03:25:21.000Z","path":"cv/index.html","text":""},{"title":"Listening","date":"2018-11-01T04:40:35.000Z","path":"listening-trashed/index.html","text":""},{"title":"tags","date":"2018-12-21T11:05:55.000Z","path":"tags/index-1.html","text":""},{"title":"Tags","date":"2018-12-21T13:34:48.000Z","path":"tags/index.html","text":""},{"title":"Work","date":"2018-11-01T03:19:04.000Z","path":"trashed/index.html","text":""},{"title":"Menu","date":"2018-11-01T03:25:21.000Z","path":"work/index.html","text":""},{"title":"Write","date":"2018-11-01T05:33:28.000Z","path":"write/index.html","text":""}],"posts":[{"title":"Form_follows_format","date":"2019-03-24T13:37:31.000Z","path":"2019/03/24/Form-follows-format/","text":"Form Follows Format Tensions, museums, media technology and media art Rudolf Frieling http://mediaartnet.org/themes/overview_of_media_art/museum/ Economy of means and a reduction in terms of material were key elements of twentiethcentury modern art. The famous Bauhaus motto «Form follows function,» as for example embodied by Mies van der Rohe’s architecture, is based on this specific understanding of material, from which functional qualities are developed for each particular case. Those artists who worked with industrial tools developed from their working materials and using certain tools an inherent form, and did this using minimal resources. Recall architect Adolf Loos’s motto: «Ornament is crime.» Despite all the postmodern theories, this Modernist approach is still effective today. How does this legacy affect the history of the media arts? For the suspicion is well founded that artistic Modernism always introduced a crucial anti-technological component as well. The use of media forms to reflect on technological matters is based on a political and economic history of the availability and distribution of these very technologies–as can be seen quite clearly in the differences between West and East, at least until the mid- 1990s. But the choice between a technologicaleuphoria and aversion differs according to the particular geopolitical point of view. But even in the microcosm of one individual’s production, ideological premises have always been linked to a technological standard: In the 1980s, «Choosing U-matic means choosing capitalism»[1] was still a slogan of alternative media work. A whole series of entrenched battles and media and ideological conflicts could be added here: film or video, VHS or U-matic, but also some with more profound implications like analog or digital, right down to the current arguments about Microsoft vs. Open Source. But putting aside all questions of technological format, does media art at all exist? Or is it rather an art of (industrial) media, the computer architectures of which are beautiful to look at because their form follows their function, as Friedrich Kittler explains?[2] Even though Kittler’s position, which excludes other theoretical and social factors, has been much criticized,[3] he did provide some important stimuli. One of these is the question of ‹formatting› and the devices for recording, storage, distribution, and presentation with which artists continue to be confronted. They provoke this aphorism from Kittler: «The typewriter writes, too.» There is certainly no doubt that hardware has a crucial influence on artistic output, but this does not have to be interpreted deterministically. Furthermore, the long series of media standards that have since become obsolete, already well documented in the literature,[4] makes another point quite clear: new industrial standards are constantly replacing old ones, but this does not necessarily mean an improvement in technical competence. Thus, art looks less anticipatory now that the quantity of new industry hardware and software is growing so fast that even media artists can scarcely keep up. Having to master whatever is the most recent programming software increasingly keeps them from concentrating on artistic form and content. They are thus forced to direct their attention at precisely those technological aspects that run counter to the industry’s context of use. This means that the proposition is always current that it is necessary to appropriate available technologies for genuinely artistic purposes, but at the same time working against theconditions of the hardware and software in question is always a specifically artistic practice. Putting it more pointedly: art with media is also art directed against media. The first part of this essay is devoted to aspects of this artistic history of technological formats and platforms. In a second step, the question will be posed of in how far the technologies and media used trigger a perceptible change in art reception, as Walter Benjamin already pointed out for the influence of the mass cultural distribution of art reproductions. To what extent can this be connected with a history of the sites and institutions in which media art was produced and/or presented? «When Attitudes Become Form: Live in Your Head»–Harald Szeemann’s famous Bern exhibition on the propagation of conceptual art, minimal art, and land art in 1968[5]–reflected non-technological factors of a social or aesthetic practice and posed the question of alternative, new, different models of practicing art. Today, a fundamental shift can be observed: from the resistance of modernist traditionalists and the museums to the fact that the most recent technologies–like for example the DVD standard and the almost universal use of large-screen video projection–are taken for granted now. Today, artists who work exclusively with video are not seen as ‹video artists,› who were always suspected of finding a form that was ‹merely› a media form rather than a genuine form of artistic expression.[6] The museum as well as the auratic artwork seem on the one hand to have been discredited and deprived of their force by discourses of art theory. Douglas Crimp thus concludes that the museum is no longer the predestined location for contemporary art per se: «We needed, it seemed to me, an archeology of the museum on the model of Foucault’s analysis of the asylum, the clinic, and the prison. For the museum seemed to be equally a space of exclusions and confinements.»[7] But the concrete catalyst for these reflections is the current completely unquestioning acceptance of video technology, at least in the exhibition and museum sphere. This led to a whole series of video-based exhibitions[8] and made young artists like Doug Aitken, Jordan Crandall, Douglas Gordon, Steve McQueen, Paul Pfeiffer, or Marijke van Warmerdam the shooting stars of the art scene. After along period of resistance, the museums have also finally assimilated technological art. What changed conditions might explain this development? What paradigm shift took place here? In the following, central elements and exhibitions of media art will be explored, and the first three sections sketch out the formats and ‹attitudes› that have for their part lastingly influenced the way the electronic media are perceived.[9] The «open form,» not typical of the museum, the «closed format» of alternative distribution, and finally the «museum format» will be interrogated for their specific tense relation to the media. The conclusion is then devoted to the opening of the museum form towards the platform and hybrid, «soft» forms of contemporary media spaces. Open form The crisis of museum representation can be seen in the strategies that interrogate the social and material conditions of the museum: an example here would be Hans Haacke’s complex and conflictual actions that expose museum structures and financing.The crisis also makes itself evident in the attempt to completely do without the museum, and to consider it impossible to combine with the search for new social contexts, as in the case of the debates around context art, art as a service, ambient works for clubs, etc., in the 1990s. Media art settled precisely on this fault line. One of the most complex and earliest examples of this were the activities of the «Experiments in Art and Technology» association. It thrived mainly on the collaboration of engineers and artists; Billy Klüver and Robert Rauschenberg were the group’s most active mentors and driving forces. Their credo can be summed up in the statement that the emergence of new artistic activity is only possible as part of a dialogue between technicians and artists, industry and art. They followed this insight in a whole series of remarkable and historically influential projects and events; these were not by definition directed against the museum as a location for art, but took place in locations that were de facto external to the art context. The most lucid example of this was the industrial arena par excellence, the World’s Fair, as can be seen most clearly in the famous Pepsi Pavilion.[10] The artistic director of the pavilion, Robert Breer,promised a completely new set of sensual perceptions: «We’re making a serious attempt to isolate the senses and create new relationships between them. While entertaining the visitors, we hope to give them a profound physiological experience that will make them more aware of the world around them.»[11] Nineteen sixty-eight not only stood for a paradigm shift in political and social terms.[12] At this time, events can be seen not only in relation to the mass media,[13] but also in the performative and visual arts, as combined by Gene Youngblood in «Expanded Cinema;» Bruce Nauman showed his first videotape in the Nicholas Wilder Gallery in Los Angeles in 1968, the gallery owner Howard Wise presented his first media exhibition «TV as a Creative Medium» in New York, and Jasia Reichardt organized the «Cybernetic Serendipity » exhibition at the ICA in London. But 1968 also saw the first attempt at presenting media projects and experiments–not everyone wanted to use the word ‹art›–in a broad overview: the «E.A.T.» group’s «Some More Beginnings.» This was also crucially the site of linking two different modes of presentation, as some jury-assessed objects and works were being shown at the same time in the museum exhibition «The Machine as Seen at the End of the Mechanical Age» at the Museum of Modern Art in New York under the direction of Pontus Hulten. This not only meant a demonstration of the mediated character of artistic production by showing the work in two different versions at the same time, thus vividly raising the question of original and copy. The context was also different in each case as well. While «Some More Beginnings» precisely showed the multiple possible forms of cooperation between art and technology in a panoramic survey, MoMA attempted to lend some of the work shown an aura conveyed by the historical context. The object and the work of art were central–not the practice and open, laboratory-like experiments. But, by necessity, «SomeMoreBeginnings» also demonstrated the precarious situation of those that dare to appear in public with technology still in the experimental stage, which does not always work. There is a statistic that shows the gradual technical failure of works with the passage of time.[14] The story of how Billy Klüver encountered the obsessive apparatus artist Jean Tinguely when they were workingtogether on «Homage to New York» (1960) is one of the most impressive accounts of these tensioned- filled circumstances and embodiments of productive dysfunctionality. From the «open artwork» (Umberto Eco) and the musical practices of an artist like John Cage, a link leads to the first processual video experiments with Sony’s «open reel» for its CV- and AV-Portapak half-inch video recorders, the first portable electronic format, that–as the legend goes–was first presented by Nam June Paik to the art public in the Café Au GoGo in 1965.[15] The thirty or sixty-minute tapes, which initially did not allow for editing or subsequent adaptation, were suitable for mobile production and for recording non-dramaturgical, open processes.[16] Bruce Nauman’s or Vito Acconci’s tapes presented situative processes or «attitudes,» with a beginning and end that followed no cinematic or theatrical logic. In a special way, however, Dalibor Martini’s video Performance «Open Reel» (1976) demonstrates how the instability of the electronic signal, often brought about technically by uneven tape tension, can be used as a decidedly artistic element. Open processuality can thus already be recognized in the videotape as a linear recording medium. It is thus not at all surprising that traditionalists questioned the artistic character of the first media art practices, either in the form of tape production, media-supported installations or performance. In fact, critics of technological exhibitions–from «E.A.T.» in the mid-1960s to the ZKM’s «net_condition»[17] show in 1999­-2000, the first major show to survey the artistic and socio-political aspects of the Internet–repeatedly raised the objection that a claim to art was being made, but not fulfilled. The dilemma runs through forty years of the history of media art: is it art, or is it ‹mere› technological experimentation with industrial formats? Given their fixation on the media, many experiments rightly seem in retrospect to be technical phenomena that reflect more the state of industrial hardware and software at a particular time than genuine artistic interest. On the other hand, electronics has now become a self-evident element in a widespread artistic practice, and art no longer has to place the media element in the foreground. The extent to which confrontations with a traditionalmuseum policy triggered their own dynamics can be seen in the following in the formation of a genre of media art.[18] The closed format: Distribution/mass media The loss of the traditional concept of the auratic original and the self-contained work–often described, beginning Walter Benjamin’s famous essay «The Work of Art in the Age of Mechanical Reproduction»[19]–shook the foundations of the art market and art history. It has also become clear that an anti-institutional impetus and the crisis of museum representation were associated with media art from the outset. The power of this constellation can also be seen in attempts to get round this very issue using mass media. Again it is the era of 1968 that sets the paradigms for both delineating borders and overcoming them. Gerry Schum’s «Fernseh- und Videogalerie»[20] is seen as a visionary model for a different kind of art distribution. After the failure of the television gallery, Schum attempted, with a great deal of media resonance at first, to reconcile limited editions and the mass distribution of the individual works of art via alternative routes: «The video tapes come with a signed and numbered certificate.»[21] This can be found in his obviously necessary «Information on the video system» (1972). At the same time, Schum used the museums that had already decided to acquire a Sony half-inch video system to help him convince the undecided institutions. At the same time, Howard Wise made his gallery the world’s first video art sales point, Electronic Arts Intermix,[22] which has remained a central engine for 1970s video art classics in particular to the present day. When one recalls that it was also as early as 1972 that the first institutional video collection started at the Neuer Berliner Kunstverein and that in the previous year in the USA David Ross had become the first video curator at the Everson Museum of Modern Art Syracuse,[23] there is some sense of the innovative potential of those years for exploiting all the media art options, from mass sales to artistic collection. The unresolved question was still: does the sales organization work like a book publisher, or a film producer, who aims at a potential mass market, or does it work like a gallery producing collectors’ editions?[24] It is not just that the old media are continued in thenew ones, as stated by Marshall McLuhan, the production and reception structures are transferred to the new media as a first step.[25] Attempts to reclaim or create old and abandoned or new public locations for this art are therefore one of the continuing characteristics of media art.[26] The lesson of the last decade in particular, with its effortless integration of video into the exhibition context, lies paradoxically in the fact that video, as an infinitely reproducible medium, does not ultimately prevent a work of art from acquiring an aura as long as it can be exhibited as an installation in a museum as an individual work. But even though at a very early stage isolated, established and younger artists followed Andy Warhol and took the notion of the non-auratic medium to absurd lengths, fundamental problems dominated for a long time: 1. Fine art: the museum and the collector trusted neither the dealer’s contract nor the reliability of the new video technology; 2. The film and cinema market: both classical and experimental filmmakers criticized video, which they saw as a cheap and grubby medium, for its poor picture quality in comparison with celluloid; 3. From the outset, television had an unmistakable sense of the fact that media art, even behind the most glittering surface, always conveyed a critical anti-TV attitude, which ultimately culminated in the pointed slogan «TV ≠ VT»[27] at documenta 6. In his 1980s publications, Siegfried Zielinski set out in detail how from the mid-1970s–and very strongly since the establishment of the VHS standard with its mass availability in 1975–the «story of the video recorder» had led to a whole new artistic appropriation practice.[28] The video recorder «kick-starts» classical television. It can deconstruct and defer television, and indeed first provided footage the artist could work with, or made it available to be offered for sale in pirated video form in the video store around the corner. Klaus vom Bruch’s videotapes or Jean-Luc Godard’s film work, especially in his «Histoire(s) du Cinéma,» (1988­1998) would not have been possible without private storage of media history through television and film. Consequently, the concept of «found footage » no longer entails laborious work in archives, but just programming the video recorder. A whole mass of cultural history becomes suddenly accessible as an everyday home production resource.The broadcasters respond by ‹signing› their images with the channel logo, the mass media relic of an artist’s signature–the use of the ‹watermark› is the equivalent for Internet images. Industrial mass production of videocassettes did not merely improve precarious open reel practice by substituting simple «plug and play.» As a consequence of the 1980s TV boom and diversification into commercial and public channels, it introduced a new breadth that led to equal diversification for festivals and forums on the art side. The U-matic cassette format guaranteed a de facto universal standard for a period of about twenty years. This was only occasionally questioned technically or ideologically–see «Choosing U-matic means choosing capitalism.» The argument can be made even more pointed by saying that the cassette form promoted the exchange of information beyond the established markets and those closed to electronic experiments and also became the trademark of an entire art form visually–see the host of cassette catalogs, for example. The best example is the ten-year history of the Infermental «information store,» whose eleven editions can be seen today on permanent loan from the editors in the ZKM Mediathek collection. This magazine in cassette form, founded by Gábor Bódy, operated in galleries as well as at film festivals, art associations, book fairs or other opportune venues. A complex and constantly changing network of editors and artists effectively promoted claims to their ‹own› forums. Here again the simultaneity and the ‹morphological› field are remarkable. Most of the video festivals, which were mainly European, were founded between 1980 and 1982 in Locarno, The Hague, Bonn, and Montbéliard and at Ars Electronica in Linz.[29] These festivals functioned as exhibition, cinema and market, often not very clearly different from a trade show in character, but without ever achieving any kind of commercial significance. It was only in the 1990s that the mass spread of events, conferences, exhibitions and other activities relating to media discourse made it possible for some of those involved to survive financially as artists. Thus one important result was that the practice of independent video production was linked with a utopia of free, two-way information exchange. This was problematical to the extent that the generalpublic felt its image of a commercially ‹worthless› product confirmed. The consequence was: no one wanted to pay for video art, at most it might be offered a free forum on television, for example. This conflict repeated itself in the case of another technological platform in the first phase of the Internet[30] and the current discussion about incentives for collectors and museums to acquire Internet art.[31] The museum format Until now the focus has been on production and distribution formats. For the museums, the problem lay above all in the link with the question about presentation forms that ran counter to traditional practice: the monitor type, for example–is it part of the work of art or not?–or the soundtrack volume, which was often turned down on the monitor by the attendants as a practical measure anyway. From the point of view of the 1980s and the culture of narrative or visual single-channel works in the form of a videotape for monitor reception (whether on television on in the gallery), the present use of large-format projection even for narrative single-channel works raises the question of the weight ascribed to technological arrangements. Have our perceptions shifted, or is a projection simply easier to sell today than presentation on a monitor?[32] Or is this all about the triumphant progress of «expanded cinema» and the need for immersion?[33] Is the victory of the large-format projected image partly the result of the constantly criticized closeness to a television image if it is shown on a monitor, and on the other hand the consequence of an unduly powerful iconographic tradition? The extent to which museum showings promote the acceptance of technological resources can be seen from the triumphant progress of ‹art photography› as a technical medium since the 1980s just as much as in the unquestioning acceptance of a television or newspaper image in the medium of painting, as the most expensive contemporary artist, Gerhard Richter, has proved over and over again.[34] Collectors’ and buyers’ lack of faith in the contractual conditions of a video edition were among the reasons why Gerry Schum’s video gallery failed at the time, but space-related video installations can bemarketed successfully, even when they are reduced to a simple one-channel projection. The aura acquired from museum presentation and the increase in market value this causes reduces prejudice against the medium. Three artistic positions demonstrate the bandwidth of successful commercial presentation: from fine art and its concrete relationship with space and material to the projected videotape (Rosemarie Trockel), from narrative tape production to the art-historically charged museum panel picture (Bill Viola, «The City of Man», 1989) and now also–after the video sculpture–from the eccentric film to involvement with classical sculpture and marketable exploitation (Matthew Barney, «Cremaster Cycle», 1994­2002). The triumphant progress of video as a medium, also perceptible across a broad variety of uses, in the 1990s exhibition world came about because of a changed technological basis. Artists and museum technicians were benefiting from the new, cheaper and simpler technical apparatus, which made them increasingly independent of the media expert’s and the electronics industry’s know-how. Nowadays almost anyone can afford a small data projector. But in the early 1970s this whole electronic business was a Black Box for a lot of museum people, if not to say a black hole that not only threatened ‹not to work› but was also capable of being frightening. E.A.T. even felt it necessary to produce quasi-governmental technical reports about the safety of the technical exhibits.[35] But it became obvious at that time that the museums also had to react to the simple fact that artists were reflecting the media society in media terms. The comprehensive «Project 74»[36] exhibition in Cologne, which represented all forms, was the first to show that documenting and contextualizing a time-based media works exhibition can also succeed in the video medium. The first videotape as catalog was produced, with the assistance of the production group from the Lijnbaancentrum in Rotterdam, using the very new semi-professional U-matic standard. Wulf Herzogenrath, then director of the Kölner Kunstverein, subsequently also became a media art mentor with exhibitions like «Nam June Paik» (1976), «Film as Film» (1977), «Video Art in Germany 1963­1982» (1982), and finally «Video Sculpture in retrospect and today 1963­1989» (1989). The history of the documenta in Kassel can be read in many ways as a seismograph and as an anticipation of central currents in art. Thus both «documenta 6,» the so-called media documenta in 1977, and also «documenta 8,» 1987, are milestones for understanding the handling of the electronic format. While in 1977 conceptual, performative and mass-media public access were at the center of concerns with video, in 1987 an art form established itself that culminated two years later in the major «Video Sculpture» exhibition. This mega-exhibition revealed both a financial and a technological handicap faced by video art: it was dependent on industrial sponsors, as no major exhibition could be financed without them. But public attention could hardly be attracted any earlier, as the ground was not prepared until the Western European television landscape was diversified, commercialized and popularized in the wake of MTV in the 1980s. Monumental installations by Fabrizio Plessi, «Tempo Liquido» (1993), or Marie-Jo Lafontaine, «Les larmes d’acier» (1987), used powerful arts of visual seduction deploying the arsenal of postmodern visual staging and also aiming to bring visual art back into museums. Positions that tended to be more critical, like those adopted by Marcel Odenbach, Klaus vom Bruch, or Dara Birnbaum, did benefit from the wave of popularity but were not able to strike out in any specifically new directions. Video had changed from a conceptual into a sensual medium, playing impressively in quotations with elements of television and of art history. In contrast with the ephemeral quality of «Les Immatériaux,» as the famous 1985 exhibition in Paris by the postmodern theoretician Jean-François Lyotard was called[37], video sculpture remained on the material plane of sculpture, so that in the context of video art as well a traditional concept of the auratic original moved in and triggered commercial success. The dominance of the concept of sculpture in the context of media art now persisted for a few years. This was a populist backward step whether for reasons of marketing or, as Vito Acconci surmised at an early stage, because of a bad conscience[38] that had to yield as quickly to the change of perceptions about art as it had previously to the neo-Expressionist painters, who burned out so quickly. Installations started to liberate themselves from all references to the realobject character of a work and ring in an era of pure image installation, linear or interactive. At the same time it became increasingly clear that a work could be presented contextually in all kinds of new configurations: Nam June Paik’s «Global Groove» transformed itself in the 1970s from a television work into a linear videotape and finally into the multiplied pictorial material for his video installation «TV Garden»–Bill Seaman presented «The Exquisite Mechanism of Shivers» in the (1991­1994) first as a videotape and then as a projected installation, finally as an interactive new configuration on CD-ROM and as a room installation. New formatting, it seems, is an essential aspect of media art. This raises new questions for ‹valid› museum presentation. White cube–Black cube Do media artists just use the existing tools, or do they create and explore new presentation forms and spaces, and their own working materials as well? In the early 1980s, newly developed synthesizers and technological experiments by Nam June Paik, for example, or Steina and Woody Vasulka seem to be only marginally relevant. Artists like Klaus vom Bruch, Gábor Bódy, Marcel Odenbach, or Ingo Günther were interested in different content and a subjective and narrative pictorial language in a given frame, rather than exploring the vectors of image production. Just as in the 1980s, the neutral ‹white cube› established a purist standard in the exhibition world;[39] the Sony ‹black cube› monitor took care of neutral design and standardized picture sizes. The introduction of ever more powerful light projectors also changed the dimensions of room installations, which meant that artists could now choose their ‹framing format› for themselves. «Size matters»–from the Fuji mini-projector, which the American artist Tony Oursler practically made into the trademark for his sculptural ensembles like «Hello?» (1996), Paik’s laser installations, down to the large-scale installations by an artist like Bill Viola, or the large electronic cinema projector: since the 1980s, the question of format has no longer been tied to the plinth-mounted monitor, which conveys presumed origins in the context of television. The electronic image has ‹emancipated› itself in a wide range ofpresentation forms. A darkened space is now also increasingly less necessary. Museum daylight and the proximity to or confrontation with painting that this makes possible becomes a real option.[40] The exhibition by Bill Viola in the Kunsthalle Düsseldorf in 1992 provided a succinct illustration of an artist’s search for a new installation format. He experimented with plinth sculpture and large-format installations, and also with the very new, tiny Fuji projectors, for which he designed a series of minimal, postcard-size wall works. But given the success of the large-format projection, these have not appeared in any of the artist’s subsequent retrospectives. The small gesture did not meet the wish for immersion, which has also been recorded historically by Oliver Grau. One technology that did establish itself immediately in the exhibition field is the wallmounted 16:9 format plasma display. We can see how seductive the connotations of ‹wall picture› are from the fact that videotapes are often presented on such a display even when they are not produced in the wide-screen format. Even lateral distortion is preferred to losing the advantage of the screen-filling image. It is tempting to suspect that perhaps no one has noticed this–which would again shed light on how and with what quality of attention we look at the constantly changing electronic image. Today Microsoft dominates the discussion of the ‹net community› in particular as a diametrically opposed view, in a comprehensive sense of the connection of hardware and software, but it was Sony that dominated the early days of media art technologically.[41] This monopoly situation became increasingly evident in the 1980s. As the years passed, the increasing museumization of media art attracted more vociferous criticism: «Museumization–which some might point to as the best hope of video at present for it to retain its relative autonomy from the marketplace–contains and minimizes the social negativity that was the matrix for the early uses of video.»[42] What Martha Rosler was claiming with a certain degree of bitterness as early as 1986 can probably not be established ahistorically as inherent in the medium. Bruce Nauman’s «Anthro/Socio» at documenta 9 in 1992 can be interpreted as an example of museum quality and of ‹social negativity›. Jan Hoeteven placed it as an entrance portal for the whole exhibition. This artistic statement on behalf of modular work with monitor and projector and the unpretentious integration of technology into installation architecture along with the packaging material stands in stark contrast with the seductive power of pictorial spaces. Paradoxically, precisely this work–along with many other Bruce Nauman installations before and since–is one of the most successful in recent art history, commercially as well. «Anthro/Socio,» with its penetrating sound, would hardly fit into a home environment–this installation was always intended for the public space of a museum. As a rule, media installations work as a link between a (media) view of the public sphere and a subjective view of the world. But both the utopian designs of early media artists like Nam June Paik or Stan VanDerBeek, and also ‹tactical media› activists who have said goodbye to the ‹open artwork› in order to activate an open ‹platform› are evidence of the extent to which this subjectivity can still be embodied only in and through media. From form to platform As well as articulating individual artistic positions, many artists are concerned at the same time about ‹public access›, in other words about universal access to the cultural history of images, about their share in manufacturing this history. While Nam June Paik dreams of a video archive of the avant-garde and a center for experimental arts,[43] Stan VanDerBeek talks about the «image library, newsreel of dreams, culture intercom» in his 1965 Manifesto.[44] In his vision, such centers develop «a material basis for dialogue with other centers at a picture speed of 186,000 miles per second»–an early vision of telematic installation and also of the WWW. Remarkably enough, the exhibition «Information» at MoMA New York presented the first information architecture as part of an exhibition as early as 1970. Thus the exhibition as a device reflects its own virtualization as part of a publicly accessible archive at a very early stage.[45] There are a number of artists who do not see themselves as media artists but have paid attention to specific media aspects and contexts. In «Information» these included Hans Haacke, but also see the later work of Vito Acconci, «Virtual Intelligence Mask» (1993); «UTV» (1994) byHeimo Zobernig and others; Pierre Huyghe «Mobile TV»; or Tobias Rehberger’s «Lying around lazy. Not even moving for TV, Sweets, Coke, and Vaseline» (1996­1999), all of whom are interested in designing the electronic environment.[46] All the 1990s club culture video lounges transpose the concept of the open platform and link it with the idea of a ‹video-on-demand› system that was realized at media art festivals even in the early 1990s as a festival option, but then became a dominant theme because of the rise of the Internet. But the man who actually paved the way for this information architecture was Dan Graham, whose installations had already formulated his specific interest in architectural questions. His use of half-silvered glass then led him in 1986 to construct the first of a series of spaces for video display, «Interior Design for Space Showing Videos,» which as the title suggests could be seen as exhibition architecture, if they had not at the same time also reflected the media quality of our public and private spaces and to that extent also demonstrated an artistic concept. Graham has continued to explore the full range of this concept of transparent and open space until today in a series of works designed for public space. But at the same time artists were working on staging a media activity, without it still being possible to speak of a predefined content. Just as Hans Haacke built an agency’s non-predefined news bulletins into an exhibition for «Information,»[47] two thematic Paris exhibitions successfully addressed communicative projects as the crucial opening for art. «Electra,» 1983, showed items like the Teletext project by Roy Ascott and others called «La plissure du texte.» «Les Immatériaux»[48] presented a collective, interlinked writing project called «Épreuves d’écriture» in 1985, but was also an innovative thematic exhibition in both form and content, which went far beyond art contextually. The rhizome-like connecting lines lead from here to Internet art’s context systems and on-line platforms[49] and the pure Internet exhibitions, as initiated for the first time by the Walker Art Center in 1998 with «Shock of the View: Museums, Artists, and Audiences in the Digital Age.» In 1999 virtual and real space overlapped in the wide-ranging examination of the Internet in the exhibition «net_condition». Thus the museum as an institution was confronted with a paradigm of the laboratory, the workshop and the research center that it was able to integrate onlytemporarily without being able to adopt processual and non-result-oriented works into its organizational structure–even though the «Hybrid Workspace» of documenta X and most recently documenta 11 with its five ‹platforms› postulated this theoretically. Despite the model of the Center for Advanced Visual Studies (CAVS) at MIT in Boston or smaller independent producing venues like the Experimental TV Center in Binghamton, New York, founded by Ralph Hocking in 1971, there were still no institutionally planned centers able to promote the dialogue between media, art and industry. In the early 1990s, the economic boom and above all the start of public discussion about the Internet and the media society finally permitted the concrete planning and opening of new institutions like the Ars Electronica Center, Linz (1966), the Intercommunication Center, Tokyo (1996), or the Center for Art and Technology Karlsruhe (1997), which in their different ways met the need for public and artistic access to expensive technology and also for appropriate presentation conditions, and continuing under different conditions the tradition of places like the Bauhaus, Dessau/Weimar, the Black Mountain College, Ashville, NC, or the CAVS at MIT, Boston. Standards or autonomous use? This was the approach at first: you must appropriate–for artistic purposes–technology that happens to be available. On the other hand you must always work against the limitations and format guidelines imposed by the equipment. So if video signals can be recorded on audiotape, as was possible for example with the Fischer Price toy camera Sadie Benning used for her first video works, this is not an anti-electronic attitude, but a genuine media-artistic approach. In fact Nam June Paik had similarly tried a whole variety of apparatus constellations beyond mere disturbance of a given device, in this case the television image, in the «Exposition of Music–Electronic Television» in 1963. To this extent, one frequently asked question–and this was the case even before the video camera and the video recorder were invented–is always directed at the artists and their specific relationship with the technology used, at craft art as opposed to concept art: can they use a camera or not? Or in today’s terms: can they program or do they get someone to do it for them? Artists like Zbigniew Rybczynski are vehementexponents of the first approach, and others like Fabrizio Plessi are the complete opposite. This dualism runs through generation after generation of ‹artist models.› Behind this is a complex relationship with the question of autonomy and dependence, which motivates contemporary media art towards a practice that is autonomous but also collaborative, which on the other hand corresponds with the do-it-yourself approach of the amateur who gets hold of his software as open source on the Internet. But subsequently to Nam June Paik and E.A.T. there has been a whole new range of apparatuses invented that has either been imitated later by industrial standards or that simply expressed a concrete task to be performed, without having any further effect. The poetics of machinery and their ultra-rapid entrance into history could be admired and tried out at Ars Electronica in Linz in the «Eigenwelt der Apparate-Welt. Pioneers of Electronic Art» exhibition in 1992. The artists/curators Steina and Woody Vasulka did not just accumulate all the old apparatuses, they were also responsible for presenting the show and for the interactive retrieval of the pictorial worlds that they had created.[50] In this way they were marking a change in the exclusive view of what happened to be the most recent technology. More and more artists ‹discovered› media that were now obsolete in the 1990s, thus deliberately opposing increasingly rapid hi-tech development. Siegfried Zielinski speaks of ‹Media Archaeology› or ‹An-Archaeology,› and it was not only the institutions that felt a need to emulate old computer platforms, for example, so that some video games applications and other things could be preserved.[51] Artists also used this emulation strategy, as can be seen from the amazing and extremely successful ‹products› by Gebhard Sengmüller and team. «Vinyl Video» is not just a reminiscence about the birth of media art from the early days of electronics and of music (see Paik), but also an ironic response to the fascination exerted by the analogue videodisk,[52] which has practically been eradicated from the short-term memory today, since the DVD shot in to set the new qualitativelysatisfactory video standard for exhibitions and long-term use. The parallel virtualization of our working environment and the works on telepresence combine in a hybrid fashion with a return to the do-it-yourself economy and media crossover: showing things that are incomplete, staging open processes in the space, being able to watch production and not hiding cables and technology away in illusory spaces, but exhibiting them as an integral part of the ‹project/work.›[53] The idea of the platform and of collaborative production is extended into museum space. But it is precisely the fact that art needs to explain itself–its lack of self-explanatory visual quality–which presents us with new challenges beyond individual platforms. Lev Manovich also talks about the «poetics of enriched space» and its omnipresent openness to digital manipulation: «In the longer term every object may become a screen connected to the Net, with the whole of built space becoming a set of display surfaces. Of course physical space was always augmented by images, graphics and type; but substituting all these by electronic displays makes possible to present dynamic images, to mix images, graphics and type and to change the content at any time.»[54] Something that had hitherto shown up as mediaartistic and project-related now becomes a dynamic, that reformats the whole public space including the museum. The physical space has «data layers» superimposed on it. In Manovich’s view, new concepts and technologies like «ubiquitous computing,» «augmented reality,» «tangible interfaces,» «wearable computers,» «intelligent buildings,» «context-aware computing,» «smart objects,» «wireless location services,» or «sensor networks» prove that we are finally saying goodbye to Modernist minimalism and have to take account of the complex, heterogeneous and contradictory quality of the hybrid data-space.[55] Manovich mentions Janet Cardiff’s «Walks,» which explore the aesthetic potential of overlapping information space and physical space, as an artistic example of such «augmented reality.» Thus the development of our public media spaces is not just the transition from analogue to digital, butalso from homogeneous to heterogeneous and from uniform to multiple. Thus the term platform is no longer relevant only in terms of images and metaphorically in a broader sense. It acquires a 3D quality that is linked with the spatial parameters of navigation–whether this is through displays, touch screens, etc. or in future through mobile individual instruments. William Mitchell is alluding to the central but now obsolete Bauhaus motto when he says under the heading «Form Fetches Function» that the functionality of things will be variable and no longer bound to one place: a monitor is a clock is a television is a stock-exchange telex is a family portrait is a surveillance display.[56] Even if we accept that only part of this visionary option will become reality in the foreseeable future, the principle of the modular and reprogrammable functionality of objects, displays and space remains that Robert Rauschenberg could have had in mind in 1967 when he and the other E.A.T. ‹revolutionaries› wanted to build a space «that responded to the weather, to the people looking at it, to traffic, noise and light.»[57] Software–Soft cinema–Soft space But let us look at the traditional museum space again. The ‹White Cube› isolates the exhibited object from specific spatial contexts and is thus aiming at distancing and reflection on a neutral ground. The ‹Black Box› or better the ‹Black Cube›[58] also works by separating from context (see the often detailed and controlled equipping of these installation rooms with sound- and light-insulating material), but it also isolates the subject in order to admit the sensual immersive element of ‹being in the picture› that reflection usually provokes in retrospect. Cinema as a device has found its way back into museums in many video installations, and helps to restore the aura of works of art. But we should also point out that the database is not the only cultural form marking the digital age: the archive is its counterpart in real space. Thus a media archive within a space becomes an abundance of options that are constantly reconfiguring themselves dynamically. The question remains of the extent to which museums will also open up to visions of multi-sensory, fluid spaces. The invisible omnipresence of software in real space in the cinematographic and the architectural sense of «Soft Cinema»[59] and modular«Soft Spaces» are bound to provoke resistance, revision and nostalgic complaints.[60] Back to the object, to painting, to the image–but beyond the sequence of recursions and fashions–it will not be possible to halt the digitalization of museum space. This is particularly obvious in the case of media art. If it is possible at the same time to keep a whole range of formats and thus of forms alive and to undermine the effects of universal standardization under the banner of MicroSOFT, there will also be room for all the examples that address the dysfunctionality or marginal use of apparatuses, machines and technologies and to preserve a completely independent artistic and poetic potential. Translation by Michael Robinson [1] In the German alternative media publication: Cut In, no. 11, 1982, p. 24. [2] Friedrich Kittler, «Künstler –Technohelden und Chipschamanen der Zukunft?,» in Medienkunstpreis 1993, Heinrich Klotz/Michael Roßnagl (eds.), Ostfildern, 1993, p. 51. [3] Again most recently in Dieter Daniels, Kunst als Sendung. Von der Telegrafie zum Internet, Munich, 2002, pp. 221ff. [4] The most important and finest exhibition on this subject, «Eigenwelt der Apparate-Welt. Pioneers of Electronic Art,» was presented at Ars Electronica in Linz by Steina and Woody Vasulka in 1992. Cf. also Siegfried Zielinski, Zur Geschichte des Videorecorders, Berlin, 1986, and coming right up to date, the list of «Dead Media,» recorded by Bruce Sterling. [5] We can see how much this slogan condenses a certain ‹attitude› from the most recent reference made by the exhibition at theWalker Art Center: «How Latitudes Become Form,» Minneapolis, 2003. [6] Strangely enough, ‹painter› is not a derogatory term. But for decades it was a standard argument from museum directors that they did not collect media art, but artists who ‹happened› to use electronic media as well. [7] Douglas Crimp, On the Museum’s Ruins, Cambridge, MA, 1993, p. 287. [8] Cf. for example Video Cult/ures, Museum für Neue Kunst, ZKM Karlsruhe, 1999; «Vidéotopiques,» Musée de l’art moderne, Strasbourg, 2002, and the presence of video-based installations at documenta 11, 2002, in Kassel. [9] This essay pursues ideas that the author first developed–relating to developments in Germany–in a different form in the introductory essay «Context Video Art,» published in Media Art Interaction–The 1980s and 1990s in Germany, Rudolf Frieling/Dieter Daniels (eds.), Vienna/New York, 2000, pp. 35­59. Key basic material on the relationship between media history and art history can be found in publications by authors like Friedrich Kittler (Grammophon Film Typewriter, Berlin, 1986) or Siegfried Zielinski (particularly Audiovisionen. Kino und Fernsehen als Zwischenspiele in der Geschichte, Reinbek, 1989). Cf. also in particular notes on the anticipatory element in media art in Daniels (2002), op. cit., above all chap. 9. [10] But the report on the Los Angeles County Museum of Art’s «Art and Technology» program makes it clear that such a profound physiological experience also has its institutional restrictions. There was one idea in particular that the museum did not want to follow through: Robert Rauschenberg wanted to construct a tunnel featuring low frequency sounds that would harmonize with the natural heartbeat and could have psychedelic effects. But the museum did not want visitors coming out of the exhibition ‹high›. Cf. Maurice Tuchman, Art and Technology: A Report on the Art and Technology Program of the Los Angeles County Museum of Art, 1967=1971, Los Angeles/New York, 1971. We can see as early as the Philipps Pavilion at the 1958 World’s Fair in Brussels how much the history of the World’s Fair is also a history of artistic experiments: architecture by Le Corbusier, sound and lightshow by Iannis Xenakis and music by Edgard Varèse. Cf. the text «Audio Art.» [11] Robert Breer quoted in press releases on the Pepsi Pavilion, EXPO’70, E.A.T. Collection, ZKM Mediathek. [12] Cf. Jochen Gerz, «The Berkeley Oracle.» [13] Cf. the text «Television–Art or Anti-art?» [14] Statistics about the functionality of exhibits: of 75 works, 37 worked for 100% of the exhibition, 12 over 90%, 5 over 80% etc., in Techne. A Projects and Process Paper, vol. 1, no. 1, New York, April 14, 1969, p. 2. [15] For dating the introduction to 1967 see the reference to Siegfried Zielinski in Rudolf Frieling, «VT ≠ TV–The Beginnings of Video Art,» in Media Art Action–The 1960s and 1970s in Germany, Rudolf Frieling/Dieter Daniels (eds.), Vienna/ New York, 1997, pp. 122f. [16] It is also interesting that a closed circuit installation like Dan Graham’s «Present Continuous Past(s)» made particular use of the possibility of placing the recording and playback apparatus such a distance apart that a delay of exactly eight seconds was produced. [17] «net condition,» ZKM, Karlsruhe; MECAD, Barcelona; ICC, Tokyo; Neue Galerie, Linz 1999. [18] The term media art is a difficult one. It is being used more as an operative factor for art with and through the media than as a precise definition. [19] Walter Benjamin, «The Work of Art in the Age of Mechanical Reproduction» (1936), in Video Culture. A Critical Investigation, John Hanhardt (ed.), New York, 1990, pp. 27­52. [20] There were other private production locations as well as Schum’s gallery, like Art/Tapes, Maria Gloria Bicocchi’s gallery in Florence, and also Ingrid Oppenheim’s studio in Cologne, whose collection was later taken over by the Kunstmuseum Bonn. [21] For example, Schum sold the edition of Joseph Beuys’ «Filz-TV,» which was limited to six copies, for DM 9800, while all limited video pieces were also part of the «Identifications» unlimited edition and cost only DM 1500 and could be rented for DM 300. Later a standard of approx. DM 1000 was set for museum purchases of an unlimited edition, with no associated lending rights. [22] In subsequent years this was followed by sales points that are still operating today: Video Data Bank Chicago, London Video Access (now Lux Distribution),Montevideo Amsterdam, 235 Media in Cologne and Heure Exquise in France. Similar sales structures have not survived in Italy and Spain or in Japan, and in other countries they never emerged at all. [23] He also curated the first museum exhibition «Circuit: A Video Invitational» (1973) at the Everson Museum of Art, Syracuse, N.Y. [24] Resentment can still be felt today in exhibition criticism: if a current, major exhibition seems to be dominated by an electronic medium, a chorus of disapproval goes up from art lovers and critics about this very medium. Just think of the converse: an exhibition is criticized for showing too much canvas. Museum people are equally dismayed if a work of art that exists in electronic form only achieves the same market prices as painting. [25] Conversely, in «The Work of Art in the Age of Mechanical Reproduction» Walter Benjamin had already established the fact that every art form anticipates a new technology: «One of the foremost tasks of art has always been the creation of a demand which could be fully satisfied only later. The history of every art form shows critical epochs in which a certain art form aspires to effects which could be fully obtained only with a changed technical standard, that is to say, in a new art form.» in Video Culture, op. cit., pp. 27­52. [26] See for example Carol Ann Klonarides and Kate Horsfield’s project «Video Drive-In,» Central Park, New York, 1984. [27] Cf. Rudolf Frieling, «VT ≠ TV–The Beginnings of Video Art,» op. cit… [28] Cf. sources including Siegfried Zielinski (1986 and 1989), op.cit. [29] But the German festivals that are still the most important today, the VideoFest, now transmediale, and the European Media Art Festival in Osnabruck, did not come into being until 1988, evolving from existing film festivals. [30] Cf. Dieter Daniels, «Strategies Of Interactivity,» in Media Art Interaction, op. cit., pp. 170­197. [31] Discussions on this theme keep cropping up on various mailing lists, see i.e. «Crumb,» «New Media Curating,» or «nettime»; cf. also the discussion about the acquisition of the Internet artwork «antworten.de» (collection Huber); Steve Dietz, «Beyond the Interface–Museums and the Web,» the works of the early «äda web,» and research by Barbara Basting on aspects of institutionalization of Net Art, «Netzkunst und die Museen–Aspekte der Institutionalisierung einer neuen Kunstform.» [32] Of course this does not include works relating specifically to the monitor. [33] Cf. the text «Immersion and Interaction.» [34] Cf. the text «Virtual Narrations» esp. on the video installations of the 1990s; see also Robert Cahen, «Tombe»; Bill Viola, «The Greeting»; Wolfgang Staehle, «Empire 24/7.» [35] «Museums and galleries must have authoritative evidence that the artist’s work will not in any way endanger the public. Since this system will work concurrently with the State and Federal health and safety agencies, E.A.T.‘s environmental control system will give galleries and museums this reassurance.» Ralph M. Flynn, Jr., Proposal for structuring an environmental safety program for use by galleries, museums, exhibitions and artist/engineer-scientist collaborations, March 15, 1968, E.A.T. Collection, ZKM Mediathek. [36] Kunst bleibt Kunst. Aspekte internationaler Kunst am Anfang der siebziger Jahre, Projekt 74, Wallraff-Richartz Museum, Kunsthalle and Kunstverein Köln, Cologne, 1974. [37] Jean-François Lyotard(Hg.), Les Immateriaux, Centre Georges Pompidou, Paris 1985. [38] Acconci’s view of the artists who had devoted themselves to video sculpture was «a person who is afraid of being out-dated, embarrassed about clinging so hard to the past.» Cited in The Luminous Image, Stedelijk Museum, Amsterdam, 1984, p.22. [39] Cf. Stefan Römer, «Eine Kartographie. Vom White Cube zum Ambient,» in Das Museum als Arena. Institutionskritische Texte von KünstlerInnen, Christian Kravagna (ed.), Kunsthaus Bregenz, 1999. Römer’s thesis is that the corporatization of public space is accompanied by a transformation of the white cube as a representation model into an ‹ambient›. By ‹ambient› he means the exhibition forms in which «the design of a surrounding space, a particular atmosphere of a milieu replaces the presentation of a single art object.» [40] In an exhibition in the Centre Pompidou in 1997, Rosalind Krauss again places the monitors showing Bruce Nauman videos on plinths, but under Perspex this time–an ironic restaging of the video sculpture approach. For the general and generic history of video sculpture cf. Rudolf Frieling, «VT ≠ TV–The Beginnings of Video Art,» in Media Art Action, op. cit.; John Hanhardt (1990) op.cit.; Doug Hall/Sally Jo Fifer (eds.), Illuminating Video–An Essential Guide to Video Art, New York, 1990; Friedemann Malsch/Dagmar Streckel, Künstler-Videos–Entwicklung und Bedeutung, in Kunsthaus Zürich, Ursula Perucchi-Petri (ed.), Ostfildern, 1996. [41] Walter Ruttmann denounced artists’ dependence on industry in the film world as early as 1930 in his essay «Kunst und Technik,» reprinted in Film als Film–1910 bis heute, Birgit Hein/Wulf Herzogenrath (eds.), Stuttgart, 1977, p. 65. [42] Martha Rosler, «Video: Shedding the Utopian Moment,» in Block (Winter 1985­86), reprinted in Hall/Fifer op. cit., pp. 30­58. [43] Letter from Nam June Paik to Allan Kaprow, 1966, regarding the concept for a center for experimental arts, in Wulf Herzogenrath (ed.), Nam June Paik–Fluxus/Video, Kunsthalle Bremen, 1999, p. 113. [44] Quoted in Gene Youngblood, Expanded Cinema, New York, 1970, p. 387. [45] A recent example is in the Museum Boymans-van-Beuningen, Rotterdam, which opened its «Digital Depot» in 2003. [46] Cf. also the works addressing individual perception situations in public space: Nam June Paik, «Airport Seats» (1988); Vito Acconci «Body Capsules» (1984), and «TV Bra.» Cf. also Angela Bulloch/art club berlin 1997; John Baldessari staged living-space functions as a model for corresponding thematic video films in the Witte de With, Rotterdam, 1998; Johan Grimonprez, «Inflight Lounge with the video library ‹Maybe the sky is green and we’re just colourblind?›» (2001); Renée Green, «Partially Buried in Three Parts,» (1999); Apolonija Sustersic, «Video Home Video Exchange,» (1999). [47] Cf. Bill Viola, «The Threshold» (1992). [48] Cf. the volume of essays Elie Theofilakis (ed.), Modernes et après? Les Immatériaux, Paris, 1985. [49] Cf. the text «Interaction, Participation, Networking.» [50] Cf. exhib. cat. Eigenwelt der Apparate-Welt. Pioneers of Electronic Art, The Vasulkas/David Dunn (eds.), Ars Electronica, Linz, 1992. A similarly unusual exhibition of ‹visionary› apparatuses, but one that represented a historical advance, was shown four years later in Budapest under the title «The Butterfly Effect.» Cf. also the even more comprehensive history of viewing machines and pictorial worlds in the Werner Nekes collection: Bodo von Dewitz/Werner Nekes (eds.), Ich sehe was, was du nicht siehst!, Göttingen, 2002. [51] See the Berlin Computergame museum’s informative website. [52] In the 1980s, the videodisc or Laser Disc enabled installation artists like Nam June Paik or Bill Viola to present their works in museums over time without loss of quality caused by daily use of a videotape. [53] Vgl. Van Gogh, «Piazza Virtuale.» [54] Lev Manovich, «The Poetics of Augmented Space: Learning from Prada,» in nettime, mailing list, May 16, 2002. [55] Ibid… [56] William J. Mitchell, e-topia. urban life, Jim–but not as we know it, Cambridge, MA, 1999, p. 49; Mitchell sketches the whole panorama of urban digital linked spaces in this book. [57] Rauschenberg quoted in Henry R. Lieberman, «Art and Science Proclaim Alliance in Avant-Garde Loft,» in New York Times, October 11, 1967, p. 49. [58] Cf. Peter J. Schneemann, «Black-Box-Installationen: Isolationen von Werk und Betrachter,» in Black Box: Der Schwarzraum in der Kunst, Ralf Beil (ed.), Kunstmuseum Bern, 2001, pp. 25­33. [59] Installation by Lev Manovich in the exhibition «Future Cinema,» ZKM Karlsruhe, 2003. [60] See the reference to Kenneth Frampton in Rudolf Frieling, «Storage and Space: Notes on Collecting, Archiving, and Presenting Digital Moving Image Work,» in The Moving Image, vol. 1, no. 2, Fall 2001, pp. 146­151, pp. 148f. © Media Art Net 2004 × 拖拽到此处 图片将通过Fatkun完成下载","tags":[{"name":"Media Art Net I","slug":"Media-Art-Net-I","permalink":"http://liudixian.github.io/tags/Media-Art-Net-I/"}],"categories":[{"name":"媒介理论","slug":"媒介理论","permalink":"http://liudixian.github.io/categories/媒介理论/"}]},{"title":"Github_tutorial","date":"2019-03-20T14:28:51.000Z","path":"2019/03/20/Github-tutorial/","text":"Github 上传步骤 一、 初始化本地仓库 1git init 二、 将文件加入到\b暂存区 123git add filenamegit add -A //添加所有 三、 提交文件 1git commit -m &quot;提交附加信息&quot; 四、链接远程仓库 1git remote add origin git@github.com:&lt;myCount&gt;/&lt;myPath&gt;.git 另外： git status 查看状态 git log 上传日志","tags":[{"name":"github","slug":"github","permalink":"http://liudixian.github.io/tags/github/"}],"categories":[]},{"title":"Shader_Study_01","date":"2019-03-17T06:11:12.000Z","path":"2019/03/17/Shader-Study-01/","text":"Unity shaderLab Standard Surface Shader 标准表面着色器，是一种基于物理的着色系统（使用了Physically Based Rendering（简称PBR）技术，即基于物理的渲染技术），以模拟现实真实的方式来模拟材质与灯光之间的关系，可以很轻易的表现出各种金属反光效果，同时此种Shader的书写逻辑也更符合人类的思维模式。 Unlit Shader Vertex/Fragment Shader,也就是最基本的顶点片断着色器，不受光照影响的Shader，多用于特效、UI上的效果制作。 Image Effect Shader 也是顶点片断着色器，只不过是针对后处理而定制的模版，后处理是什么呢？Bloom（也有人叫Glow/泛光/辉光等说法）、调色、景深、模糊等，这些基于最终整个屏幕画面而进行再处理的Shader就是后处理。 Compute Shader Compute Shader是运行在图形显卡上的一段程序，独立于常规渲染管线之外的，它可以直接将GPU作为并行处理器加以利用，从而使GPU不仅具有3D渲染能力，还具有其他的运算能力。 Shhttps:ader Variant Collection Shader变体收集器，在上面创建的时候，你会发现Shader Variant Collection与以上四个是被隔开的，就是因为这个与它们不一样，它不是制作Shader的模版,而只是对Shader变体进行打包用的容器。 注：以上的Standard Surface Shader、Unlit Shader、Image Effect Shader仅仅只是Unity为了方便我们书写而内置的几个模版，你完全可以建一个Unlit Shader，然后将其改成Surface Shader,同样也可以将一个Standard Surface Shader改成顶点片断着色器，所以这一点一定要明白，它们只是内容格式不一样的模版本而已，我们完全可以自由修改成任意我们想要的一种着色器类型，当然我们也可以通过一些手段来定制出我们自己的模版，这在后续章节中我们再进行详细介绍。 让我们来总结一下Shader与材质的关系： 一个Shader可以与无数个材质关联。 一个材质同一时刻只能关联于一个Shader。（为什么说是同一时刻，因为我们可以通过代码去动态改变材质所关联的Shader） 材质可以赋与模型，但是Shader不行。 材质就像是Shader的实例，每个材质都可以参数不一样呈现不同的效果，但是当Shader改变时，关联它的所有材质都会相应的改变。 举个例子：比如游戏中的怪物，我们只需做一个Shader，然后每个怪物给它一个材质球，材质球上赋与不同的贴图与参数来表现不同的怪物。 小技巧：在创建材质球的时候，如果我们选中某个Shader，然后在它上面点击右键来创建材质的话，那么这个材质会自动与此Shader进行关联，无需再单独指定。 Shader名称路径 第一行的内容是 Shader “Unlit/NewUnlitShader”，如果你的脚本编缉器有语法高亮功能，那么你会看到这一行中的Shader字眼被标注为不同的颜色，表示这是个关键字，后面&quot;&quot;双引号中的内容就是具体的路径与名称。 我们尝试将其名称改成： Shader “TA/MyFirstShader” 在材质球中的路径会变成如下，其中双引号中的/表示的是创建子层级。 同样我们也可以把名称路径改成中文字符（没有在正式项目中使用过，建议大家也不要这样问做，最好还是用英文!）： 如果我们把路径名称放在Hidden下面的话，比如： Shader “Hidden/TA/MyFirstShader” 则表示在材质面板中隐藏此Shader,你将无法通过材质下拉列表中找到它。这在做一些不需暴露的Shader时很有用处，可以使Shader下拉列表更精简整洁。 而Shader文件的名称，也就是我们在Project面板中的资源文件的名称，是可以与Shader内部的路径名称不一样的，这点与C#是不同的。 在定义内部路径名称时，建议统一规划下，不要Shader过多后导致很混乱，不便于美术去使用。 Properties 属性，材质球面板中显示的贴图和一些参数什么的都是在此Properties中进行定义设置的，内容必须写在Properties后的{}内。当然，如果你确定不需要属性的话也可以将整个Properties以及它的{}全部删除，因为它是可选项。 我们下一篇会进行Properties的详细说明，包括如何实现滑杆、开关、下拉选择框等。 SubShaders 如果你够细心的话你会发现为什么SubShaders带个S呢，因为它可以有不止一个呀，实际上每个Shader中都可以包含多个SubShader，不可以没有，必须至少有一个，因为当前Shader的核心算法实现就是在SubShader中来实现的。在加载Shader时，Unity将遍历所有SubShader列表，并最终选择用户机器支持的第一个。 这个功能到底有什么用呢？ 我们都知道不同的硬件性能是不一样的，游戏内通常把机器配置分为高中低三种，假如我们做了一个效果很好的Shader，但是呢却只能在高配机上有较好的性能表现，中低端就显的太费性能，这时怎么办呢，SubShader在这时就可以派上用场了，我们可以在这个Shader内做三个SubShader，分别对应于高中低不同的配置。 FallBack 备胎，就是备胎的意思，有的时候我们写的Shader难免在一些机器上会出现不支持的问题（最终呈现的就是显示成粉红色），而这个时候我们只要添加了FallBack，并且在后面的双引号内写上了其它Shader的有效路径名称，那么在碰到不支持的硬件时这个Shader就会自动切换成FallBack内的Shader，如果FallBack内的Shader也不支持呢，那就继续从FallBack内的Shader中再找FallBack。。。。 CustomEditor 自定义界面，也就是说我们可以通过这个功能来自由定义材质面板的显示结果，它可以改写Properties中定义的显示方式。 举个你一定见过的例子： Standard Shader对应的材质面板显示与众不同，很高级，这就是因为它利用了CustomEditor的功能来实现的，要做到这一点，必须要用到C#来写代码实现，这对于刚入门学Shader的同学来说不是易事，同时也由于这个功能在大多数情况下是不需要的，所以我们先抛开它，知道有它的存在就好了。后续如果有机会我们再专门解讲这个。 Properties \b属性 123456789101112131415161718192021[Attribute]_Name(&quot;Display Name&quot;, Type) = Default Value- Attribute- _Name 变量名 外部访问- Display Name 材质面板上的\b名称 /* 建议这里的显示名称要起的有意义，要知道最终在材质上调节的人很大部分情况下不会是你自己，别人更不可能知道每个属性内部是如何关联以及有什么作用，所以当我们TA在做完一个Shader给到使用人员的时候，一定要给他讲解一下，不管是有个说明文档还是简单沟通下都是有必要的。这样才能最大发挥Shader的使用效果，所以显示名称起着一半说明书的作用，一定要重视。 什么样的名字是有意义的呢？ 作用与通道的组合（在需要说明通道的情况下）。 比如：一张基础表面色贴图，可以用&quot;Base (RGB)&quot;,这样即说明了此贴图是基本贴图，同时又说明了此贴图在表面色上只使用到了RGB三个通道。 */- Type 类型 - Color - int - float - Vector - 2d texture 纹理 - 3d textture纹理 - cube 立方体纹理- Default Value /*默认值，当第一次指定此Shader时，或者在材质面板上执行Reset时，属性的值会自动恢复到默认值，不同的类型具体写法也不太一样，下面会结合类型进行详细说明。*/ \b数据类型 Color example: 1234Properties&#123; _Color(\"颜色\", color) = (1,1,1,1);&#125; 变量名：_Color 显示名称：我是Color 类型：Color 默认值：（1,1,1,1） 颜色属性是个四维分量，也就是由四个数值来组成的，每个数值代表着颜色的一个通道。四个数值依次为RGBA（红，绿，蓝，透明）。 RGB的取值是0-255(2的8次方个值域），而在Shader中被归一化为0-1间。 Shader中的浮点数值后不需要加后缀f，否则会出错。 零点几的值可以省略零，比如0.95可以写成.95 [HDR] 1234Properties&#123; _Color(\"颜色\", color) = (1,1,1,1);&#125; HDR可以使颜色亮度的值超过1，通过这个值可以配合镜头Bloom效果做出物体泛光的视觉效果。 int 1234Properties2 &#123;3 _Int(\"我是Int\", Int) = 14 &#125; 变量名：_Int 显示名称：我是Int 类型：Int 默认值：1 虽然在材质面板中我们可以随意输入数值，比如0.55,但是在Shader内部它却只能被识别为整数。 注意，此值并不是四舍五入，而是直接取整，比如1.999,结果是1. float 1234Properties2 &#123;3 _Float(\"我是Float\", Float) = 0.54 &#125; 变量名：_Float 显示名称：我是Float 类型：Float 默认值：0.5 和Int长的很像，只不过Float中支持浮点数。 在Shader中Float是最基本的类型，而Int只是一种伪整型，从Shader精度上来讲并不存在整型。所以在Properties内完全可以用Float替代Int。 [Range] 1234Properties 2 &#123;3 _Float(\"我是Float\", Range( 0 , 1)) = 0.54 &#125; 很常用的一种属性标记，主要是用来将浮点数限制在一个可以通过滑动条来选择的一个区间。 将此属性中原有的Float替换成Range (Min,Max)即可，Min=最小值，Max=最大值。 PowerSlider 1234Properties 2 &#123;3 [PowerSlider(3)]_Float(\"我是Float\", Range( 0 , 1)) = 0.54 &#125; 我们拿它跟上面的不加PowerSlider来对比，同样是值0.5,在材质面板上滑杆的位置是不一样的。 PowerSlider (Value) 其中Value的值我们可以自由定义，支持浮点数,值越大会导致滑条的曲度变化越大，值为1时不改变。 此属性标记的主要作用，是方便用户调节滑杆。比如有个属性值是从0-1,但是很大部分情况下所用到的值都是0-0.1左右，同时需要更精细的在这区间进行微调。那么正常情况下，用户在整个滑条上想选择0-0.1之间本身就变的很难了，更不要说在这区间微调了。所以这个时候就可以利用PowerSlider来解决此问题。 [IntRange] 1234Properties2 &#123;3 [IntRange]_Float(&quot;我是Float&quot;, Range( 0 , 1)) = 14 &#125; 加了它之后呢，你在材质面板上拖动时就只能生成整数了。所以说我们完全可以用Float来代替Int。 注意，当添加了[IntRange]后，默认值会被自动进行处理，假如默认值你写的是0.1,则在Shader内部会自动向下取整，取值为0. [Toggle] [Enum] 1234Properties2 &#123;3 [Enum(UnityEngine.Rendering.CullMode)]_Float(\"我是Float\", Float) = 1 4 &#125; Vector 四维向量 1234Properties2 &#123;3 _Vector(\"我是Vector\", Vector) = (0,0,0,0) 4 &#125; 变量名：_Vector 显示名称：我是Vector 类型：Vector 默认值：0,0,0,0 由四个Float组合而成的Vector，在材质面板中显示的是四个数值输入框。 四个分量分别对应XYZW，也可以叫做RGBA。 XYZW与RGBA同样都是四个分量组合，只是在用于颜色时我们通常用RGBA来表示，用作坐标时习惯用XYZW来表示而已，同样我们也是可以用Vector来输出颜色，只是不那么方便直观而已。 2D 2D纹理 12341 Properties2 &#123; 3 _MainTex(\"我是2D纹理\", 2D) = \"white\" &#123;&#125; 4 &#125; 变量名：_MainTex 显示名称：我是2D纹理 类型：2D 默认值：white 纹理贴图，也是Shader中最最常用的属性之一。 [NoScaleOffset] 12341 Properties2 &#123; 3 [NoScaleOffset]_MainTex(\"我是2D纹理\", 2D) = \"white\" &#123;&#125;4 &#125; 在材质面板中除了显示贴图槽以外默认还会显示两组Float。 Tiling （贴图重复度） Offset （贴图偏移值） [Normal] 法线贴图 有一点一定要注意，有时美术在其它软件中导出了法线贴图，但在Unity直接拖上来还是会有警告提示，是因为没有在贴图导入面板中把Texture Type设置为Normal，只有这样这张贴图才会被Unity识别为法线。 默认值 2D纹理的默认值有以下几种： white black gray bump 如果不设置默认值，即=&quot;&quot;{}，则其实与=“gray”{}相同。 当设置了默认值后，Shader内部会自动调用Unity内部准备的一张小图片，white就是纯白色,black就是纯黑色，gray就是灰色图，bump就是法线图。 3D 3D纹理 1234Properties2 &#123;3 _MainTex(\"我是3D纹理\", 3d) = \"\" &#123;&#125;4 &#125; 变量名：_MainTex 显示名称：我是3D纹理 类型：3d 默认值：空 3D纹理主要用在查找表或者体积数据上，默认值与2D的不同，不管如何设置都只会显示为灰色图。 Cube 立方体纹理 变量名：_MainTex 显示名称：我是Cube纹理 类型：CUBE 默认值：空 Cubemap是一个由六个独立的正方形纹理组成的集合，它将多个纹理组合起来映射到一个单一纹理。 基本上说CubeMap包含6个2D纹理，这每个2D纹理是一个立方体（cube）的一个面，也就是说它是一个有贴图的立方体。 想像成一个方形盒子被我们拆开铺平的情景。 CubeMap通常被用来作为具有反射属性物体的反射源。 通用属性标记 还有一些比较常用的属性标记，可以用于任何属性，下面来介绍下： [Header] 123451 Properties2 &#123;3 [Header(This is Header )]_Int(\"我是Int\", Int) = 14 _Float(\"我是Float\", Range( 0 , 1)) = 15 &#125; 在材质面板上进行标注，通常用作分类组别用，注意只支持英文、数字、空格以及下划线。 [HideInInspector] 在材质面板中隐藏此条属性，在不希望暴露某条属性时可以快速将其隐藏。 pass 渲染一次模型 模板 1234567891011CGPROGRAM #pragma vertex vert //vertex name #pragma fragment frag //fragment name // make fog work float vert (float4 vert : POSITION) : SV_POSITION //POSITION 语义 &#123; return UnityObjectToClipPos( vert ); &#125; ENDCG &#125; 片段着色器 片断着色器也被称作像素着色器，主要是处理最终显示在屏幕上的像素结果。 经过顶点着色器的处理，我们已经得到了最终显示在屏幕上的顶点矩阵，内部会自动进行插值计算，以获得当前模型的所有片断像素，然后每个像素都会执行一次片断着色器，得到最终每个像素的颜色值。","tags":[{"name":"shader","slug":"shader","permalink":"http://liudixian.github.io/tags/shader/"}],"categories":[{"name":"3d渲染","slug":"3d渲染","permalink":"http://liudixian.github.io/categories/3d渲染/"}]},{"title":"流场与boid","date":"2019-03-13T05:53:56.000Z","path":"2019/03/13/流场与boid/","text":"流场 跟随路径： 跟随路径实现步骤： 随机一个向量矩阵 计算当前速度的未来位置 点 p 计算 向量 A ：流场起始位置 a 到 点 p 的向量 计算向量 B ：计算流场起始 点 a 到 末点 b 计算法线交点位置： 标量投影法 seek( terget) 转向到法线交点延长线上的前方某点 流场：跟随路径： 一、 点乘（点积）： 通过点乘的两个公式可以计算两向量之间的夹角值 cos(θ)=(A⃗⋅B⃗)/(∥A⃗∥∗∥B⃗∥)cos(\\theta) = (\\vec A·\\vec B)/ \\left(\\Vert \\vec A \\Vert * \\Vert \\vec B \\Vert \\right) cos(θ)=(A⋅B)/(∥A∥∗∥B∥) θ=cos−1((A⃗⋅B⃗)/(∥A⃗∥∗∥B⃗∥))\\theta = cos^-1 \\left((\\vec A·\\vec B)/\\left(\\Vert \\vec A \\Vert * \\Vert \\vec B \\Vert \\right) \\right) θ=cos−1((A⋅B)/(∥A∥∗∥B∥)) 12345//processing 实现PVector a = new PVector(10,2);PVector b = new PVector(4,-3);float theta = acos(a.dot(b)/a.mag() * b.mag());//现成的函数 void public float angleBetween(PVector v1, PVector v2); &#123;… :return theta&#125; 二、 标量投影： 计算法线交点 1） 123456789/*方法二 公式化约 - 已知 B = |A| * cos0;- 又 A*B= |A|*|B|*cos0 ---&gt;如果- 如果 |B| == 1；- 则：A*B= |A|*1*cos0 ---&gt; A*B= |A|*cos0（B的长度为'1'）- 因此 d 的计算得以简化为：d = a.dot(b);- 这一过程通常称为“标量投影”，即：|A|* cos(0)就是向量 A 到 B 的标量投影*/“标量投影”，即：|A|* cos(0)就是向量 A 到 B 的标量投影 计算法线交点的两种方法： 普通： 12345678910111213141516void followA(Path p) &#123; //计算未来位置 PVector predic = vel.get(); predic.normalize(); predic.mult(25); PVector predicLoc = predic.add(loc, predic); //预期位置 //计算 向量 A PVector a = PVector.sub(predicLoc, p.start); // a向量 //计算向量 B PVector b = PVector.sub(p.end, p.start); //法线交点位置 float theta = PVector.angleBetween(a, b); //\"点乘\" 计算夹角 float d = a.mag() * cos(theta); //起始位置到法线交点的长度 b.normalize(); //b 向量的方向标量 b.mult(d); &#125; 标量投影： 1234567891011121314151617181920212223void followB(Path p) &#123; //计算未来位置 PVector predic = vel.get(); predic.normalize(); predic.mult(25); PVector predicLoc = predic.add(loc, predic); //预期位置 //计算 向量 A PVector a = PVector.sub(predicLoc, p.start); // a向量 //计算向量 B PVector b = PVector.sub(p.end, p.start); //法线交点位置 /*方法二 公式化约 - 已知 B = |A| * cos0; - 又 A*B= |A|*|B|*cos0 ---&gt;如果 - 如果 |B| == 1； - 则：A*B= |A|*1*cos0 ---&gt; A*B= |A|*cos0（B的长度为'1'） - 因此 d 的计算得以简化为：d = a.dot(b); - 这一过程通常称为“标量投影”，即：|A|* cos(0)就是向量 A 到 B 的标量投影 */ b.normalize(); //float d = a.dot(n); b.mult(a.dot(b)); &#125; Boid类的实现 \b要点： seek(); separate(); flowField(); flowPath(); 公式： 渴望向量： d⃗esired=t⃗arget−l⃗oc\\vec desired = \\vec target - \\vec loc desired=target−loc 转向力： F⃗=d⃗esired−v⃗el\\vec F = \\vec desired - \\vec vel F=desired−vel 复杂系统 知识点： 用转向力计算公式(转向力 = 所需速度 - 当前速度) 实现群集的规则； \b这些转向力有群体产生， 小车要根据所有其他小车的状态计算转向力； 我们需要结合多个转向力，并对他们进行加权； 模拟结果是一个复杂系统——智能的群体行为将从简单的群及规则中产生，系统中没有控制中心和领导者 转向与追踪: 转向角度计算：heading2D(): 返回一个矢量的弧度值: （补充细节） 转向力计算： 转向力 = 所需速度 - 当前速度 $ \\vec F = \\vec Tvel - \\vec vel$ 追踪 seek()： 目标向量计算：指向目标的力(渴望) = 目标位置向量 -\b 当前位置 d⃗esired=t⃗arget−l⃗oc\\vec desired = \\vec target - \\vec locdesired=target−loc 此处可以增加重力对转向力的印象，\b使转向更多样化 矢量场： 追踪线段： \b标量投影法，计算法线到小车的距离 3D Noise 噪音矢量场 Boid 类 分离 separation: \b聚合 cohesion: 对齐 align: 实现对象： Boid() 类 flock()函数管理boid的各种行为 cohesion() align() separation()","tags":[{"name":"流场","slug":"流场","permalink":"http://liudixian.github.io/tags/流场/"}],"categories":[{"name":"Nature of code","slug":"Nature-of-code","permalink":"http://liudixian.github.io/categories/Nature-of-code/"}]},{"title":"虚拟叙事","date":"2019-01-03T15:11:58.000Z","path":"2019/01/03/虚拟叙事-md/","text":"[toc] 虚拟叙事 乔伊斯和交流叙述原则 尤利西斯 约翰·凯奇：Writing for thr second time through Finnegans Wake 实验电影: 尤利西斯 为非线性叙事奠定了基础 根茎 超文本：非时序写作 叙事原则：控制论 --基于规则的叙事 主要演讲 电影、戏剧和电视上的对话 共享式写作活动 Roy Ascott 《文本的褶皱》 数据库叙事 Dialogue with the Knowbotic South Archive Dreaming 电影的非线性叙事 Broken Circle,1997 作品图片链接 Onomatopoeia «拟声词» 在“拟声词”中，工厂地板面对楼上的客厅。电影技术和工业生产技术成为一体。在作品中，一块屏幕悬停在旧的直立式钢琴上。钢琴演奏贝多芬的“C小调奏鸣曲，Opus 111”。由钢琴卷轴上的标点引发，空的纺织工厂的图像被投射到钢琴上方。许多是穿孔卷轴，用于&lt;编程&gt;编织成织物图案，回应用于制作播放器钢琴卷轴的织机。钢琴为表演者点亮，但没有人出现; 同样，工厂里没有人，但装置是&lt;事故现场&gt;。 Win, Place or Show 这个作品的题目来自于赛马投注比赛的选项，同时也是这个电影的主题。两个主人公的对话暗示了比赛结束和对比赛的组合分析。 唐尼和鲍勃，场景中的两个主角，暂时住在这个单人公寓里。它们与1968年温哥华制作的一部电视剧中的刻板印象相呼应，代表了那个时代典型的白人工薪阶层男性。动作场面从关于阴谋论的讨论开始，从赌赢的几率到两人打架的结局。它们是从2 x 10的镜头位置拍摄的。[……]在两个相互挨着的倾斜屏幕上，演员们的位置相对于空间，彼此之间的位置不断地从一个重复到另一个重复。 两个相邻屏幕上的图像似乎互相补充，从不同的视角——或者说不同的叙事层面——重复同一个场景。每当人们认为一个场景正不断重复时，它就变化了，以至于让人们对自己真正看到的东西产生了根本性的质疑。 模仿 自相矛盾的叙事结构 作业： 考开放性的自我叙述：以非线性的叙述逻辑，设计一个关于“我”的体验媒介 沉浸于交互 1997 World Skin 世界皮肤 2009 林茨互动艺术获奖 NEMO OBSERVATORIUM Lawrence Malstaf 气象转播 作品视频","tags":[],"categories":[]},{"title":"艺术驻留","date":"2018-12-22T04:18:46.000Z","path":"2018/12/22/艺术驻留/","text":"艺术驻留与新媒体画廊 “ 论美术馆的自我转型 ”-Whitney Museum of Art 惠特尼美术馆 惠特尼美术馆已有近80年的历史，在美国现代艺术史上和MoMA齐名，但展览却比MoMA更加贴近当下潮流。2015年迁入新馆以后，惠特尼美术馆的展览转向了更前卫的新媒体艺术。一直以来，惠特尼双年展则都在关注新兴艺术家。2017年惠特尼双年展更是邀请了许多新媒体艺术家，如Jordan Wolfson、 Frances Stark 和 Anicka Yi等，使整个美术馆充满了反乌托邦的气息，在艺术圈引起了不小的轰动。 - 🌎：https://whitney.org/ - 📍：99 Gansevoort St, New York, NY10014 - 📧：info@whitney.org 📞：(212) 570-3600 “ 更潮，更跨界 ”-The SHED Museum 当下最被期待、最受纽约艺术圈欢迎的美术馆当属位于高线公园附近的THE SHED，该馆预计将在2019年开馆，其目标是更年轻有活力的艺术家及更新的媒介。值得一提的是THE SHED的首席科学技术官Kevin Slavin已开始与麻省理工学院媒体实验室开展合作项目，THE SHED的创意实验室也开启了一个奖学金计划，致力于为艺术家提供虚拟现实，合成生物学，人工智能等领域的跨媒介的合作。 🌎：https://theshed.org/ 📍：West 30th St, New York, NY1001 📧：info@theshed.org “ 媒体艺术机构的鼻祖 ”-EAI, Electronic Arts Intermix 电子艺术联盟 非盈利机构EAI成立于1971年，致力于创建、展示、分发和保存媒体艺术。机构内的收藏跨越半个世纪，保留有从1960年代中期至今的影像作品，Nam June Paik、Bruce Nauman、Martha Rosler和Joan Jonas等大艺术家的作品都能在这里看到。因此，EAI被公认为是世界上最全面的视频艺术收藏机构之一，也是了解新媒体历史脉络的好去处。 🌎：http://www.eai.org/eai/ 📍：535 West 22nd St, 5th Flr New York, NY10011 📧：info@eai.org 📞：(212) 337 0680 “白盒子空间内的探险 ”-New Museum &amp; New inc 新美术馆&amp;New inc研究机构 New Museum成立于1977 年，成立之初只专注于收藏当代艺术作品，但随着2009年新任馆长上任，美术馆有了新的活力，以新颖、年轻、国际化的展览方式赢得了当代艺术界的诸多赞誉。馆内的地下室设立了新媒体艺术特别展览空间，每年会有5个重要的新媒体艺术展在这里发生。来这儿，你能和最新潮的艺术活动面对面！ 实际上，关于New Museum更值得说的是2013年成立的New inc，来自各领域的人在这里探索艺术、设计以及科技的未来。New inc定期发起不同形式的项目，探索新的艺术形式，呈现多样化的实践。在其网站上能搜到许多和新媒体艺术相关的信息。 🌎：https://www.newmuseum.org/ http://www.newinc.org/ 📍：235 Bowery, New York, NY10002 📧：info@newmuseum.org 📞：(212) 219 2122 “ 更像潮店的艺术空间 ”-Redbull Art NewYork 红牛纽约艺术中心 2017年才成立的Redbull art是一个实验性的非商业艺术空间，展览计划也十分具有野心。已合作过的艺术家从Bjarne Melgaard、DIS到陈貌仁(Mel Chin)，展览具有实验性，媒介也较为多样，空间展陈特别时尚。 🌎：http://redbullartsnewyork.com/ 📍：20w 18th St, New York, NY10011 📧：redbullartsny@us.redbull.com 📞：(212) 379 9417 “住宅内的实践 ”-YveYang Gallery YveYANG的主理人杨迎琳来自波士顿，出于对艺术的爱好投身艺术事业，该空间位于时代广场附近的一间住宅内，主要关注科技、建筑、声音等跨学科领域相关的艺术实践，有时也会开放艺术驻留项目欢迎来自各国的年轻艺术家。 🌎：http://www.yveyang.com/ 📍：532 W 43rd St, New York, NY10036 📧：info@yveyang.com “ 只销售新媒体艺术 ”-Bitform Gallery Bitform Gallery成立于2001年，是一间致力于专注于新媒体艺术的画廊，在吸收各种学科及各类知识观点的同时，热衷于和最前沿的新媒体艺术家合作。Bitform Gallery是比较早做新媒体的画廊之一。 🌎：http://bitforms.art/ 📍：131 Allen St, New York, NY1000 📧：info@bitforms.com 📞：(212) 366 6939 “ 可以做工作室的空间 ”-PRACTICE PRACTICE成立于2015年，由王旭、Cici Wu和Ho King Man 共同发起。这里是艺术家们的共享工作室，也是一个展览空间。PRACTICE欢迎艺术家朋友前来居住并参与他们的项目，他们也销售独立出版物以及艺术家做的玩具。 📍：103 Eldridge St, 4C New York, NY1000 📧：info@bitforms.com 📞：646 340 7764 or 443 851 9691 “ 空间游击 ”-Daata editions @ Vanity project Daata editions并没有真正的实体空间，但对组织和发起线下活动却尤为活跃，最有趣的是活动总会在你意想不到的空间发生。当你在一家美甲店内碰上一场艺术活动时，请不要惊讶，这样的地址就是他们的惯常的活动选址。你永远也不知道会在哪里遭遇并参与到Daata editions的艺术活动之中。感兴趣的话，可以在其网站上获取相关活动信息。 🌎：https://daata-editions.com 📍：99 Chrystie St, 2F, New York, NY 10002 📧：info@daata-editions.com “ 多样生态 ”-47 Canal Gallery 这间画廊由艺术家Margaret Lee 和她男友经营，最初是 Lee 为Cindy Sherman工作时使用的一间办公室，此后才转变成画廊。47 Canal Gallery关注年轻艺术家群体的多样化艺术实践。前文中提到的PRACTICE的主理人Cici Wu也是他们的艺术家。 🌎：http://47canal.us/ 📍：291 Grand, 2nd floor, New York, NY10002 47 Canal, 2nd floor, New York, NY1000 📧：ioffice@47canal.us 📞：(646) 415 7712 “ 大画廊中的异类 ”-Gavin Brown’s Enterprise 成立于1994年的Gavin Brown’s Enterprise是纽约最老牌的画廊之一，是美国艺术圈口中的传奇画廊。这一点，看过他们的新媒体艺术家名单就会知道。Ed Atkin、 Rirkrit Tiravanija、 Mark Leckey、 Rachel Rose等都大牌艺术家都曾在这里展览。 🌎：https://gavinbrown.biz/home 📍：439 w 127th St New York, NY10027 291 Grand St, 3th Flr New York, NY1002 📞：(646) 627 5258 “ 老而弥新 ”-12_Postmasters 鼎鼎大名的Postmasters早在1999年就曾展出过数码艺术家Maciej Wisniewski的作品，在当时可以说极为先锋了，它是涉猎新媒体艺术的最早的画廊之一。最近他们加入了众筹平台Patreon寻求粉丝的财务支持，虽然有陷入财务危机的传闻，但Postmasters依然在不停地为观众带来具有先锋意识的展览。 🌎：http://www.postmastersart.com/ 📍：54 Franklin St, New York, NY10013 📧：postmasters@thing.net 📞：(646) 727 3323 13.“ 虚拟的画廊 ”—Reena Spaulings 这间画廊的名字来自于一本2004年的小说中的虚构女性角色Reena Spaulings，在现实中，她化身为一名艺术家在纽约艺术圈打拼并已小有名气，画廊可以看成是这个虚拟角色的另一个现实身份。查看画廊艺术家名单，Alex Israel、Juliana Huxtable等十分新潮的艺术家的名字映入眼帘，此外，Reena Spaulings的空间设计和展陈会让你误以为来到了一家club。 🌎：http://www.reenaspaulings.com/ 📍：54 Franklin St, New York, NY10013 📧：reena@reenaspaulings.com 📞：(646) 477 5006 14.“ 接地气的实践空间 ”-Sleepcenter Sleepcenter是由来自中国的年轻艺术家林锐建立的一个实验项目空间，位于热闹的唐人街。有趣的展览定期在这里发生，近200平米的半地下室，后面用做工作室，前面的则用来展览，目前，Sleepcenter已经策划25个展览。 🌎：http://www.sleepcenterny.org/ 📍：9 Monroe St, Basement, New York, NY10002 📧：info@sleepcenterny.org 15. “ 一站式驻留 ”–Lower Manhattan Cutrual Council 曼哈顿下城文化局 曼哈顿下城文化局是纽约著名的艺术驻留机构，它们鼓励并促成全世界最有创意、实验性、合作性的艺术计划在纽约发生。2005年至今，曼哈顿下城文化局协助安排超过1000位创作者与20多个空间进行合作。想申请驻留的你可以关注他们的网站。 🌎：http://www.lmcc.net/ 📍：125 Maiden Lane, 2nd Flr, New York, NY1003 📧：info@lmcc.net 📞：(646) 219 9401 在下期中我们将介绍位于皇后区和布鲁克林区的一些与新媒体艺术相关的美术馆、画廊及机构。他们不拘泥于僵化的旧形态，多元化的形式使得它们有着极为强烈的个人化特质和活力，这些独有的特色和魅力吸引着纽约热爱艺术的年轻人。 这些都OUTPUT团队私藏的心水名单，热爱新媒体艺术的你快点把他们放进收藏夹里吧！ Queens皇后区 1.“ 先锋新媒体的定义 ”–MOMA PS1 位于Queen区的MOMA PS1至今已有40多年，原址是一座带有罗马复兴式风格的公立学校，在70年代“另类空间运动”之后成为了当代艺术中心的艺术家工作室和展示场地之后，一跃成为纽约最活跃最先锋的当代艺术机构之一，每年的展览十分多元化，去年MOMA PS1还联合上海K11美术馆策划了一场探讨新媒体艺术的展览，引起过不小的轰动。 🌎：https://www.moma.org/ (Queen区） 📍：22-25 Jackson Avenue, NY 11101 📞：(212) 708 9400 2.“ 影像艺术大本营 ”— Museum of the Moving Image 这座初建于1988年的建筑原本是美国电影博物馆，随着现今移动影像概念的不断扩展及延伸，成为了一处展示电影、电视、电子媒体等不同媒介影像艺术历史与发展的“大本营”，也逐渐成为了年轻人的聚集地，如果你对电影、电视和新奇的数字媒体浓有兴趣的话，去拜访下Museum of the Moving Image肯定会有所收获。 The SHED Mus 🌎：http://www.movingimage.us/ 📍：36-01 35 Avenue, Astoria, NY 11106 📞：718 784 0077 📧：info@movingimage.us Brooklyn 布鲁克林区 “ 非商业化驻留 ”–(NARS) Foundation (NARS) Foundation，是一家位于布鲁克林地区、规模相对较小的非营利性艺术机构。在这里驻留的艺术家较少受商业影响，创作非常个人化，保持着相对纯粹的状态。 🌎：https://www.narsfoundation.org/ 📍：201 46th St, 4th Flr, Brooklyn, NY 11220 📞：718 768 2765 📧：info@narsfoundation.ong “ 跨学科式驻留 ”-Residency@Museum of Art and Design Pioneer Works Pioneer works是一个致力于跨学科实验，教育和生产的文化中心。这里有十分丰富的跨学科教育研究，表演，驻地和展览。Pioneer works的驻地项目主要面向音乐 视觉艺术和科技技术研究，超越了学科界限，培养了激活和支持替代思维模式的社区。努力让所有人都能接触到文化项目。 🌎：https://pioneerworks.org/ 📍：159 Pioneer St, Red Hook, Brooklyn 📧：info@pioneerworks.org ####“ 多元领域全接触 ”–Eyebeam Art + Technology Center 位于布鲁克林偏僻的工业城的Eyebeam可以说是当今新媒体艺术非营利机构中最突出的了，来自世界各地对艺术科技有兴趣的艺术爱好者都会希望可以来到这里驻留，艺术家可以专心完成自己的艺术项目同时也会接触不同科技领域的技术来完善自己的作品理念，在这里一定能接触到你想要的科技艺术。 🌎：http://www.eyebeam.org/ 📍：199 Cook St, Brooklyn, NY 11206 📞：(347) 378 9163 “ 线上与线下 ”–Iscp驻留机构 创立于1994年的ISCP是一家美国纽约的当代艺术非盈利驻地机构，致力于服务中青年艺术家和策展人。ISCP每年都会举办数次线上、线下，具有创新的展览和公共艺术项目。它们的艺术项目重视与观众的对话，并且与当地社区也保持非常紧密的联系。每年都有超过100名艺术家和策展人参加驻留项目，有超过10,000观众参与到它们策划的公共项目中。 🌎：https://iscp-nyc.org/ 📍：1040 Metropolitan Avenue, NY 11211 📞：(718) 387 2900 📧：info@iscp-nyc.org “ 重新定义新媒体 ”–Transfer Gallery Transfer Gallery作为一家只做新媒体艺术的年轻画廊，他们认为现今的艺术家们在互联网上生活，工作和展览的确真正到达了一个联网的全球社区，但在这样的多元化前提下，Transfer Gallery迫切地认为作品依然需要在线下拓展实体空间。尝试用一种新的模式向大家展示，收藏和欣赏艺术。 🌎：http://transfergallery.com/ 📍：1030 Metropolitan Avenue, NY 11211 📧：director@transfergallery.com","tags":[{"name":"艺术驻留","slug":"艺术驻留","permalink":"http://liudixian.github.io/tags/艺术驻留/"}],"categories":[]},{"title":"网站资源","date":"2018-12-22T04:17:50.000Z","path":"2018/12/22/网站资源/","text":"SourceMap资源地图 source Home-edward-weston.com HenriLefebvre日常生活批判研討課-HackMD TheNextGenerationofEmojiWillBeBasedonYourFacialExpressions-MITTechnologyReview WIRED MediaArtNet|Homepage artforum.com.cn/首页 课程首页 中央美术学院图书馆 HomePageinOxfordArtOnline 机构数字图书馆 LSDAHome 检索—中国知网 【果壳网专访】斯蒂芬·沃尔夫勒姆：宇宙的本质是计算|科学人|果壳网科技有意思 Recent-HackMD 媒体技术与理论研究小组-HackMD 一对一在线英语母语教师英语私教英语课程-italki 素材-ResolumeAvenue&amp;ArenaManual ofBook-IntroducingShaders AiritiLibrary华艺在线图书馆 數位音樂創作DigitalMusicComposition 國立交通大學自動化音樂分析與創作實驗室 SoundCloud YourstreamonSoundCloud 北京交通大学公开课：走近数字技术_声音与数字技术_网易公开课 |SonorousPresence Max/MSP VisualizebeatsinAbleton| Coding,SoundsandColors|Ablogaboutalgorithmicexperimentsinmusicandvisualart.Sortof. MediaArt|HfGKarlsruhe music 翻墻 ArsElectronicaArchiv2017 Forum-Processing2.xand3.xForum 如何从苹果iOS11降级至iOS10.3.3_刷机教程_爱思助手 用户中心-贝壳物联，让你与智能设备沟通更方便的物联网云平台 User'sContribution 【Arduino官方教程第一辑】示例程序-目录-CSDN博客 Arduino系列教程之–PWM的秘密（下）（转）-PoweredbyDiscuz! GoogleArts&amp;Culture 有趣的机器学习系列|莫烦Python Morvan-主页-网易云课堂 Arts&amp;CultureExperiments LearningMachines:CourseSyllabus CreativeAI 绘图机器人 电子书 WikiLeaks Creativechain-Blockchaincultureprojectfortheregistrationanddistributionofcontent DIchain的个人资料巴比特论坛 以太坊Ethereum常见问题FAQ-ETH/以太坊 2017设计周_设计周 |||Bitsbitsbits____________________///////////////ЯOSΛMEИKMΛN~~~@~~~DIRDIRDIRA:??blogspot?____________________________________||| artist 格哈德·里希特（GerhardRichter）国外艺术档案 ‎shiffman.net NONOTAKSTUDIO-NONOTAKstudio hongqile KarlSimshomepage untitledPIA|YasuakiOnishi 影像艺术之父|白南准 a/k/anull Recursion-SaschaPohflepp pelang YoHa|ProjectsbyGrahamHarwood&amp;MatsukoYokokoji BretVictor ‎vhmdesignfutures.com/project/75/ mengqi ProfessorMikePhillips|i-DAT ravenkwok AboutJifei|JIFEIOU LawrenceLek PeteAshton'sArt|GoodbyeWittgenstein JimCampbell PAUL-A|PATRICKTRESSET AnthonyMcCall About|INITI INITI.orgonVimeo 王俊傑|台灣當代藝術資料庫 AdrienM&amp;ClaireB Themovementofair–AdrienM&amp;ClaireB (17)余音绕梁SoundArt_新浪博客 fito_segrera PerryHoberman DailySketchesin2016–zachlieberman–Medium RefikAnadol–MediaArtist+Director 看到这个声音|展览|网页归档|座谈会 旅行者：⬛ Loop:⬛ visualcomplexity.com|对复杂网络进行映射的视觉探索 dextro.org/default_a.html KyleMcDonald holgerlippmann»3D DanielFranke onformativeonVimeo anadlol 机械生物 - 崔有让Choe U-Ram 邵志飞jeffreyshaw 克里斯多夫christojeanneclaude 德国奥伯豪森煤气桶展览馆 gasometer Saraceno 网络式系统 空中行走 Saraceno官网 埃利亚松notion motion Studio Drift 漂浮立方 这个小组\b与pace签约，作品制作精致，大部分外表气质往奢侈品方向倾向 离子合成-艺术家组合-声音图像 Ulf Langheinrich 德国人 Kurt Hentschlaeger 奥地利人 Stephen Vitiello-声音艺术家 codct 声音-机械 technic Arduino中文社区-PoweredbyDiscuz! Engadget中国版-消费性电子产品新闻和评测 SAVEVIDEO.ME:downloaddailymotionvideo,downloadvimeo,facebookandmore! Pureimagetreatmentquestion:wichevolutionforvvvv?-question-theForum 微信小程序-JavaScript开发社区|CTOLib码库 (雾霾数据）U.S.DepartmentofStateAirQualityMonitoringProgram 下載Twitter視頻至MP4和MP3！在線簡單&amp;免費 DerivativeTouchDesigner VPT7|Conversationswithspaces News&amp;Updates—MITMediaLab ‎www.dac.tw/# 深度学习工程师微专业-一线人工智能大师吴恩达亲研-网易云课堂-网易云课堂 JAVA在线文档-jdk-zh 我的会议-Zoom MYGithub java library source daniel shiffman 代码教学 网站 Sounds ABLETIVE电子音乐社区-ABLETONLIVE中文资源站|Launchpad教学、技术、工程 InstituteforComputerMusicandSoundTechnology|ZHdK.ch VCV-Open-sourcevirtualEurorackDAW 电声计算器 Freesound.org-soundsearch (12)博文_余音绕梁SoundArt_新浪博客 互动软件学习笔记–Processing,MaxMSP,AudioMulch,Field,SuperCollider Tidal-CD音质音乐平台 ###coding Python基础语法|菜鸟教程 【创意编程教程】Processing初接触编程？|创意编程 GenerativeDesign,ArtandScience-CelestinoSoddu HTML参考手册 ThomasDiewald(GPU加速） Codes-GENERATIVEGESTALTUNG （L系统）AlgorithmicBotany:Publications ProcessingforAndroid About|THEMAS-ATHEMASCourse Wolfram|Alpha:ComputationalKnowledgeEngine BignaturalshipinB358/S23–MathematRec 基于知识的Wolfram语言编程 OF中文教程 CSS教程 25life-savingtipsforProcessing|AmnonP5-ExperimentswithProcessingbyAmnonOwed 在线网络爬虫/大数据分析/机器学习开发平台-神箭手云 OFCOURSE FreeVimeoVideoDownloaderOnline-KeepVid Processing+EPOCviaOSC–Hyperritual AVA:AVideoDatasetofAtomicVisualAction MomentsinTime DeepMindResearch – Kinetics|DeepMind SLACDataset 【资源帖】深度学习视觉领域常用数据集汇总-Hanson1-博客园 100款机器学习数据集-CSDN博客 deeplearning.ai 欢迎使用马克飞象-马克飞象-专为印象笔记打造的Markdown编辑器 MomentsintimeMIT-IBM笔记[小书匠] Software-ProjectionMappingCentral 用户中心-Mr.blank-奇异之旅 Midaart&amp;Theory 相关学者 LevManovich-home 斯提格勒 许煜 Zielinski Markhansen 科技-艺术-设计 媒体类 CLOT Magazine|Art explorations into Science and Technology WIRED New MediaGarden.NET|NewMediaGarden.NET 艺术界消息-瀑布流媒体e-flux 媒体艺术团体 ART+COMStudios|Greifpendel News&amp;Updates—MITMediaLab 分形艺术研究 The imaginary Kingdom of Aurullia-Interpretation of Mandalay fractal by@subblue 网页渲染 曼陀罗集3d http://hirnsohle.de/test/fractalLab/ 艺术节 林茨电子艺术节作品档案Ars Electronica Archive Transmedialedigitalculture|transmediale BMAB 媒体艺术画廊 bit forms gallery 研究机构 国内 网络社会研究所-中国\b美术学院挂媒体学院-黄孙权 器道-许煜-斯提格勒‎philochina.org/?lang=zh 新时线媒体(CAC)艺术中心–ChronusArtCenter 国外 德国-Startseite|ZKM 瑞士-HeK 法国-Muséedel'Elysée 关于-不稳定媒体的V2_Lab 学术资源&amp; 前言研究成果——感官研究 加拿大大媒体艺术学术研究组织RéseauHexagram-家 感知城市MIT Senseable City Arts at MIT 荷兰某美术馆stedelijk 荷兰美术馆 boijmans 西澳大利亚生物实验室-oron 荷兰鹿特丹V2_ 艺术家网站 Instgram-图像切片 PeteAshton'sArt|SittingInStagram GrahamHarwood—V2_LabfortheUnstableMedia epidemic EPIDEMIC支持创建将艺术，科学，表演，新媒体相结合的国际艺术家。 EPIDEMIC培养出艺术，科学，表演艺术和新媒体相结合的国际艺术家。 通过全球网络的发展，EPIDEMIC多年来一直支持以下工作： 在全球范围内开发网络使EPIDEMIC得以支持 Robert Lepage（QC），Dumb Type，Shiro Takatani和Saburo Teshigawara（JP），Granular-Synthesis，Kurt Hentschlager和Ulf Langheinrich（AU），Jean Michel Bruyere / LFKs和Du Zhenjun（FR）。 EPIDEMIC及其主任Richard Castelli经常被邀请参加会议，专业知识或展览中心： EPIDEMIC及其主任Richard Castelli经常被邀请参加会议，专家或展览策展人： （柏林，伊斯坦布尔，巴黎，北京，罗马，上海…）。 VJ理论-《PHILOSOPHY AND CULTURAL THEORY OF VJING AND REALTIME INTERACTION》–Graular Synthesis组合的采访 技术-实现 Processing 书籍-代码 FORM+CODEInDesign,Art,andArchitecturebyCaseyReas,ChandlerMcWilliams,andLUST OpenProcessing-Shareyoursketches! \b传感器-arduino-电子元件 奥松机器人 DFrobot desjgn Behance在线作品集 Pinterest:Discoverandsavecreativeideas 波兰海报收藏ContemporaryPosters-Originalcontemporary/vintagePolishposters-Wasilewski,%20Mieczyslaw TypeisBeautiful 设计导航-精选最好的设计网站大全 FutureDeluxe—Design,Technology&amp;MovingImage 北京熙呈互动——面向未来的互联网和移动平台的体验探索者！ 其他 爱学术_免费学术资源下载 中国哲学书电子化计划 哈德遜河上的荷米斯：對史諾登事件後的媒介理論之觀察|論述資料庫|台灣數位藝術知識與創作流通平台 万千合集站最专业的学术资源搜索引擎学术资源搜集和整理学术资源分类和下载 hackpad 任远媒体实验室的个人主页-站酷(ZCOOL) 软件◆分享|Linux.中国-开源社区 首页-廖雪峰的官方网站 电影首发站电影网-高清电影下载_迅雷电影下载_高清迅雷电影下载_免费电影下载 DISMagazine LabfortheUnstableMedia—V2_LabfortheUnstableMedia 荷兰画家老·彼得·勃鲁盖尔介绍及作品欣赏_文艺复兴_油画图库_有画网_第3页 可以找油画图片 【新提醒】liudixian123的空间-CG模型网 StudioOlafurEliasson 微信编辑器_微信编辑工具_微信图文排版_微信内容编辑_微信图文编辑_微信文章编辑_微信编辑素材_微信内容编辑软件_微信公众平台编辑器-易点微信编辑器 BrushesDesign&amp;IllustrationTutorialsbyEnvatoTuts+page2 配色网-致力色彩搭配方案的交流与学习 405e2eColorPalettes 电脑字体下载大全–中文字体下载,英文字体下载,书法艺术字体下载,QQ字字体下载 腾讯课堂_专业的在线教育平台(ke.qq.com) MSDN,我告诉你 BootCamp支持软件5.1.5640 Hesignbrand UI文章专题-UI中国-专业界面交互设计平台 Flickr：相機搜尋器︰Canon:EOS5DMarkIII 站酷(ZCOOL)-设计师互动平台 Stockphotos,royalty-freeimages,video&amp;musicclips-iStock About-GENERATIVEDESIGN 提示信息-CG模型网 TheCreatorsProject|TechnologyandtheBrightestYoungMindsinMusic,Art,Film,andDesign AdsoftheWorld™|CreativeAdvertisingArchive&amp;Community 国外设计网站大全_国外素材网站 荔枝FM,《我是歌手4》第四季直播,全网独播！ 德语DeutscheVerbformen|Verbenkonjugieren 青年艺术100 新东方在线官网_新东方旗下远程教育网站,新东方网络课堂,新东方网校,新东方官方网校,新东方网络课程,新东方考研辅导班 Beijing,China-Airbnb Mate7手机测评-Mate7手机价格对比-ZEALER测评工具 GerritRietveldAcademie APS|AkademischePrüfstelle randian 字体选择_有字库 创业指南_创业指导-创业邦 美术圈机构管理主页 谷德设计网 谷德设计网 ikuku.cn|在库言库：成立于2012年1月以公益为目的的中立观点的线上开放聚合的百年华人建筑库 首页-美术宝诚信画室后台 最全的诚信画室信息网-找画室上美术宝【您有新信息】美术宝诚信画室大全-全国 MAKA简单、强大的HTML5创作平台 零艺术中心ZEROARTCENTER AllCategories-Processing2.xand3.xForum 首页_前线网、艺术前线_一个独立、自由、开放的当代艺术平台-前线网、艺术前线 http://caachina.org/ Artsy-Discover,Research,andCollecttheWorld'sBestArtOnline YouTubeVideoConverterandDownload-ClipConverter.cc MOT/TIMES線上誌｜藝術.設計.電影.生活.建築.音樂.表演.時尚.人物 计算机程序设计（C++）_中国大学MOOC(慕课) 百度网盘搜索引擎 Java程序设计|Coursera qc指南 SearchThingiverse-Thingiverse QuartzComposer入门-B3bohemia's-设计多一点乐趣 Register-AppleDeveloper UlfLangheinrich 首页•IHDT上海映速•C4D官方国际认证培训中心（中国） MAXONCinema4DR16WIN/MAC注册机破解完全版|GFXCamp Google YouTube 微信公众平台 苹果中国 百度 必应 Yahoo 豆瓣同城_北京 artforum.com.cn/首页 创想计划：科技时代的创意革命｜VICE中国 productspecs—eMotionTechnolgies::WearableTechforPerformers 鲸男–LeiGao»艺术系的互动入门－4－非代码编写类软件－Max/Msp,PD 日雅网-日本代购-riyawang.com documenta 關于協會Wirüberuns-德国华人艺术家协会Deutsch-ChinesicherKünstlervereine.V. 一个日本人收集的艺术家档案 kk Apple iCloud 新浪网 Bing 百度百科 新浪微博 QQ空间 领英 优酷 大众点评 猫途鹰 Google翻译 通元内容管理系统 BringtheSunIndoors 【雅昌讲堂3432期】罗欢：人脑不是被动处理器 脑洞不保？！日本深度神经网络算法重建人脑中图像_手机新浪网 透明LCD交互项目 pdf图书馆gen lib","tags":[{"name":"网站收藏","slug":"网站收藏","permalink":"http://liudixian.github.io/tags/网站收藏/"}],"categories":[]},{"title":"科技艺术史工作坊_Krac","date":"2018-11-26T01:18:54.000Z","path":"2018/11/26/11-26-Krac/","text":"第一日 电磁图景 上午：无线电和非具身的声音 下午：拉兹洛·莫霍利-纳吉：从电话图像到光与空间的调节器 Day 1 The Electromagnetic Landscape Morning Radio and the Disembodied Voice Afternoon Moholy-Nagy: From the Telephone Pictures to the Light-Space Modulator 艺术和科学和技术的联系从一开始就在艺术实践中出现，虽然不是我们所谈及的，油画和摄影的关系，浪漫主义和工业进程的关系，我们可以从历史上看到很多。 今天我们要谈的艺术和科技从何而来。如果技术对艺术一直有影响，那为什么我们今天还要聊这个，20世纪开始由格罗皮乌斯表述这是一个新领域 20世纪初艺术和科技一开始是分开的，19世纪的工业革命带来的社会变革，城市生活和我们所理解的一切形成和聚合了一起 在他的叙述背后，19世纪所发生的一切，摄影，电报等等，人们都已经经历了这一切，且为艺术所反映 摄影是的绘画陷入危机。我们在摄影之前不知道绘画的光线是怎样，不知道马的蹄子是否扬起，摄影精确的记录这些。 艺术是回应技术带来的变化，是一种敌意的关系，格罗皮乌斯说我们要改变这种关系，产生一个共同的领域。 所以我们关注的是这种新的情况，艺术和技术不再遥远，艺术开始用技术创意的工作，创造各种新的视觉等等。 20世纪初，我们有这种绘画的遗产，制作物品手艺的传承，我们有技术的发展，所以这些人自己经历了这种深刻的变化。 绘画中传统的凝视，是一种固定的视角，但20世纪初我们会抬头看飞机，看地平线运行的火车，所有的物体都在动。 我们可以传送电报，人类语音可以远距离传送，所以这种戏剧性的转变和感受出现在了20世纪初的艺术。 电运行的越久，就越会衰减。通过电子设备，可以进行放大，将衰减的声波进行传递。 当我们谈到电子艺术，而radio就是第一个电子艺术形式,从20世纪初到30年代，radio逐渐走进千家万户 电波有一个社交功能，当你用radio时，别人也在用这些。当你在考虑是要反对，揭示等等对待这个技术时，那时的艺术家也要考虑这些。 当我们谈到电脑从很大到变成很小时，我们也要考虑其中的社会和技术变化，这对电波广播也是一样的，要去考虑它的语境。 radio在那时不是一个普遍的技术，而是一个实验性的技术，你得自己建接收器之类的 无线电在20世纪之初不是大众媒介。需要建立自己的接收站。 当我们谈到电脑从很大到变成很小时，我们也要考虑其中的社会和技术变化，这对电波广播也是一样的，要去考虑它的语境。 Radio Drama[1] 无线电剧场 the war of the worlds 第二日 动态艺术：从再现到真实的运动 上午：从再现到真实的运动-第一部分 下午：从再现到真实的运动-第二部分 Day 2 Kinetic Art: From Representation to Actual Motion Morning Kinetic Art: From Representation to Actual Motion — Part 1 Afternoon Kinetic Art: From Representation to Actual Motion — Part 2 \b下午： Oskar fishinger: 剪辑影像生成声音 Oscar毕生都在发展这种形式，1922做了这个Wax Mchine Ruttmann记录了声音到胶片，然后用剪子剪辑，这种方式启发了很多艺术家，如果你可以用声音代替视觉，那么你也可以用这些影像来带动声音，这就是声音合成的开始。 他也有个基金会：http://www.oskarfischinger.org/ http://www.oskarfischinger.org/OF_Filmo.htm 6:http://rhizome.org/editorial/2009/apr/07/studie-nr-6-1930-oskar-fischinger/ 他是第一个毕生投身视觉音乐的人。这样的艺术形式不能被简单对待成音乐图片，它是一种独立的形式，视觉是有时间性的，是在时间领域里的。 Oskar Fischinger为了将动态及情绪变化的戏剧效果可视化而自制了一部切蜡机(Wax-Slicing Machine),创作了第一批抽象短片。这部机器同时操作摄影机的快门及一组切蜡装置；当刀片将预先准备好的“彩色瓷土混蜡块”切下一薄片而露出横切面的肌理纹路时,快门便自动开启拍下此画面。如此反复操作直到蜡块切完为止。当拍好的影片放映时,蜡块中“空间性的静态造型变化”转换成影片里随时间变形的图像。举例来说，蜡块中一个朝向镜头的锥形体,拍摄后便呈现出一个逐渐扩大的圆，然后突然消失。 费钦格将磁石粉与蜡加热,再倒入旋转中的冷油水里制造出配合切片机所需的蜡块。制作过程中许多巧合因素可得到一些不寻常的造型。在影片中最令人耳目一新的图像之一是一个个慢慢开展的玫瑰图案和一同心环状附在一起朝着相反方向旋转,好像一对螺旋形没入银幕之中。可惜费钦格的切蜡实验影片没有一部完整的留下来，只残余一些两三分钟黑白无声短片。 1936，24帧/秒，每一秒需要手画的24张，他听到的音乐是原创的，他得看着曲子结构，分析时间结构，他得记住每一秒的情形，然后创作出来。 这其中需要注意的是，Moholy的黑白灰是无声的，对角线交响乐也是无声的。Fischinger活在声音跟电影开始同步的实验时期，他试图做一个声音和视觉产生同一的效应。 https://www.theguardian.com/artanddesign/2013/jan/09/oskar-fischinger-animation-disney-nazis 为了生存，他接受了委托。这是1933年的一个委托。 他在这个作品中用了很多技术，自创的，stop motion的技术，还得使用滤镜等等，非常复杂。 他得将空间分解，根据曲子的节奏分解，他得将空间看作flow,duration，这跟你对图像的想法非常不一样。 https://www.moma.org/collection/works/107439 第三日：新图像：电子、数字和光子图像 上午：电视和录像：艺术与大众媒体 下午：计算机艺术：从数字图像到互动以及VR Day 3 The New Image: Electronic, Digital, Photonic Morning Television and Video: Art and Mass Media Afternoon Computer Art: From Digital Graphics to Interactivity and VR 第四日：行为、意识与互动性 上午：艺术与机器人学：行为美学 下午：电信，网络艺术和遥现：实时全球化 Day 4 Behavior, Awareness, and Interactivity Morning Art and Robotics: Behavioral Aesthetics Afternoon Telecommunications, Web Art, and Telepresence: Global Scale in Real Time 第五日：从活体艺术到生命作为艺术媒介 上午：赛博表演：技术与身体 下午：生物艺术 Day 5 From Live Art to Life as an Art Medium Morning Cyborg Performance: Technology and the Human Body Afternoon Bio Art is a dramatized, purely acoustic performance. wiki ↩︎","tags":[],"categories":[]},{"title":"11/25_mt","date":"2018-11-25T12:53:05.000Z","path":"2018/11/25/11-25-mt/","text":"东亚疯狂叙事 自动驾驶 \b电动车 人工智能 5g 东南亚/拉美神秘主义科幻 北欧，德国返璞归真论 加州车库创新神话 技术超超级大国与技术民族主义之间对峙 地球村 中国的技术想象","tags":[{"name":"mt&t","slug":"mt-t","permalink":"http://liudixian.github.io/tags/mt-t/"}],"categories":[]},{"title":"processing入门工作坊","date":"2018-11-25T06:47:09.000Z","path":"2018/11/25/processing入门工作坊/","text":"入门工作坊 什么是编程语言？ processing/java、arduino/c、max/msp vs 流程图？ 任意一种编程语言，如c,c++,java,python等等，不论高级与低级，都是人和机器进行沟通的媒介；人将自己的思想逻辑通过\b某种规则告诉机器，并储存在电路当中，转化为\b一种物理的过程\b\u001c，并让机器去不断重复的去执行。 编程语言的类型 \b底层：机器语言 机器语言 机器语言-图 汇编语言 汇编语言-图 高级语言： 编译型：C, C++ 解释型：JAVA，python，javascript 编程语言影响力网络[1] 编程语言继承关系图[2] 编程语言类型图[3] ###Processing？ Java / Processing 1. JAVA是材料 – Processing是“画室” library（预建立好了各种工具） &#123;.line-numbers&#125;1234567#javapublic class HelloWorld &#123; public static void main(String[] args) &#123; System.out.println(\"Hello World\"); &#125;&#125; &#123;.line-numbers&#125;12# processing print(\"Hello World\"); processing简述 画图/计算机图形学 像素，在坐标系里画图 通讯 udp tcp/ip serial \b基本语法 结构化编程 函数 面向对象 library 算法 流程图在线编辑器 https://live.yworks.com/demos/index.html reveal 教程 https://vxhly.github.io/2016/09/reveal-js-cn-document/ books:https://www.amazon.com/shop/thecodingtrain?listId=1YF77ROKCEOO2 https://exploring-data.com/vis/programming-languages-influence-network/#Processing ↩︎ http://www.digibarn.com/collections/posters/tongues/ComputerLanguagesChart.png ↩︎ https://3.bp.blogspot.com/-ZO6GWAH1X5M/WboFm3I43sI/AAAAAAAADME/9wFX09iodqcldya0A3L-pVbfJTUSz7kmwCLcBGAs/s1600/language.jpg ↩︎","tags":[],"categories":[]},{"title":"媒体技术课程","date":"2018-11-25T05:14:12.000Z","path":"2018/11/25/媒体技术课程/","text":"Processing 入门课程 本课程将从processing开始讲起但不局限与processing。 媒体艺术/或者说科技艺术作品通常不是单一的技术手段完成的，processing通常被用来可视化或提供复杂控制，arduino是连接硬件的方便工具，而max/msp/Ableton live是非常强大的声音处理平台。一个完整的媒体艺术作品通常会使用到其中一两个平台/工具。 但所有使用这个技术的基础是——你需要你懂得一些数字控制的思维方法，而这中思维方法需要你在编程的过程中学习得来。\b所以processing不是一个“一招先，吃遍天”的万能法宝，它只不过是一个最适合入门学编程的语言，让你快速的领会数字控制的工作方法。\b\b因此我们的课程是以processing来练习编程思维的基础上，学习如何\b如何快速使用\b可编程\b软硬件工具实现你作品想法。 课程入口： 知识点概要： 画图 基本绘画元素 通讯 udp tcp/ip serial \b基本语法 数据类型 条件语序与循环 … 结构化编程 函数 面向对象 library","tags":[{"name":"processing","slug":"processing","permalink":"http://liudixian.github.io/tags/processing/"}],"categories":[]},{"title":"p5js_learning","date":"2018-11-21T09:02:52.000Z","path":"2018/11/21/p5js-learning/","text":"函数 函数的定义与调用 1234567891011121314151617//第一种function abs(x) &#123; if (x &gt;= 0) &#123; return x; &#125; else &#123; return -x; &#125;&#125;//第二种var abs = function (x) &#123; if (x &gt;= 0) &#123; return x; &#125; else &#123; return -x; &#125;&#125;; //最后要加上‘；’ function指出这是一个函数定义； abs是函数的名称； (x)括号内列出函数的参数，多个参数以,分隔； { ... }之间的代码是函数体，可以包含若干语句，甚至可以没有任何语句。 请注意，函数体内部的语句在执行时，一旦执行到return时，函数就执行完毕，并将结果返回。因此，函数内部通过条件判断和循环可以实现非常复杂的逻辑。 如果没有return语句，函数执行完毕后也会返回结果，只是结果为undefined。 由于JavaScript允许传入任意个参数而不影响调用，因此传入的参数比定义的参数多也没有问题，虽然函数内部并不需要这些参数： 12abs(10, 'blablabla'); // 返回10abs(-9, 'haha', 'hehe', null); // 返回9 argument:返回所有参数 rest:返回除定义参数之外的所有参数 12345function foo(a, b, ...rest) &#123;console.log('a = ' + a);console.log('b = ' + b);console.log(rest);&#125; rest参数只能写在最后，前面用…标识，从运行结果可知，传入的参数先绑定a、b，多余的参数以数组形式交给变量rest，所以，不再需要arguments我们就获取了全部参数。 js的函数可以嵌套 123456789'use strict';function foo() &#123; var x = 1; function bar() &#123; var y = x + 1; // bar可以访问foo的变量x! &#125; var z = y + 1; // ReferenceError! foo不可以访问bar的变量y!&#125; JavaScript的函数在查找变量时从自身函数定义开始，从“内”向“外”查找。如果内部函数定义了与外部函数重名的变量，则内部函数的变量将 “屏蔽” 外部函数的变量。 变量作用域与解构赋值 变量提升 由于JavaScript的这一怪异的“特性”，我们在函数内部定义变量时，请严格遵守“在函数内部首先申明所有变量”这一规则。最常见的做法是用一个var申明函数内部用到的所有变量： 12345678910function foo() &#123; var x = 1, // x初始化为1 y = x + 1, // y初始化为2 z, i; // z和i为undefined // 其他语句: for (i=0; i&lt;100; i++) &#123; ... &#125;&#125; 全局作用域 12345678910111213'use strict';window.alert('调用window.alert()');// 把alert保存到另一个变量:var old_alert = window.alert;// 给alert赋一个新函数:window.alert = function () &#123;&#125;//alert('无法用alert()显示了!');// 恢复alert:window.alert = old_alert;alert('又可以用alert()了!'); JavaScript实际上只有一个全局作用域。任何变量（函数也视为变量），如果没有在当前函数作用域中找到，就会继续往上查找，最后如果在全局作用域中也没有找到，则报ReferenceError错误。 名字空间 全局变量会绑定到window上，不同的JavaScript文件如果使用了相同的全局变量，或者定义了相同名字的顶层函数，都会造成命名冲突，并且很难被发现。 减少冲突的一个方法是把自己的所有变量和函数全部绑定到一个全局变量中。例如 1234567891011// 唯一的全局变量MYAPP:var MYAPP = &#123;&#125;;// 其他变量:MYAPP.name = 'myapp';MYAPP.version = 1.0;// 其他函数:MYAPP.foo = function () &#123; return 'foo';&#125;; 局部作用域 用 let 代替 var 12345678910'use strict';function foo() &#123; var sum = 0; for (let i=0; i&lt;100; i++) &#123; 这时候 'i'是局部变量 sum += i; &#125; // SyntaxError: 报语法错误 i += 1;&#125; 常量 const juyou 具有块级作用域 解构赋值 1234567891011121314151617181920212223//情况一var [x, y, z] = ['hello', 'JavaScript', 'ES6'];//情况二let [x, [y, z]] = ['hello', ['JavaScript', 'ES6']];x; // 'hello'y; // 'JavaScript'z; // 'ES6'//情况三let [, , z] = ['hello', 'JavaScript', 'ES6']; // 忽略前两个元素，只对z赋值第三个元素z; // 'ES6'//对象属性结构赋值var person = &#123; name: '小明', age: 20, gender: 'male', passport: 'G-12345678', school: 'No.4 middle school'&#125;;var &#123;name, age, passport&#125; = person; 使用解构赋值对对象属性进行赋值时，如果对应的属性不存在，变量将被赋值为undefined，这和引用一个不存在的属性获得undefined是一致的。如果要使用的变量名和属性名不一致，可以用下面的语法获取： 1234567891011121314var person = &#123; name: '小明', age: 20, gender: 'male', passport: 'G-12345678', school: 'No.4 middle school'&#125;;// 把passport属性赋值给变量id:let &#123;name, passport:id&#125; = person;name; // '小明'id; // 'G-12345678'// 注意: passport不是变量，而是为了让变量id获得passport属性:passport; // Uncaught ReferenceError: passport is not defined …其他情况见 [廖雪峰网站]][^1] 使用场景 12345678var x=1, y=2;[x, y] = [y, x]//快速获取当前页面的域名和路径：var &#123;hostname:domain, pathname:path&#125; = location;// 创建Datafunction buildDate(&#123;year, month, day, hour=0, minute=0, second=0&#125;) &#123; return new Date(year + '-' + month + '-' + day + ' ' + hour + ':' + minute + ':' + second);&#125; 方法 在一个对象中绑定方法，成为这个对象的方法。 比如创建age()的方法 1234567891011var xiaoming = &#123; name: '小明', birth: 1990, age: function () &#123; var y = new Date().getFullYear(); return y - this.birth; &#125;&#125;;xiaoming.age; // function xiaoming.age()xiaoming.age(); // 今年调用是25,明年调用就变成26了 this.","tags":[],"categories":[]},{"title":"Mechine_learning","date":"2018-11-21T08:44:03.000Z","path":"2018/11/21/Mechine-learning/","text":"Mechine_learning 1.1: Introduction to Session 1 - Intelligence and Learning Graph System 图论？ weighted graph System Dijksta’s Alg 再有权重的图像里搜索 Search Algorithme 二叉树:js程序实现 youtube_Video:https://www.youtube.com/watch?v=Vc5fIuYk3Bw&amp;list=PLRqwX-V7Uu6bePNiZLnglXUp2LXIjlCdb&amp;pbjreload=10","tags":[{"name":"技术","slug":"技术","permalink":"http://liudixian.github.io/tags/技术/"}],"categories":[]},{"title":"地磁","date":"2018-11-21T05:43:13.000Z","path":"2018/11/21/地磁/","text":"构建一个普顿精度磁力计 你好， 我正在用WordPress重建我的旧网站，当我分析404错误时，我看到有数百人想看一个名为«构建质子进动磁力计»的前一页。 主要推荐人是： https://www.1010.co.uk/org/geophysics.html 所以，我再次复制前一篇文章，因为我没有在网上找到它，除了这里： https://vdocuments.site/build-a-proton-precession-magnetometer.html 和这儿： https://fr.scribd.com/doc/148525063/Build-a-Proton-Precession-Magnetometer 文章中的“我”不是“我”。 所以，请不要联系我获取有关此项目的信息。 上面的文章是aol.com上发现的1999年原创文章的副本（http://members.aol.com/_ht_a/alka1/ProMag.html） 构建一个普顿精度磁力计 一个教育性的“后院”项目，使用易于获得的电子零件构建。 频率计数器用于测量后极化脉冲质子进动频率。 测量的频率通过物理常数与局部地磁场的大小相关。 背景： 有关质子磁力计的一些背景信息和实际应用的描述，请参阅1968年2月出版的“科学美国人”杂志上的“业余科学家”一栏。描述了双线圈磁力计的构造。该条中的信息构成了此处所示细节的基础。 几年前我建造了磁通门磁力计。它基于理查德·诺布尔在1991年9月的“电子世界+无线世界”杂志上发表的文章。使用图表记录仪，可以看到地球磁场的东西向分量的日变化，在消除了压倒性的总和南北分量之后。 在找到1968年2月的“科学美国人”文章之后，我认为尝试在质子磁力计上添加一个频率计数器将是一个有趣的项目。这将是一个有趣的“后院科学”项目，用它来提供地球总量的测量磁场。增加数模转换器可以提供适合图表记录器的输出。 然而，郊区的后院环境相当嘈杂。电源线频率的谐波一直延伸到音频范围。这些与衰退的进动频率音调竞争。采用差动串联方式连接传感器线圈，传感器的定位和音频信号的瞬时采样有助于对抗噪声。 物理学中有一个量叫做“拉莫尔频率”，它定义了在磁场存在下进行进动的质子的角动量。 目前有一些量子力学的观点可以解释粒子岁差，但是经典的解释似乎更容易理解。一个质子，一个带电粒子，可以被认为是具有围绕一个轴的确定的“自旋”，它起着一个小磁铁的作用。外加磁场不会改变自旋速率，但会使粒子以较慢的速率绕进动轴摆动。这个轴倾向于与外部磁场对齐。然而在弱磁场中，由于热效应和其他分子相互作用，任何排列都趋向于随机性。 质子对外界施加的磁力的扰动作用作出反应，其进动速率与称为旋磁比的精确常数一致。对于质子，这个量大约等于267.53 x 1E6弧度/秒/特斯拉，或42.58 mHz/特斯拉。 在美国北纬地区，总磁场强度约为5万到5.5万纳特斯拉，而且各地磁场强度不同。由磁暴引起的短周期变化可能达到几百纳特斯拉。由太阳诱导的电离层电流引起的日变化约为几十纳特斯拉。目前，整个磁场的长期趋势是每年负90纳米特斯拉(逐渐减少)。 合适的传感器在地球地磁场中检测到的质子进动频率将在音频范围内: Example: 42.58 mHz / Tesla x 52500 x 1E-9 Tesla= 2235 Hz 在我东北的位置，频率读数平均约2275赫兹，相当于大约53,400纳米特斯拉的总磁场。这似乎与已发表的模型有关。这个数字也与使用亥姆霍兹线圈校准的磁通门磁强计得到的值一致。磁通门传感器从水平位置向上倾斜到接近垂直位置，以获得地球磁场的最大读数。 我注意到在过去的几个月里，传感器安装在后院的频率读数下降了一到两赫兹。这似乎也与预测的长期变化幅度一致。 这是«只听»版本的框图。频率计数电路没有使用。仅包括传感器线圈、音频放大器和直流电源。定时器IC用于向继电器提供开关控制，继电器交替连接极化电流源和音频放大器输入之间的感应线圈。(单击figure查看更大的图)。 这是一个磁强计设计的框图，增加了测量电压频率的能力，在传感器线圈由预处理质子诱导后极化电流持续几秒钟的时间。一个40年的BCD计数器dis-播放频率可选择的分辨率为1或0.1赫兹。一种频率倍增器方法使用锁相环提供这些分辨率，使用的是远小于一秒的计数门间隔。 传感器结构 我发现当地的超市可以找到很好的线圈来源，在上面缠绕磁强计线圈和包含质子介质。检查香料摆放的地方。特别要找商店品牌的香料。我发现它们使用的是薄壁塑料容器，在底部和盖子下方有环绕的脊。这样就形成了一种多层线圈易于缠绕的形式。 上面引用的页面显示了所使用的特定大小。有许多尺寸可供选择。还发现了一些更高的线圈，可以提供大约3.75英寸的线圈长度。稍微大一点的容器可以方便地使用更大的电线。它的优点是:线圈电阻低，线圈Q值高，极化电流也可能大(如果电源能提供的话)。极化电流越高，衰减信号的初始振幅越大。 线圈Q越高，衰减信号引起的振铃效应持续时间越长。注意，线圈电感随匝数的平方而增加，而线圈电阻随匝数的线性函数而增加。这表明，在实际应用中，使用最大匝数和最大线径可以获得最佳结果(高Q和调谐电路选择性)。此外，也许最重要的是，线圈将通过增加并联电容来进行调谐——这可能是最重要的元件。 线圈电感应足够高，以允许使用一个合理的价值非极化电容器。更高的Q值也有助于提供更窄的调谐电路带宽，这对于提高信噪比和减少高阶电力线谐波的拾取非常重要。 音频放大器 音频放大器采用四个双极晶体管和一个双运放集成电路。左边的框图显示了级增益分布。运算放大器提供以质子进动的期望频率为中心的两级有源带通滤波器。最大可用增益超过130分贝。理论增益与频率的关系如图所示。有了这样的高增益，需要谨慎的结构来防止振荡。 上图简要概述了物理细节。放大器采用双面镀铜PCB材料制作。组件被焊接到隔离端子上。采用推入式尼龙或聚四氟乙烯端子。矢量板很难用于完全由分立元件组成的电路。电路板封装在Radio Shack模制的项目案例中。箱内内衬有带胶背的铝带。 音频放大器 输入级使用一个100欧姆的未旁路发射极电阻将输入阻抗提高到大约12千欧姆，以减少调谐传感器线圈上的负载。由线圈和谐振电容器组成的调谐电路具有大约3000欧姆的并联阻抗。为了找到一种具有最佳信噪比的设备，在输入阶段随机选择若干不同的设备进行试验。可以检测到跨输入端焊接的560欧姆电阻的噪声贡献。然而，来自传感器线圈和外部拾音器的噪声超过了固有放大器的噪声贡献。 下一页连结到测量进动频率的计数器实作的示意图。它的目的是作为一个教育项目，试图提供一个测量当地地磁场的大小。本网站仅供参考之用。其他人可能会对它感兴趣，也可能会将它用于特定的实际应用。我的目标之一是节约，使用现成的或容易得到的标准部件。对于来自电池电源的操作，较低的功耗等效CMOS逻辑元件可以替代所示的TTL元件。 计数器电路描述 所示电路除其他分立元件外，还需要12个集成电路。集成电路的选择是基于经济性的——也就是说，使用现有的部件。有许多可替代的集成电路可以代替与非门、计数器和多谐振荡器。在任何情况下，4060计数器/振荡器和4046锁相环集成电路可能是很好的选择，但也有其他可能性。如果电能来自电池，用等效CMOS逻辑电路代替TTL类型将减少直流电流的要求。 (在一个单独的部分中显示了另一个电路，它是一个更简单的只听版本。它消除了频率计数器，并使用计时器循环极化电流到传感器线圈的开关。 偏振传感器的时间和测量频率是由一块手表晶体推导出来的。这些是在一些数字腕表中发现的微小圆柱形部件。它们在Active Electronics的售价约为2美元，在Radio Shack的售价为1美元。 振子电路基本符合CD4060/MC14060的应用说明。振荡器部分产生32.768 kHz的输出频率，该输出频率应用于14级计数器。最后一个阶段的最终输出是2hz或0.5秒的脉冲重复率。这驱动一个4级二进制计数器，其最后一级提供4秒高/ 4秒低逻辑电平。为了简单起见，使用了4级二进制计数器的全计数周期。如果目的是在便携式搜索模式中使用磁强计，那么将4秒(听)非极化间隔缩短到半秒可能是有用的。这将需要添加至少一个4输入NAND门来解码计数器状态(10计数)并重置计数器。 为了使进动信号的振幅达到最大，应将极化电流施加到感应线圈上几秒钟。三秒钟似乎足够了。除去极化电流后，继电器将线圈连接到音频放大器的输入端。音频放大器的输出是一个进动频率的振铃音，其振幅迅速减小到背景噪声级。为了获得准确的频率测量，计数器应在偏光电流消除后立即开始采样。此外，只有当信号振幅远高于噪声水平时才应进行计数。 直接测量音频放大器的输出需要1秒的计数间隔，以便在期望的松弛频率下解析到1hz，并需要10秒来解析到0.1 Hz。当然，在最后一种情况下，信号会在放大器噪声或本地电源线谐波的作用下长期衰减。在后院环境中，一秒钟后，信号就会与交流电源线谐波相竞争。 锁相环是用来允许测量进动频率到1的0.1赫兹分辨率使用计数间隔远远小于一秒。相位检测器的一个输入是音频放大器的输出。相位检测器的另一个输入来自压控振荡器(VCO)，其频率由两个插入的数字分压器划分;a除以10，再除以8。锁定时，VCO频率等于音频放大器输出频率乘以一个因子等于总除法(8×10 =80)。测量VCO输出频率在输出除以10计数器使用计数间隔八分之一秒允许分辨率为1赫兹。直接测量VCO频率(在除以10个计数器之前)可以使分辨率达到0.1 Hz。在这种情况下，最有效数字(千)溢出计数器的第四阶，留下百位、十位、个位和十分之一赫兹的显示。 为了简单和经济，单个发光二极管用于显示十进制计数器的状态。该示意图显示最有效位有四个led，两个或三个应该足够了，因为这个阶段通常总是读取BCD等效于2(根据选择的分辨率选择2000或200)。在稳定条件下，当使用1赫兹分辨率时，只有最小有效位的变化，当使用1 / 10赫兹分辨率时，只有最后两个有效位的变化。如果打算用于便携式搜索，我想最好使用十进制显示，以便可以容易地看到读数的变化。(尽管只听音频输出可能足以检测磁性异常)。有许多选择来实现这种复合液晶显示器，七段液晶显示器等，这些将需要添加适当的BCD段解码器/驱动器或使用昂贵的集成计数器/显示集成电路。 为了经济，尽量减少互连接线和元件计数，单稳态多谐振荡器(一次)用于设置十频计数器门控和定时间隔。这可能比解码来自32.768晶体的CD4060和74197计数器(U1和U2)的状态更容易。直译码需要多个输入NAND门以及逆变器(因为计数器不提供互补的逻辑输出——Q和倒Q)。 多谐振荡器的周期必须有一定的精度，因为对定时元件标称值的公差不足以保证正确的时延。利用现有的精确时基波形和十进制计数器对时延进行精确设置。定时电阻器的值R3和R4可以根据需要进行更改，以提供正确的时间延迟。 时间延迟调整 CD4060振荡器/计数器输出(Q4)的第四个二进制级在引脚7处可用。振荡器的频率在这一点上被除以16，得到频率为2048 Hz。 U3A延迟 进行以下临时连接: 点A1和点A2之间的连接打开。将A2连接到U1引脚7处的2048测试信号。 打开点TC1和点TC2之间的连接。这为十进计数器输入门提供了一个激活信号，该信号等于多谐振荡器U3A的时延。 将U10引脚11处的R12值调整到8000欧姆左右。这应该调整CD4046 VCO的自由运行频率，使其达到允许对测试信号进行锁相的值。锁相时VCO频率为测试信号的80倍或163840hz。将分辨率开关(S1)设置为1hz。它将16384的除以(10)VCO频率与十进制计数器输入门连接起来。 使用标称值56 kohms或62 kohms作为R3的定时电阻器。 计数器显示应该每8秒产生一个新的读数。所需的计数器显示应该等效于0.2秒，0.2 X 16384或3277将被显示。选择电阻器的值，使时延在190到210毫秒之间，或者选择计数器读数在3112到3440之间。 U3B延迟: 保持以前的测试连接不变。进行以下临时测试连接: 点D1和点D2之间的连接打开。 点B1和点B2之间的连接打开。将一根短绝缘电线连接到B1上，这样您就可以手动将其触地以重置十进制计数器零。 从点E1到D1的临时连接。 手动接地B1，手动复位计数器。像以前一样观察计数器读数，并根据需要手动重置计数器。R4的初始值为27 kohms。 调整R4的值以提供90到100毫秒之间的延迟时间，相当于1475到1638之间的计数器读数。 恢复所有连接到正常的每个示意图。 VCO频率: 暂时连接A1/A2点至地面。调整R12的值以产生2230到2250的计数器读数。删除临时地面。 Martin Hawse：http://www.1010.co.uk/org/geophysics.html 参考：http://ilotresor.com/build-a-proton-precession-magnetometer/ 详细教程：http://www.exstrom.com/magnum/master-Z-H-4.html 从地磁探测中制造声音的参考：http://marineemlab.ucsd.edu/~steve/bio/SoundMantle.pdf 来自亚原子世界的信号-Signals From subatomic world 第一章 1.3 概览 首先是如何操作Magnum的一般描述。 首先选择一些富含氢的物质，如水，酒精或石蜡，我们将从这里作为样品参考。 将约2盎司（59毫升）的样品放入圆柱形塑料瓶中。 将瓶子放在样品线圈内，然后将样品线圈放入偏振线圈内。 样品被极化线圈产生的场偏振一段时间。 当偏振线圈关闭时，由样本中的进动质子产生的信号由数据采集系统记录。 然后使用软件处理数字化信号以产生提供质子的进动频率的光谱。 现在我们描述仪器的整体设计。 一般系统图如图1.3所示。 Magnum可以大致分为三个部分： 极化系统，传感器系统，以及控制和数据采集系统。 我们从极化系统开始。 极化系统 的目的是产生一个垂直于地球的大磁场(相对于地球)。极化场是由安装在倾斜平台上的大线圈产生的。要求可倾斜的平台使偏振场与地面场垂直。极化场必须能够在规定的时间内打开，然后迅速关闭。极化脉冲控制器就是为此而设计的。控制器可以由操作员通过串行链路编程到PC机上。一旦编程，控制器等待来自PC的信号开始极化过程。这个过程包括在规定的时间内接通极化线圈的电流，迅速关闭电流，然后发送信号通知数据采集系统开始采集数据。极化线圈、可倾平台和脉冲控制器将在后续章节中详细介绍。 传感器系统 由两部分组成，即采样线圈和放大器。样品盘管容纳含有样品的瓶子。它的目的是诱导拾取由极化质子产生的非常小的振荡磁场，该磁场在地球的磁场上前进。样品线圈实际上由两个并排放置的相同线圈组成。一个线圈用于容纳样品，另一个用于抵消环境磁场。可以使用其中一个线圈来容纳样品，但是由于两个信号会抵消，所以不能将样品放在两个线圈中。由进动质子产生的信号非常弱。为了增强信号，必须使用电容器调谐采样线圈，以便在质子进动频率下形成谐振电路。放大器有一组电容器，可用于调谐采样线圈。放大器还将放大来自调谐样本线圈的信号约380万倍。具有如此高增益的放大器是一种非常灵敏的器件，必须非常小心地构造以防止它变成振荡器。放大器和样品线圈的结构细节可以在以下章节中找到。 数据采集​​和控制系统 由带有pci数据采集卡的个人计算机和一些软件组成。该软件允许操作员对脉冲控制器进行编程，然后启动极化和数据采集过程。软件可以控制多个极化和数据采集周期。将每个周期的数据平均在一起以获得更高的信噪比。该软件可以对脉冲控制器进行编程，以将极化场打开，从几分之一秒到几秒钟。在它向脉冲控制器发送信号以启动极化之后，它初始化数据采集系统以等待来自控制器的信号，指示极化已经完成并且数据采集可以开始。数据采集​​系统的通道选择，设置和采样率也由软件控制。在收集了所有数据之后，使用附加软件来过滤数据并计算信号的频谱。然后光谱给出质子进动频率，从中可以计算出磁性。所有这些将在以下章节中更详细地描述。 第六章 Chapter 6 数据采集与PC控制- Data Acquisition and PC control 6.1 如何使用抽样-What sampling rate to Use 有关数据采集的最重要问题是如何采样。可用于采集任何信号的频率是最高频率的两倍信号中存在的分量。 例如，如果信号的频率不高于1000 Hz（1 kHz），则最小采样率为每秒2000个样本（2 ksps）。 如果以小于2 ksps的速度采样1 kHz正弦波，那么它将与较低频率的正弦波无法区分。 这种现象称为混叠，如果不进行预防，可能会导致虚假结果。 为了防止数据中的混叠问题，首先选择一个频率fmax，它大约是您可以观察到的最大进动频率的两倍。 然后确保数据采集系统的输入信号没有大于fmax的显着频率分量，并将采样频率设置为fmax的至少两倍。 这将确保进动信号的采样速率超过最小速率的两倍，并且可以防止任何混叠。 例如，在地球的磁场中，您不应该遇到1.5 - 2.4 kHz范围之外的任何进动频率。 因此，您可以使用5 kHz的fmax和10 ksps的最小采样率。 使用Magnum放大器，您还可以确保没有频率大于5 kHz的重要信号将进入数据采集系统。 6.2 What solution to use 接下来要考虑的是使用什么分辨率。 分辨率是指数据采集系统识别出多少个独特的电压电平，这取决于用于表示每个采样的位数。 所发生的是系统将连续电压信号转换为固定长度的二进制数，该二进制数只能代表一定数量的独特电压。 例如，假设数据采集系统使用8位来表示每个样本。 然后它将能够区分28 = 256个唯一级别。 这意味着如果输入电压范围为-10到+10伏，则只能区分超过20/256 = 0.078伏的电压。 数据采集系统不能精确地表示输入信号样本称为量化误差。 这错误地将噪声有效地引入数据中，这可能降低整体信噪比。 因此，所需的分辨率或位数取决于信号的特征以及您尝试从中提取的信息类型。 对于Magnum，12位的分辨率足以允许进动信号的峰值以高精度定位。 如果您只使用Magnum作为磁力计，那么这就是您需要的所有信息。 如果您计划使用Magnum进行更一般的NMR类型实验，我们将不需要讨论，您只需要更高的分辨率。 6.3 获取数据的时间 How long to take Data 获取数据的时间长度决定了可以解决不同频率的程度。 您有多少数据或样本有效地设置频率分辨率。 样本越多，频率分辨率越高。 对于Magnum，您应该获取至少半秒的数据。 如果你明显少于此，则进动信号频谱将开始变宽，并且可能变得更难以精确定位峰值。 可用的进动信号将持续不超过2到3秒，因此不需要比这更长时间地获取数据。 对于大多数目的而言，从0.5到3.0秒的任何地方获取数据应该是足够的。 6.4 用Magnum制作的模数转换器 The ADC board used in the Magnum Magnum中使用的ADC板是IOtech（http://www.iotech.com/)的ADAC / 5501MF（ftp://ftp.iotech.com/ADAC.5500.20Series.20Users.20Manual.pdf）。 它是一个12位ADC，具有8个不对称（或16个单端）模拟输入，最大采样率为100 kHz。 需要从IOtech获取的部件： 123\u000f - Data acquisition board: ADAC/5501MF $384\u000f - Terminal board: ADAC-TB-16 $139\u000f - Cable: CA-G55-ADAC $69 没有必要使用这个特定的数据采集板，但本书附带的软件（用于与电路板通信并获取数据）是为该电路板编写的。如果您更喜欢使用不同的数据采集板， 所需的基本功能是： 不同的输入口 用于触发数据采集的外部引脚。 最低采样率为每秒10千样本。 每个样本12bit或更多。 6.5 脉冲控制器和数据采集软件 Pulse controller and data acquisition software Magnum的整体控制和操作由PC上运行的名为ADL（名称没有重要性）的程序处理。该程序读取一个参数文件，该文件指定如何运行Magnum。参数文件是纯文本文件，可以使用任何文本编辑器创建。 ADL将参数文件中的一些信息转换为脉冲切换器中微控制器的指令。然后，它通过串行RS232连接将这些指令发送到切换台。指令告诉切换器打开偏振线圈中的电流多长时间以及关闭电流和触发数据采集之间等待的时间。 设置切换台后，ADL使用参数文件中的附加信息来设置数据采集系统。重要的数据采集参数是增益，采样率和要采样的样本数。这些将在下面进一步描述。 要启动脉冲，ADL将运行程序命令发送到脉冲切换器。然后脉冲切换器将偏振线圈中的电流接通指定的时间。关闭电流后，切换器会在触发数据采集系统（DAQ）开始采集数据之前等待很短的时间。 数据采集完成后，ADL将对数据进行缩放，以使值反映真实的电压电平。 如果指定了多个脉冲，则将另一个运行程序命令发送到脉冲切换器，并重复上述过程。 程序平均来自所有脉冲的数据并将结果存储在数据文件中。 如上所述，ADL执行系统设置和运行所需的参数包含在运行程序时在命令行上指定的参数文件中。 示例参数文件如下所示。 123456789101112ADAC5501 // Device name (32 char max)D // Input type [D]ifferential or [S]ingle ended0 // Channel number [0-7] (Diff) or [0-15] (SE)B // Polarity [U]nipolar or [B]ipolar1 // Gain [1,2,4,8,16,32,64]16384 // Samples per second65536 // Number of samples6.0 // Pulse length in seconds [0-13]0.1 // Daq trigger delay in seconds4 // Number of pulses10.0 // Pulse delay in secondsmagnum1.dat // Output file name 所有这些参数必须出现在每个参数文件中，并且必须按所示顺序显示。 每行的第一项是参数的值，双斜杠标记后面的所有内容都是注释。 注释描述了参数是什么以及它可以采用的可能值。 前七个参数用于初始化数据采集系统。接下来的四个用于初始化脉冲编程器和运行脉冲序列。最后一个参数给出了程序运行时创建的数据文件的名称。我们现在将描述每个参数的含义。 如果系统使用多个数据采集卡，则设备名称参数仅具有意义。该参数实际上并未由ADL使用，但它包含在内，因此可以轻松修改程序以使用多个数据采集卡。但它必须保留为参数文件中的第一项。 输入类型参数有两个可能的值：D表示不同的值，S表示单端的值。该参数指的是数据采集系统处理其输入通道上存在的信号的方式。单端输入电压16个输入通道相对于地被数字化。对于差分输入，数字化的是相邻奇数和偶数通道之间的电压差。差分输入比单端输入提供更高程度的抗噪声投入。因此，建议将差值输入始终与Magnum一起使用。 第七章 数据处理与分析-Chapter 7 Data Processing and Analysis 7.1 信号平均 7.11\b 为什么它会提高信噪比 信号平均是将在相同条件下采集的数据集合在一起的做法。 期望的效果是降低噪声并增强信号。 信号平均的工作原理是噪声是随机的，而信号则嵌入其中噪音不是。 因此，将多个数据集合在一起往往会在加强信号的同时消除噪声。 7.12 由于MOSFET的减速导致的限制-Limits due to MOSFET slow down Magnum的脉冲控制器使用MOSFET[1]来关闭极化线圈中的电流。 每次关闭电流时，执行此操作所需的能量在MOSFET中耗散，导致它们升温。 随着电流开启和关闭，MOSFET继续变暖。 MOSFET的关断时间随着温度的升高而增加。 结果是，利用脉冲控制器获得的每个连续数据集具有稍微减小的信号并且稍后稍微移位。 因此，每个数据集中的信号不相同，并且在这种情况下的信号平均不如理论上有效。 请注意，保持MOSFET热连接在一起并与良好的散热器接触，如脉冲控制器中所做的那样，可以最大限度地减少MOSFET的这种限制。 7.2 过滤数据 原始数据通常包含很多噪音。 图7.1显示了原始数据的前4秒图，DAQ触发延迟为0.1秒（采样率：16384，样本：蒸馏水，地点：Longmont，Colorado，时间：2007年2月8日，17：34 MST）。 图7.1：原始数据：第1个4秒，触发延迟0.1秒，蒸馏水样品。 首先要注意的是，在左侧，我们会看到由于当前切换引起的瞬态。 此外，它非常嘈杂，无法看到信号。 让我们删除第一个2000个数据点以消除瞬态，然后保持第一个2秒（32768点）。 图7.2显示了结果。 图7.2：原始数据：去除瞬变后的第2秒。 注意：下面提到的所有软件都可以在我们的数字信号处理页面（http://www.exstrom.com/journal/sigproc/)上找到。 现在让我们通过对这些数据应用6阶Butter-worth带通滤波器来消除一些噪声。 根据我们对第5章所述的地球磁场强度的估计，我们在科罗拉多州朗蒙特的质子进动频率应该是大约2250赫兹。 所以我们将截止频率设为2100和2400 Hz。 我们为我们的6阶Butterworth带通滤波器创建系数文件，如下所示： bwbp 6 0.25620000 0.29280000 1 bpfmagnum.cof 其中浮点数是无量纲截止频率，使用我们的数字信号处理页面上的计算器从实际频率转换而来。 请注意，要进行此转换，您必须知道用于获取数据的采样率。 如果使用本书附带的软件，则它位于数据文件的标题中。 在这种情况下，它是16393.4426 sps。 现在我们得到了带通滤波器的频率响应 rffr bpfmagnum.cof 32768 bpfmagnum.fft 提取幅度，这是该文件的第一列（第二列是阶段）： extract r bpfmagnum.fft 32768 bpfmagnum。 现在我们可以在图7.3中看到滤波器的频率响应是什么。 图7.3：Butterworth带通滤波器频率响应，6阶，fc = 2100,2400 Hz。 我们现在可以删除我们的Magnum数据文件： 1rdf bpfmagnum.cof elpaso1.dat 2000 32768 elpaso1bpf.dat 结果如图7.3所示。 图7.4：使用Butterworth BPF输入的数据，6阶。 现在我们可以在两个2秒的数据中看到我们的自由感应衰减。 7.3 利用FFT进行光谱分析 让我们对原始数据和过滤数据进行FFT（记住过滤后的数据已经删除了前2000个点） fft 2000 32768 elpaso1.dat elpaso1.fft fft 0 32768 elpaso1bpf.dat elpaso1bpf.fft 考虑我们的FFT的幅度： 提取m elpaso1.fft 32768 elpaso1.mag 提取m elpaso1bpf.fft 32768 elpaso1bpf.mag 现在我们可以绘制和比较FFT，如图7.5和7.6所示 您可以看到我们的带通滤波器有多好用。 图7.7显示了峰区的特写视图。 您可能想知道，在原始数据的FFT中有如此多的噪声，您如何知道哪个峰值是质子进动频率？ 很简单，只需取下样品瓶，再取一组数据，然后你所追求的峰值就会消失。 当然 图7.5：原始数据的FFT，32768点。 图7.6：过滤数据的FFT，32768点。 图7.7：图7.7的特写视图。 \b7.4 将bin编号转化为实际的频率-Convert bin number to actual frequency 一旦你在FFT图中识别出质子进动峰值，就可以读出峰值的二进制数。 该图表告诉您bin编号的活动域，但您实际上可以查看FFT幅度数据文件以获得精确的bin编号。 在上面的FFT中，峰值位于数据点4492处。要获得频率，我们必须计算Hz / bin。 从原始数据文件中，采样率为16393.4426 sps。 我们的FFT使用了32768个数据点。 因此，我们有16393.4426 / 32768 = 0.500288 Hz / bin。 所以我们在峰值的频率是（44921）* 0.500288 = 2246.7934赫兹。 了解峰值的频率，您现在可以在本书的网页（http://www.exstrom.com/magnum.html)上使用频率到磁场转换器来获得磁场。 当然，你应该知道你对当地地球场估计的高峰位置。 如果使用去离子水代替蒸馏水，峰值应显着增大。 7.5 峰值位置的高分辨率光谱 数据采集指南：http://www.ni.com/white-paper/11055/zhs/ 名称\\参数 图片 \b系统支持 价格 山青水青电子测量技术 xp,win7,win10 585 智能数采 win, linux 999 迷你USB数据采集卡 win,linux 119 高性价比USB多功能数据采集-100K单端 windows,linux,树莓派 350 Mosfet:金属氧化物场效应管 ↩︎","tags":[],"categories":[]},{"title":"Vehicles-Vatentino","date":"2018-11-19T17:41:06.000Z","path":"2018/11/20/Vehicles-Vatentino/","text":"Vehicles —Valentino Braitenburg Introduction Let the Problem of the Mind Dissolve in your mind 让心灵问题溶解在你的脑海里 This is an exercise in fictional science, or science fiction, if you like that better. Not for amusement: science fiction in the service of science. Or just science, if you agree the fiction is part of it, always was, and always will be as long as our brains are only minuscule fragments of the univers, much too small to hold all the facts of the world but not too idle to speculate about them. 这是一个关于虚构的科学或者是科学的虚构，如果你更喜欢其中一种叫法。但它不是为了娱乐：这是服务于科学的科学虚构。或者说科学，如果你同意科学也有虚构的成分—，并且只要我们的大脑还只是宇宙的微小的碎片，\b曾今，并在将来就一直太过狭窄，以至于不能掌握全部的事实，不过它也不至于\b虚度到不能去猜测他们。\b I have been dealing for many years with certain structures within animal brains the seemed to be interpretable as pices of computing machinery because of their simplicity and/or regularity. Much of this work is only interesting if you are yourself involved in it. At times, though, in the back of my mind, which I was counting fibers in the visual ganglia of the fly or synapses in the cerebral cortex of the mouse, I felt knots unite,distinctions dissolve, difficulties dispear, difficulties I had experienced much earlier when I still held my first navie philosophical approach to the problem of the mind. This process of purifiction has been, over the years, a delightful experience. The text I want you to read is designed to convey some of this to you, if you are prepared to follow me not through a world of real brains but throgh a toy world that we will create together. We will talk only about machines with very simple internal structures, too simple in fact to be interesting from the point of view of machanical or electrical engineering. Interest arises, rather, when we look at these machines or vehicles as if they were animals in a natural enviroment. We will be tempted, then, to use psychological language in describing their behavior. And yet we know very well taht there is nothing in these vehicles taht we have not put in ourselves. This will be an interesting educatinal game. Our vehicles may move in water by jet propulusion. Or you may prefer to imagine them moving somewhere between galaxies, with negligible gravitational pull. Remember, however, taht their jets must expel matter in order to function at all, and this implies replenishment of the food stores within the vehicle, which maybe the problem between galaxies. This suggests vehicles moving on the surface of the earth through an agriculture landscape where they have good suport and can easily find the food or fuel they need. (Indeed the first few chapters here conjure up images of vehicles swimming around in the water, while later what comes to mind are little carts moving on hard surfaces. \bThis is no accident, if the evolution of vehivles I to I4 in any way reflects the evolution of animal species.) 我们的车辆可能会通过喷射推进器在水中移动。 或者你可能更愿意想象它们在星系之间的某个地方移动，引力可以忽略不计。 然而，要记住，他们的喷射物必须排除物质才能发挥作用，这就意味着飞船内食物储备的补充，这可能就是星系之间的问题。这表明车辆在地球表面通过农业景观移动，在那里他们有良好的支持，可以很容易地找到他们需要的食物或燃料。（实际上，在本书的前几章中，我脑海中浮现的是汽车在水中游动的画面，而后来我脑海中浮现的却是在坚硬表面上行驶的小车。这不是偶然的，如果vehivles I到I4的进化以任何方式反映了动物物种的进化。） It dose not matter. Get used to a way of thinking in which the hardware of the realization of an idea is much less important than the idea itself. Norbert Winer was emphatic about this when he formulated the title of his famouse book: Cybernetics, or Control and Communication in Animal and Machines. 这无关紧要。习惯一种思维方式，在这种方式中，实现一个想法的硬件远不如想法本身重要。诺伯特•温纳(Norbert Winer)在阐述他那本著名著作的书名时强调了这一点:控制论(Cybernetics)，动物和机器中的控制与沟通。 Getting Around Vehicle 1 daixu","tags":[],"categories":[]},{"title":"打开黑匣子","date":"2018-11-19T08:56:28.000Z","path":"2018/11/19/打开黑匣子/","text":"入门工作坊 音画互动程序-processing- 网页互动-p5 硬件交互- arduino- 互动小车？ 声音合成与互动- live+max/msp 更多的接口，更多的传感器 打开技术的黑匣子 问题： 什么是编程语言？ processing/java、arduino/c、max/msp vs 流程图？ 任意一种编程语言，如c,c++,java,python等等，不论高级与低级，都是人和机器进行沟通的媒介；人将自己的思想逻辑通过\b某种规则告诉机器，并储存在电路当中，转化为\b一种物理的过程\b\u001c，并让机器去不断重复的去执行。 编程语言的类型 \b底层：机器语言 机器语言 机器语言-图 汇编语言 汇编语言-图 高级语言： 编译型：C, C++ 解释型：JAVA，python，javascript 编程语言影响力网络[1] 编程语言继承关系图[2] 编程语言类型图[3] Processing？ Java / Processing 1. JAVA是材料 – Processing是“画室” library（预建立好了各种工具） &#123;.line-numbers&#125;1234567#javapublic class HelloWorld &#123; public static void main(String[] args) &#123; System.out.println(\"Hello World\"); &#125;&#125; &#123;.line-numbers&#125;12# processing print(\"Hello World\"); processing简述 画图/计算机图形学 像素，在坐标系里画图 通讯 udp tcp/ip serial \b基本语法 结构化编程 函数 面向对象 library 算法 软件-硬件的关系 硬件+软件 科技艺术需要懂那些技术？ 如何学习？ 学到什么程度？ 互动编程基础课程 processing/java 入门与max/msp ableton live max for live 初认识 10个课时 互动艺术创作高阶 创建项目 建立自己的网站档案 流程图在线编辑器 https://live.yworks.com/demos/index.html reveal 教程 https://vxhly.github.io/2016/09/reveal-js-cn-document/ books:https://www.amazon.com/shop/thecodingtrain?listId=1YF77ROKCEOO2 https://exploring-data.com/vis/programming-languages-influence-network/#Processing ↩︎ http://www.digibarn.com/collections/posters/tongues/ComputerLanguagesChart.png ↩︎ https://3.bp.blogspot.com/-ZO6GWAH1X5M/WboFm3I43sI/AAAAAAAADME/9wFX09iodqcldya0A3L-pVbfJTUSz7kmwCLcBGAs/s1600/language.jpg ↩︎","tags":[{"name":"workshop","slug":"workshop","permalink":"http://liudixian.github.io/tags/workshop/"}],"categories":[]},{"title":"East2018","date":"2018-11-17T02:21:49.000Z","path":"2018/11/17/East2018/","text":"\bEast 科技艺术季教育大会 2018 Rcl Simon Mahony 伦敦\b城市大学 数字人文中心 Marc Wieser - 界面的消失-无处不在的计算 Yamaguchi Center for Arts and Media（YCAM）, Japan YCAM https://www.ycam.jp/cn/projects/guest-research-project-vol2/ 上海科技大学 创意与艺术\b学院 http://sca.shanghaitech.edu.cn 日本NTT 互动艺术中心（ICC） 畠中實 Minoru Hatanaka, NTT_ICC, Japan http://www.ntticc.or.jp/en/ A&amp;Q: Q:媒体艺术作品的制作、保存与传播 A: 艺术家有妥协，合作：最佳的合作，作品迭代 邵志飞 iCinema Centre UNSW Australia EPICenter at UNSW Autralie eM2+ 文化遗产媒体化 功夫视觉化 功夫档案 https://www.jeffreyshawcompendium.com/portfolio/kung-fu-weapons-archive/ Re-making the Confucian Rites 睦镇耀 Jin-yo Mok http://jonpasang.com/?page_id=183 崔斗银 DooEun Choi http://streamingmuseum.org/doo-eun-choi/ choid@newschoole.edu 帕森斯艺术与技术访问学者 Animal Classifier https://zkm.de/en/animal-classifier Brain Factory——Maurice Benayoun, Tobias Kein, Interactive music: Jean-Baptiste Barriere Flower, 2016__Shinseungback http://ssbkyh.com/works/flower/ Cloud face , 2012 http://ssbkyh.com/works/cloud_face/ learning to see/ Learning ro dream_ Memo Akten Duddle Tunes, 2016 andreas Refsgaard and Gene Korgen 达芬奇制造 - http://ssbkyh.com/works/nonfacial_mirror/ 德里克·德·克霍夫 DERRICK DE KERCKHOVE “aura” 灵光 Memory content Intelligence ‘Alexa’ ‘Replika’ China 微信、支付宝–算法控制生活 1electonica commonism 电子(网络)共产主义-- *liu* Alzado Vectorial Neo-Impressionism archiving the present weople 个人数字模型 “数字双胞胎” https://pollev.com/weiyuanfengg479 should there be an order of ethical priorities in the use of algorithms? 圆桌会议 facebook ai 自我对话 https://www.independent.co.uk/life-style/gadgets-and-tech/news/facebook-artificial-intelligence-ai-chatbot-new-language-research-openai-google-a7869706.html 比诺曹的故事 https://zh.wikipedia.org/wiki/匹诺曹 Q:文化议题与媒体艺术 A: jeffery: 西方的技术进步是痛苦的过程，战争、贫富差距–&gt;反思与担忧 东方近代的技术进步是在一个现代化发展走向富裕的过程中进行的相对更乐观 邱：技术民族主义 德：亚洲人响应速度更快","tags":[{"name":"East","slug":"East","permalink":"http://liudixian.github.io/tags/East/"}],"categories":[]},{"title":"虚构的生态学","date":"2018-11-15T01:10:28.000Z","path":"2018/11/15/虚构的生态学/","text":"虚构的生态学：资源紧缺的自然资源现实 原标题：A Fictive Ecology: Natural resource for reource-heavy realities Eschewing normative definitions pertaining to the bionomics of technology, Ecologies excursion participants select and define key materials with which to construct a new ecology. 避免与技术生物学有关的规范性定义，生态游览 参与者选择和定义构建新生态学的关键材料。 Stone - Jonathan Kemp（移位寄存器小组) 石头不仅记录了地球上的组成部分的相互作用，而且还记录了这个划时代的地球 - 实验室的运作方式。 Stone记录了过去和现在的环境，预测了未来的环境（地球作为媒体），它的aeonic历史通过与人类的相互作用呈指数地变化，它具有长期记忆，具有反映格式化，暴露于地球表面和非线性叠加的应力历史 通过衰变和人类剥削的变化，这种纠缠 - 地质学，地貌学和文明都重叠 - 使石头成为自己的病理记录器，但其中等同性标志着阅读石头书写的困难。 堆肥 - Shu Lea Cheang（菌丝网络协会） 堆肥作为一种行为，一个演员，行动，活跃。 堆肥，如加工，腐烂，成熟。 它工作和重新设计其下面的多个自我，模糊分裂，驯服遗忘。 弄脏你的手，把你的裤子放下来，小便，小便，嗅闻，嗅闻，不要扼杀它。 堆肥作为凌乱的碎片 - 在年底腐烂的沉闷感觉，发酵的神志不清的上升，令人陶醉的添加剂高。 堆肥注释，堆肥复合，堆肥成型。 种子埋在豆芽下，悄悄地冲到现场，令人信服地宣布自己的到来。 由友好的混合，堆肥永远不会死。 锗 - 杰米艾伦（移位寄存器） 地球上丰富的硅是行星凝聚的偶然结果，是宇宙乳液的选择性离心聚结。 早期的电子研究人员首选锗，更难提取和稀缺（即昂贵），因为它允许更快的切换和更低的电压阈值，降低能耗和电路尺寸。 条顿人元素被用于肖克利的第一个半传导演示，并且它已经成为“信息经济”的基础，在锡林浩特和诺桑比亚等地区的高等级矿床将成为靴子。工程师正在重新审视Ge作为粉碎的方式。 硅计算的玻璃天花板，打破了摩尔的劝阻规律。 Stone - Jonathan Kemp(Shift Register) Stone register not only the interplay of earth-on-earth components, but also the workings of this epochal earth-sacle-laboratory. Stone records past and present environments, premediates future ones(earth as media), and its aeonic history exponentially shifts through its interactions whith humans, It has a long memory with stress histories that reflect formatation, exposure on the earth’s surface, and the nonlinear superimposition of change through decay and human exploitation, Such an entanglement-where geology, geomorphology and civilization all overlap-makes stone its own pathological recorder, but one where equifinality marks the diffculty in reading the writing of the stones. Compost - Shu Lea Cheang(Mycelium Network Society) Compost as an act, an actor, action, active. Compost as in processing, decaying,maturing. It works and reworks its multiple selves disposed under, blurs the divides, tames the oblivion. Get your hands dirty, your trousers down, piss on it, piss in it, smell it, sniff it, just don’t stifle it. Compost as messy mettters–that rotten sunken feeling at year end, that fermenting delirious rising, that intoxicating additive high. Compost annotated, compost composite, compost ferformative. Seeds buried under bean sprouts, bursting assertively onto the scene, convincingly annouceing their own arrival. Blended by the friendly kinds, compost never dies. Germanium - Jamie Allen (Shift register) The earthly abundance of silicon is the contingent result of planetary condensation, the selective, centrifugal coalescence of a cosmic emulsion. Germanium, harder to extract and scarce (that is, expensive), was preferred by early electronics researchers as it allows for faster switching and lower voltage threshold, reduceing energy consumption and circuit size. The Teutonic element was used in Shockley’s first demo of semi-conduction and had it become the basic of the &quot;information economy,” high-grade deposits in places like Xilinhaote and Northumbria would be bootowns. Engineers are revisiting Ge as a way to smash the glass ceiling of silicon computation, breaking Moore’s dicouraging law. Shu lea Cheang：菌丝网络社会[1]成员 shift register: 馬丁·豪斯(Martin Howse)[2], Jamie Allen[3], Jonathan Kemp[4] 移位寄存器 Shift Register是Martin Howse，Jonathan Kemp和Jamie Allen（关键媒体实验室）的研究项目，研究人类媒体，技术和基础设施活动如何标志着地球。 轮班登记册对地球上人类活动的物质证据进行调查并使其清晰易读，将这些证据不作为人类成就的指标，而是作为模糊的谈判和行星耗尽的标志。该项目从自然科学和物理科学开始进行实地考察和研究，作为见证这些人类影响场所的手段。项目产出（着作，媒体和展览作品）旨在使环境科学与其他文化，情感，跨文化和亚文化观点相混淆，以便考虑到地球的能量和通信基础设施的复杂性和始终矛盾的性质。 该项目调查单一影响场地，并将地球媒体和调查结果转化为专门开发的地球实验室，研究，研讨会和展览场所。地球实验室既是一个概念性的，也是一个当地的户外工作环境，这个结构在项目的两年中作为纵向的比较场地。在地球实验室，材料样本被调解，展示和记录，准备媒体文件和调度，并进行公共项目讨论。 移民登记由瑞士国家科学基金会和一群从业者，顾问和朋友的帮助和兴趣支持，包括：ChristophKüffer，Bronwyn Lay，Orit Halpern，Paul Boshears，Eric Berger，Merle Ibach，RIXC等等，很多其他的。 http://mauvaiscontact.info/ ↩︎ Martin Howse 忙于对地球（地球物理现象），软件和人类心理（心理物理学）之间的联系进行艺术探索和研究，提出在严重滥用科学技术的过程中回归万物有灵论。通过构建实验情境（在过程驱动的表演，实验室，散步和研讨会内），材料艺术作品和文本，Martin Howse探索物质或材料与执行或协议之间的丰富联系，挖掘可见性和隐藏的问题世界。 ↩︎ 杰米艾伦他是加拿大出生的研究员，艺术家，设计师和教师，对哪些技术教会我们个人，文化和社会的兴趣感兴趣。他喜欢用头和手做事，并且是纽约美国自然历史博物馆的电子工程师，高分子化学家和设计师。他在世界各地讲学，出版和展览。他住在欧洲，从事艺术和技术项目，写作，并尝试与自己合作，创造出慷慨和协作的预设机构，承认友谊，激情和爱是美学，研究和知识的核心实践。他的博士（优等生，欧洲研究生院）由Siegfried Zielinski和Avital Ronell监督。他是瑞士巴塞尔关键媒体实验室的高级研究员 。www.jamieallen.com） ↩︎ Jonathan Kemp 在投机和情境生活编码事件方面有着悠久的历史，这些事件被阐述为世界上活跃的事物。项目合作包括材料加工性能，环境设施，投机性研讨会以及在整个欧洲和美国执行的社交软件活动。当前的项目和表现是通过对计算材料基板的随机和代码清理重新配置的兴趣来获知的。 ↩︎","tags":[{"name":"ever Elusive","slug":"ever-Elusive","permalink":"http://liudixian.github.io/tags/ever-Elusive/"}],"categories":[]},{"title":"系统美学与交互语境","date":"2018-11-10T12:24:14.000Z","path":"2018/11/10/交流，互动和系统/","text":"Cybernetic Aesthetics and communicative Context Claudia Giannetti http://mediaartnet.org/themes/aesthetics_of_the_digital/aesthetics_and_communicative Context/ tags: 翻译 Communication, interaction, and systems交流，互动，和系统 The idea of a scientific analysis of organization systems was first formulated in the early twentieth century by the Russian researcher Alexander Bogdanov. [1] His system theory, which attempts to register all organization elements in their entirety, introduced the basic concepts of the open system (with reference to living systems) and of feedback, and made Bogdanov a forerunner of cybernetics and of the systemic theories Ludwig von Bertalanffy would develop two decades later. [2] 俄罗斯研究员Alexander Bogdanov（亚历山大·波格丹诺夫）在二十世纪初首先提出了对组织体系进行科学分析的构想。 [1]他的系统理论试图全部提出所有系统性的元素，介绍了开放系统（参考生命系统）和反馈的基本概念，并且使Bogdanov（博格丹诺夫）先导的控制论和Ludwig von Bertalanffy（路德维希冯贝塔朗菲）先导的系统理论在二十年后有所发展。 吴衍彬 The first comprehensive contribution to the understanding and dissemination of the theory of self-organization was the result of the research carried out by the physicist and cyberneticist Heinz von Foerster from the late 1950s on, and especially after the publication of his treatise «On Self- Organizing Systems and their Environment» of 1960. Heinz von Foerster was well acquainted with cybernetics and information theory, and likewise with the basics of Artificial Intelligence (A. Turing and J. von Neumann) and system theory (P. Weiss and L. von Bertalanffy). Taking these theories as his starting point, heproposed that concepts such as those of redundancy, entropy or information (cybernetics) as well as those of self-regulation, autonomy and hierarchic order (system theory) be applied in the examination of organization. As Foerster saw it, every system exists autonomously—according to its own laws—and is organizationally self-contained, meaning its organization is selfreferential, self-maintaining, and recursive. He understood reality to be an interactive construction in which the observer and what is observed are two interdependent sub-aspects. In consequence, objectivity exists merely as an illusion on the part of the subject, even without whom a perception could exist independently. This implies that perception takes place by means of a linkage of observer and system unit, and namely in the domain in which this unit operates. In the 1970s and 1980s the basic concepts of system research, which relate to interaction, self-organization, co-evolution, or the environment, were further developed by a number of scientists, and translated into new theories. [3] System theory received an important impetus from the theory of «autopoiesis» [4] developed from the 1970s onward by the Chilean biologist Humberto together with the neuroscientist Francisco J. Varela. This theory linked for the first time two areas until then studied only separately: biology, or the theory of the organization of living organisms, and cognitive theory, which is particularly concerned with the problem of the cognition and perception of phenomena. In 1969 Maturana drew up the thesis according to which the nervous system is a closed system. [5] 对自组织理论的理解和传播的第一个全面贡献是物理学家和控制论家Heinz von Foerster从20世纪50年代后期开始，特别是在他的论文«On Self- Organizing Systems and their Environment»（«论自组织系统及其环境» ）在1960年出版之后，Heinz von Foerster掌握控制论和信息论，同样掌握人工智能（A. Turing和J. von Neumann）和系统论（P. Weiss和L. von Bertalanffy）的基础知识。 以这些理论为出发点，他提出冗余，熵或信息（控制论）以及自我调节，自治和等级秩序（系统论）等概念应用于系统性的考察。正如Foerster所看到的那样，每个系统都是根据自己的规律自治地存在的，并且在组织上是独立的，意味着它的组织是自我指涉的，自我维护的和递归的。 他将现实理解为一种交互式的构造，其中观察者和所观察到的是两个相互依赖的子方面（sub-aspects）。 结果，客观存在仅仅是作为主体方面的幻想，即使人的感觉是没有办法独立存在的。 这意味着感知通过观察者和系统单元的联系发生，即在该单元运作的领域之间发生。在20世纪70年代和80年代，与相互作用，自组织，共同进化或环境相关的系统研究的基本概念，由许多科学家进一步发展，并转化为新的理论。 [3]系统理论受到了智利生物学家Humberto（温贝托）与神经科学家Francisco J. Varela（弗朗西斯科瓦雷拉）一起从20世纪70年代发展起来的“autopoiesis”（“自创生成”）理论的重要推动。 这个理论第一次把两个领域联系起来，直到那时才分别研究：生物学或生物组织理论，认知理论，特别关注现象的认知和感知问题。 1969年，马图拉纳撰写了一篇论文，论述了神经系统是一个封闭的系统。[5] According to this thesis, living systems are autopoietic. [6] An autopoietic system operates as a closed system that generates only states of autopoiesis. The most important consequence of an autopoietic organization consists in the fact that everything occurring within the system is subjected to autopoiesis; otherwise the living system would collapse, because changes in the state of the organism and of the nervous system as well as of the medium act reciprocally, and so give rise to continuous autopoiesis. That means that living systems are determined by their structure («structure-specified»), and that autopoiesis represents their constitutive attribute. The expansion of the cognitive processes(action and interaction) by the nervous system enables, according to Maturana, non-physical interactions between organisms in simple relationships—and therefore communication. [7] 根据这篇论文，生命系统是自生的。 [^ 6]一个自创生系统作为一个只产生自动生成状态的封闭系统运行。 一个自创生组织的最重要的后果在于，系统内发生的所有事情都会受到自动生成的影响; 否则生命系统就会崩溃，因为生物体和神经系统以及媒体状态的变化会相互作用，从而导致不断的自我创生。 这意味着生命系统是由它们的结构决定的（“结构指定”），并且自生成代表了它们的构成属性。 根据Maturana的观点，神经系统的认知过程（行为和相互作用）的扩展使得简单关系中的生物体之间的非物理相互作用成为可能，从而促进了沟通。[7:1] These non-physical interactions distinguish human beings from organisms that lack a nervous system and in which interactions are purely physical in nature (as in the case of a plant, for example, where the reception of a photon triggers photosynthesis). Communication as interaction is a component of the system, and as a cognitive process does not refer to an autonomous external reality, but is—according to Maturana—a process of behavioral coordination between the observers through structural coupling. In this way, the cognitive domain is characterized by consensual coordinations of actions that enable operations to take place in many different cognitive domains constituting different realization modes of autopoiesis. [^8] 这些非物理的相互作用将人类与缺乏神经系统的生物区分开来，并且其中相互作用纯粹是物理性质的（例如植物的情况下，例如，接收光子触发光合作用）。 交流作为交互作用是系统的一个组成部分，而认知过程并不是指自主的外部现实，而是 - 根据Maturana - 通过结构耦合观察者之间的行为协调过程。 通过这种方式，认知领域的特点是协调一致的行为，使行动能够发生在构成自创生的不同实现模式的许多不同认知领域中。 If one speaks of a ‹world› or of ‹our culture,› then one would seem to be referring to something external, something independent of humanity, or to ‹an› objective reality. Contradicting this view, Constructivist theory holds that an organism creates its world on the basis of its physiological and functional constitution. As Maturana surmises: we create the world by perceiving it. 如果一个人谈到一个&lt;世界&gt;或&lt;我们的文化&gt;，那么人们似乎指的是某种外在的，独立于人类的东西，或者是客观的现实。 与建构主义理论相反的是，建构主义理论认为，有机体以其生理和功能结构为基础创造了它的世界。 正如Maturana所猜测的那样：我们通过感知创造世界。 Accordingly, three basic conclusions can be formulated from the systemtheoretic perspective. First, it is not permissible to allocate the cognitive phenomena, including language and communication, to any connotative or denotative function of reality which is independent of the observer; second, that which is produced by cultures is the result of interactions between living systems, as well as between living systems and their specific environment (or «niche,» as Maturana calls it); and, third, neither cultures nor the results, such as art, of creative operations emerge as ‹independent› attributes or objective and autonomous realities, but are always dependent on the observer, i.e. on the cognitive system. Therefore they are attributes of the consensual domain in which living systems operate. Only over context- and observer-dependency is it even possible to explain to human perception and cognition the operationality of cognition. [8] If this finding is transferred to art, then one could join Werner Heisenberg in saying that whatone views is not the work itself, but the work while being exposed to a particular mode of observation. 因此，从系统理论的角度出发可以得出三个基本结论。首先，不允许将包括语言和交流在内的认知现象分配给与观察者无关的任何内隐或外延的现实功能;其次，由文化产生的东西是生命系统之间以及生命系统与其特定环境之间相互作用的结果（或Maturana称之为“niche”）;第三，创造性操作的文化和结果（如艺术）既不是独立的，也不是客观的，自主的现实，而是始终依赖于观察者，即认知系统。因此它们是生命系统运行的共识领域的属性。只有在情境和观察者依赖的情况下，才有可能向人类认知和认知解释认知的操作性。如果这一发现转移到艺术上，那么人们可以加入维尔纳海森堡的观点，即任何人的观点不是作品本身，而是作品在接触某种特定的观察模式时。 Ken Rinaldo’s A-life installation «Autopoiesis» (2000) is an example of the application of organization parameters to interactive art. It assigns an important role to the environment and to the observers, since both intervene in the individual or collective behavior of the robots, as if the latter were biological beings. Rinaldo creates two organizational levels in the interactive installation: an internal process of organization generated by the communicative reciprocal relationship among the robots and independent of the environment; and a system of organization that is based on the intelligent sensors employed and heightens the data-processing capacity by registering the presence of foreign elements and immediately generating feedback. Thus, by means of the technological simulation of artificial life, his work experiments with ‹organic› autopoietic mechanisms, and underscores the interdependence of the machines, the function of the viewer, and the close relationship to the environment. Ken Rinaldo的A-life装置«Autopoiesis»（2000）是组织参数应用于互动艺术的一个例子。它赋予环境和观察者一个重要的角色，因为它们都介入机器人的个人或集体行为，就好像后者是生物一样。里纳尔多在交互式安装中创建了两个组织级别：一个由机器人之间的交互性相互关系产生的独立于环境的组织内部过程;以及基于所使用的智能传感器的组织系统，并通过注册外来元素的存在并立即生成反馈来提高数据处理能力。因此，通过对人造生命的技术模拟，他的作品尝试了&lt;有机&gt;自动生成机制，并强调了机器的相互依赖性，观众的功能以及与环境的密切关系。 «Autopoiesis»（2000） Maturana and Varela’s model of autopoeisis roused controversy at the same time as they stimulated new approaches to problems of cognitive research. Together with the contributions of Heinz von Foerster and, in the area of cognitive psychology, of Ernst von Glasersfeld, the model delivered impulses for a new current known as Constructivism or Radical Constructivism. This mode of thought is decisive insofar as it negates any possibility of being able to understand systems by means of analytic and reductionist methods, since it acknowledges the principle of self-organization to be fundamental. Man is part of a world of his own construction, and his life depends on the interactions formed by this interlocking system, or network. This model, however, aims to avoid tendencies toward an orthodox Constructivist attitude. The risk of research concentrating on internal and autopoietic processes of neuronal organization consists largely in the fact that their model conception refers to a closed apparatus with no knowledge of the external. The brain can be viewed as an operational, self-referential system in the sense of a purely internal function; in the cognitive system, however, interior and exterior (environment) are interrelated. Theacquisition of knowledge, education and culture is dependent on individual experiences of life. Maturana和Varela的autopoeisis模型在激发对认知研究问题的新方法的同时激起了争议。加上Heinz von Foerster的贡献，以及在认知心理学方面，Ernst von Glasersfeld的贡献，该模型推动了一种称为建构主义或激进建构主义的新潮流。这种思维方式是决定性的，因为它承认自组织的基本原则是否能通过分析和还原方法来理解系统。人是他自己建构的世界的一部分，他的生活取决于这个互相连锁的系统或网络所形成的相互作用。 然而，这种模式旨在避免正统建构主义态度的倾向。研究集中于神经组织内部和自创生过程的研究风险很大程度上取决于这样一个事实，即他们的模型概念指的是一种不知道外部因素的封闭设备。大脑可以被看作纯粹内在功能意义上的可操作的自我指涉系统;然而，在认知系统中，内部和外部（环境）是相互关联的。获取知识，教育和文化取决于个人的生活经验。 Selfreferentiality does not mean isolation, since the systems can be influenced from outside, even if the manner of this influence is determined by their functional organization. [9] Essential to the perception and construction of reality are other processes that produce a model of one’s own body (of the ego), and a spatiotemporal model as well as a model of the place in the time-space. The importance for brain activity of the limbic system—of the emotional and intentional components—makes it clear that the understanding and interpreting of reality are not exclusively the results of neuronal processes. 自我认同并不意味着孤立，因为即使这种影响的方式是由其功能组织决定的，系统也可能受到外界的影响。 [^ 10]对现实的感知和建构的基本要素是产生自己的身体模型（自我的模型），以及时空模型和时空位置模型(Essential to the perception and construction of reality are other processes that produce a model of one’s own body (of the ego), and a spatiotemporal model as well as a model of the place in the time-space. )。 边缘系统的大脑活动的重要性 - 情感和意图的组成部分 - 明确地表明，对现实的理解和解释不完全是神经过程的结果。 That which is experienced as reality is socially conditioned, for its construction rests on interaction with other individuals, on consensual domains, on language and culture. In summary it can be said that knowledge is a creative process that depends both on cognition and on interpersonal relationships and interactions with the environment: thus the entirety of knowledge, culture and art is based on the consensus, interactions and networking of individuals constituting society. 那些被认为是现实的东西是社会条件性的，因为它的构建依赖于与其他个人之间的互动，基于共识的领域，语言和文化。 总之，可以说知识是一个创造性的过程，既依赖于认知，也依赖于人际关系和与环境的相互作用：因此，知识，文化和艺术的整体基于构成社会的个人的共识，互动和网络。 Media art as intercommunicative process 媒体艺术是互动的过程 Albert Einstein once stated that scientific theories are free creations of the human mind, and that he considered it to be the most wonderful thing to be able to use them, nevertheless, to explain the world. The same might be said of art. As a free creation of the human mind, it does not explain an independent world; rather, it takes issue with the experience of the subject in his world, and offers various explanatory models for a context in which the observer and the work partake. 阿尔伯特爱因斯坦曾经说过，科学理论是人类思想的自由创造，并且他认为能够使用它们是最奇妙的事情，但是它可以解释世界。 艺术也是如此。 作为人类思想的自由创造，它不能解释一个独立的世界; 相反，它在他的世界中对主体的经验提出了问题，并为观察者和工作参与者的情境提供了各种解释模型。 Vilém Flusser’s thesis states that the function of art is to create other worlds and to enable access to other realities. Anyone who produces a work of art not only expresses with it a part of himself and his environment, but also brings about a dialogue with other observers and a projection of other realities. Because art commits itself to this process, changing the world—expanding human realities (knowledge, experiences, sensations or perceptions)— becomes its cause. From this perspective, every reality is based on experiences and actions of the creator as well as of the viewer, and is thus one argument in a (possible) explanation. As an operation within a consensual domain, the dialogic process can expand this domain and contribute to the emergence of new consensual domains, leading to an expansion of experiences, knowledge and arguments, which can potentially result in an altered cognitive horizon. Accordingly, as a form of communication, art must be ascribed to the domain of cognition that creates the prerequisites of communication. «Thought, science and art are selfreferential cognitive processes, but they are not self-maintaining: they need the physical-chemical existence of organisms that bring forth cognition, and with it thought, science and art. Whereas autopoietic systems can invariably carry out self-maintenance only in the physical-chemical framework preordained by their environment, cognitive processes are free from these restrictions and obey only internal laws and exigencies.» [10] In the art domain, therefore, reference to knowledge does not mean an approach to its possible contents exclusively on the basis of reason; rather, the intention is to emphasize that the co-influence of emotions and sensory experiences in the process of assimilating a work of art is an inseparable part of the dialogic process. In summary, two hypotheses can be set up. One is that since explanations of art are not constitutive, reductionist or transcendental, it is by no means a matter of the search for a single and definitive explanation for the domain of art. The other is that the function of art consists in changing the world, with the latter being understood to mean the expansions of human realities and cognitive domains, and consequently also of the knowledge and experiences resulting from possible interactions and the dialogic exchange in the explanatory context of the cognitive worlds. This leads to the question of how art can execute the communicative process. The branch of aesthetics more closely modeled on communication science examines social processes that develop expressive forms as well as phenomena of aesthetic expression fulfilling communicative functions (communication media, events, or social ceremonies).In art it is possible to distinguish among various modes of proceeding by which the problematic of communication is tackled: through the role of the viewer in the context of the work, through the analysis of the reception, or—as proposed for instance by Fred Forest and the proponents of ‹communication aesthetics›—from sociological viewpoints concerned with the influence of art on viewer, society or culture. Art is an especially complex socio-cultural domain because in the process of communication it avails itself of a mainly metaphoric, symbolic and non-trivial language. If there are several domains of reality, and all of them are equally valid, the theories of art aesthetics cannot individually lay claim to universal acceptance; nor can they be viewed as inherent to the object. Sense and meaning do not lie in the work of art itself, and cannot be conveyed through the latter in the expectation that the work will be adequately interpreted. In art, meanings are time-bound, culture-specific, observer-dependent cognitive processes; therefore, works of art cannot speak for themselves. A work of art should indeed invite the observer to enter its domain of reality and take an interest in its view of the world. If one viewer, or a group of viewers, is led to new consensual domains by a work of art, and hence to new cognition, then not only the creative act has been accomplished successfully, but communication has been, too: the spreading of a world-view to a community. Although art-works and communication are separate domains, neither works of art nor systems of art can exist without communication, no more so than art-communication is possible without art; accordingly, art-works serve the coupling of cognition and communication. [11] This amounts to a new theoretical position that deviates from the cybernetic model. Communication is no longer understood to mean the transmission of information, and nor is it seen as the transmission of knowledge from one system to another. It replaces the information-technical principle of communication with the model of the construction process within the cognitive systems and between systems. [^13] This process-oriented perspective is observer-dependent, i.e. as part of a network of social systems, every observer or observer community co-constitutessystems, and these naturally include art systems among others. Orientation has shifted from information objectivity to intersubjective interactivity. One consequence is that art is becoming a kind of «catalyst of society’s cultural reflection.» [12] Proposals representing a threat to the existence of a consensus-based cognitive domain can meet with strong emotional rejection within the cultural community. By contrast, twentieth-century art offers countless examples of cases in which with the aid of intentional polemics cognition domains were expanded through the institution of ‹art› being forced to criticize itself. The meaning of art and its aesthetics is to be sought in the function it exercises within the given observer communities, as well as in its ability to bring about by means of a language of its own an emotional and conceptual dialogue with the observer and the community. Interactivity: the interface question Just as people need the media for communication, technical interfaces enable different systems to be linked. It is a matter thereby of reducing spatio-temporal distances and of optimizing the response time and flexibility of the connection. The resultant re-definition of the positions adopted by both systems—subject and machine—influences the communication process. On the one hand, the subject is no longer merely an operator controlling a tool; on the other hand, the machine undergoes constant growth in regard to the independence of its functioning—in other words, it is no longer a ‹simple› tool in the traditional sense. 21. This gradual assimilation of the position and weighting in the humanmachine communication process [13] is clearly evident in the «Interface Model» of William Bricken. [14] With it he attempts to minimize the distance between the systems (A) and (B) and at the same time to demonstrate the reciprocal influence exercised on the agents by the interaction processes. This means that every transmission of information influences and defines the linked systems. In «Interface Model 4» Bricken introduces a further factor: the context. According to Bricken the interface boundaryrepresents the knowledge of the interaction environment on the part of the interacting agents. On being introduced into the interaction process, the parameter of context becomes an influencing factor in the communication process. Context is a component of the interaction between two systems in the measure which they share this parameter, but can be altered in the course of the process. Context and environment The position of Niklas Luhmann must be recalled to mind in regard to the factors of context/environment. System theory abandoned the idea of a totality constituted of parts in order to introduce the explicit reference to the environment. Luhmann goes one step further by making the structures and processes of a system dependent on their relationships to a specific environment, indicating that these structures and processes are comprehensible only in relation to this environment. This mutual dependence declares that one cannot design or create an interactive system in isolated form, since as a completed element it would a posteriori adapt to a random environment. «Systems of interaction are formed when the presence of people is used to solve through communication the problem of dual contingency. Presence brings with it perceptibility, and insofar structural coupling to communicatively not controllable consciousness processes.» [15] Communication, in Luhmann’s view, is in real life an environmentadapted operation. This adaptation, however, is not completely controllable in terms of cognition or, put differently, no communication is capable of checking every single step of the process. Alongside context/environment, time is another significant point of reference both from the perspective of optimizing interaction and recursivity as well as in regard to the response times between two systems. The endeavor to optimize the human-machine interaction process and the response times involved led to an enhancement of the visualization and sensorial perception of computer-processed information. Translation A further, crucial question is aimed directly at the notion of translation. Abraham A. Moles had already addressed the subject of ‹translation› [16] as one of the main factors in the human-machine relationship. From the technical viewpoint the interface assumes the function of translating and conveying information between two interconnected systems. As Halbach emphasizes, the problem lies precisely in the notion of ‹translation,› because not only does it connect various input and output channels, it also regulates and communicates various coding methods. «When it is a matter of interfaces of human-machine interaction, then (a) input and output channels cannot be adjusted to each other, since they are precisely what a human being, as an autopoietic system, does not possess, and (b) is it not possible to speak of a translation of the coding method, since the subsymbolic representation forms of the human nervous have not (yet) been decrypted.» [17] Due to the employment of technical media, interaction based on a human-machine interface denotes a qualitative expansion of communication computer displays and interfaces function as control mechanisms that maintain the equivalence of communication. For this reason, control—conscious or unconscious—is among the most relevant research tasks in the area of interactive systems. Today’s systems convey to the user impressions or sensations that are only partially attributable to his own sensory or motor activities, since the possibilities of interaction and the generation of outputs (for instance, moving three-dimensional images, or sound) are determined by the particular program constituting the user’s field of action. In the measure to which the user cannot completely control the cognitive processes of interactive communication in the simulated environment, part of the control must necessarily be exercised by the system itself. Models of interactive systems The actions of the observer thus exercise a fundamental and complementary function in interactive systems. The resultant need for synchronous humanmachine reactions, and the interdependence between the context of the subject and that of the systemenvironment, lead to the question of the different typologies of interactive systems and their strategies. Various works of media art deploying reactive systems and digital images at the same time directly or indirectly investigate the changes that the observer, by means of data manipulation over interfaces, can bring about in the work. Three models of interactive system can be roughly distinguished on the basis of media-assisted forms of interactivity: [18] — Discrete or active systems: although the user can control the content called up, and the sequence in which this occurs, he/she has no influence on the transmitted information, since the management of this information, which demonstrates predictable behavior, is integrated. — Reactive systems: the work’s behavior, which is media-assisted and based on feedback structures, results from the direct reaction to external stimuli, for instance user control or altered environmental conditions. Selection methods and recursive events create cognitive situations for the participative user. — Interactive systems: open program structuring, over which the receiver can also act as transmitter. Since the user can influence the procedure and appearance of the work, or even add new information in the case of more complex systems, it is a matter of content-related interactivity. Temporal, spatial, or content-based relations are established between interactor and work. Heinz von Foerster makes a distinction between trivial and non-trivial machines in regard to technical specificity. Trivial machines are causally describable and predictable, and conceivable only in non-physical areas such as mathematics. Machines in physical space are always non-trivial, since this space is subject to entropic processes. Two types of non-trivial machines can be distinguished: those which attempt to adjust their behavior to the trivial machines, and those which behave non-trivially. The former are purposeoriented machines, the latter are ones which are potentially suitable for interactivity. [19] According to Peter Weibel three different models of interactivity can be drawn up from the viewpoints of behavior and consciousness: synaesthetic interactivity, which consists of interactivity between variousmaterials and elements, such as image and sound, color and music; synergetic interactivity, which takes place between states of energy, as in works that react to changes in their environment; and communicative or kinetic interactivity between different people and between persons and objects. In all cases, environment or context are of crucial importance to the human-machine performance. As stated already, the integration of context into the interactivity process means acknowledging it as a conditioning factor in the communication process. Peter Weibel reflects upon the relationship of dependence between observer and context in his interactive installation «Cartesian Chaos» of 1992. Art/system Interactivity in art is therefore composed, as Peter Weibel proposes, of three digital characteristics: virtuality, variability, and viability.[20] On the other hand, the human-machine interface attests to the transformation of a culture based on narratively logocentric and sequential structures into a ‹digital culture› that is visual, sensory, retroactive and nonlinear (hypertextual) in orientation. The special potentiality of digital technology (including the telematic) is applied in order to overcome the boundaries of the purely instrumental and so accomplish the transformation into a medium of the imaginary generating cognitively and sensorially experiencable (virtual) environments. On the basis of all these factors associated with media art in general and with interactive art in particular, a crucial shift in the meaning of ‹art› towards that of ‹system›[21] is clearly discernible (without wanting to simply replace one term with another). The analysis of interactive systems leads to the conclusion that the interest lies no longer in the production of a work of art that reflects upon world- views through the reproduction or interpretation of ways of seeing, but that the work of art, as a ‹system,› attempts to scrutinize the world itself: the realities, the contexts, the life, the biological system of humanity. It is a system that opens up new ‹world-views.› Contemporary art creation assisted by processbased methods and systemic models is gainingnew significance in the sociocultural context, and thereby contradicting art’s postulated loss of function in the present-day world. Moreover, the idiosyncrasy of the process as well as the interactive and systemic character of the work produced inevitably entails a transformation of aesthetic paradigms. The systemic practices based on the use of interactive technologies demand an aesthetic theory appropriate to their methods. Endo-physics, which is closely linked with Constructivism, hereby offers ideal foundations for concepts inspiring proposals for an «endo-aesthetics,»[22]a theory considered to be suitable for recording the different manifestations of interactive and artificial systems. Translation by Tom Morrison 全网协作 Alexander Bogdanov, Tektología, published in three volumes in Russia between 1912 and 1917. ↩︎ Little notice was taken of Bogdanov’s writings during his lifetime, however, and the lack of promulgation meant that it was the Austrian biologist Ludwig von Bertalanffy’s ideas in regard to general system theory which turned into a scientific current the transformation of systemic thought. See Ludwig von Bertalanffy, «Der Organismus als physikalisches System betrachtet,» in Die Naturwissenschaften, Bd. 28, 1940, pp. 521–531; «The Theory of Open Systems in Physics and Biology,» in Science, vol. 111, 1950, pp. 23–29; General System Theory, New York, 1968. ↩︎ Like, for example, Ilya Prigogine and dissipative structures; Manfred Eigen and hyper-cycles; Hermann Haken and laser theory. ↩︎ ‹Autopoiesis›—from the Greek ‹auto› (self) and ‹poiein› (shaping)—means ‹self-shaping.› ↩︎ «The nervous system is a closed network of interacting active neuronal elements (neurons, effectors and receptors) that are structurally realized as cellular components of the organism. As such, it operates as a closed network of changing relations of activity between its components; that is, it is constitutive to the organization of the nervous system that any change of relations of activity between its components leads to further changes of relations of activity between them, and that in that sense it operates without inputs or outputs. Therefore, any action upon an environment that an observer sees as a result of the operation of the nervous system is a feature of the structural changes that take place in the nervous system as a cellular network, and not a feature of its operation as such.» Humberto Maturana, «Ontology of Observing. The biological foundations of self consciousness and the physical domain of existence» in chapter 9 «Consequences». See Humberto Maturana and Francisco Varela, Autopoiesis and Cognition: The Realization of the Living, Boston, 1980. ↩︎ «In the distinction of living systems, this distinction as entities engaged as adequate action consists in bringing them forth (in the praxis of living of the observer), both in conservation of autopoiesis and of adaptation and as a moment in their ontongenic drift in a medium. In other words, I have shown that for any particular circumstance of distinction of a living system, conservation of living (conservation of autopiesis and of adaptation) constitutes adequate action in those circumstances, and, hence, knowledge: living systems are cognitive systems, and to live is to know.» Humberto Maturana, «Ontology of Observing. The biological foundations of self consciousness and the physical domain of existence» in chapter 8 «Consequences». See Humberto Maturana ↩︎ Humberto Maturana, La realidad: ¿objetiva o construida? II, Barcelona,1996, p. 214. Cf. Humberto Maturana and Francisco J. Varela, The Tree of Knowledge: The Biological Roots of Human Understanding, Boston, 1987. [8] Humberto Maturana, «Kognition,» in Der Diskurs des Radikalen Konstruktivismus, Siegfried J. Schmidt (ed.), Frankfurt-on-Main, 1987, p. 114. See Humberto Maturana and Francisco Varela, Autopoiesis and Cognition: The Realization of the Living, Boston, 1980. ↩︎ ↩︎ Humberto Maturana, «Kognition,» in Der Diskurs des Radikalen Konstruktivismus, Siegfried J. Schmidt (ed.), Frankfurt/Main, 1987, pp. 89–118. ↩︎ Cf. Gerhard Roth, «Erkenntnis und Realität: Das reale Gehirn und seine Wirklichkeit,» in Der Diskurs des Radikalen Konstruktivismus, Siegfried J. Schmidt (ed.), Frankfurt/Main, 1987, p. 241. This would be one of the counter-arguments to Maturana’s assertion that cognitive systems are autopoietic (cf. Humberto Maturana, «Kognition,» in Der Diskurs des Radikalen ↩︎ Gerhard Roth, «Autopoise und Kognition: Die Theorie H. R. Maturanas und die Notwendigkeit ihrer Weiterentwicklung», in Der Diskurs des Radikalen Konstruktivismus, Siegfried J. Schmidt (ed.), Frankfurt/Main, 1987, p. 282. ↩︎ Cf. Siegfried J. Schmidt, Kalte Faszination, Weilerswist, 2000, p. 297. [13] Cf. Erich Jantsch, «Erkenntnistheoretische Aspekte der Selbstorganisation natürlicher Systeme» in Der Diskurs des Radikalen Konstruktivismus, Siegfried J. Schmidt (ed.), Frankfurton- Main, 1987, p. 170. ↩︎ Siegfried J. Schmidt, Kalte Faszination, Weilerswist, 2000, p. 288. ↩︎ Cf. the text section on «Man–Machine–Communication» in Claudia Giannetti, «Art, Science, and Technology.» ↩︎ William Bricken, «An Interface Model,» internal paper of ATARI Systems Research, Ms (draft), 1983, p. 5, cited after Wulf R. Halbach, Interfaces: Medien- und kommunikationstheoretische Elemente einer Interface-Theorie, Munich, 1994, p. 161. ↩︎ Niklas Luhmann, Die Gesellschaft der Gesellschaft, Frankfurt-on-Main, 1997, p. 814. ↩︎ Cf. Claudia Giannetti, «Information Aesthetics.» ↩︎ Wulf R. Halbach, Interfaces: Medien- und kommunikationstheoretische Elemente einer Interface-Theorie, Munich, 1994, p. 166. ↩︎ For further suggestions see Françoise Holtz-Bonneau, L’image et l’ordinateur, Paris, 1986. ↩︎ See Peter Krieg, «Versuch über Interaktion und Medien,» in Künstliche Spiele, Georg Hartwagner et al. (eds), Munich, 1993, pp. 180–181. ↩︎ See Peter Weibel, «The Unreasonable Effectiveness of the Methodological Convergence of Art and Science,» in Art @ Science, Christa Sommerer/Laurent Mignonneau (eds), Vienna/New York, 1998. ↩︎ Fred Forest wrote in 1985: «Replacer l’art, aujourd’hui, dans les systèmes situés aux divers niveaux d’organisation de la réalité, en faisant sauter les cloisonnements disciplinaires, me paraît une tâche nécessaire et à la fois enévitable.» See Fred Forest, «Manifeste pour une esthétique de la communication» in Esthétique des Arts Médiatiques, Louise Poissant (ed.), Québec, 1995, p. 36. In the catalog for the Interactive Media Festival, San Francisco, 1995, Roy Ascott replaced the notion of art with that of the system. Besides Weibel cf. also Louis Bec. ↩︎ Cf. also the text section «Principles of endo-physics» in Claudia Giannetti, «Endoaesthetics.» © Media Art Net 2004 ↩︎","tags":[{"name":"MediaArtNetII","slug":"MediaArtNetII","permalink":"http://liudixian.github.io/tags/MediaArtNetII/"}],"categories":[]},{"title":"艺术，科学与技术","date":"2018-11-10T12:15:41.000Z","path":"2018/11/10/艺术，科学和技术/","text":"ART, SCIENCE, AND TECHNOLOGY艺术，科学，和技术 Claudia Giannetti 克劳迪娅·詹内蒂 link 数字美学目录 tags: 翻译 MT&amp;T Art - science - art 艺术-科学-艺术 Deliberations on the connection between art and science have various points of departure. The most general considerations are limited to the assumption of a parallel development. In his writings published in 1970, Werner Heisenberg, who along with Max Planck counts as a founding father of quantum theory, stated that the tendencies towards abstraction in the sciences were comparable with those in the field of art. According to Heisenberg, new artistic and scientific forms can result only from new content, but the converse does not apply. To renew art or to revolutionize science, he wrote, meant to create new content and concepts, and not just new forms. [1] 对艺术与科学之间关系的讨论有不同的出发点。 最普遍的考虑仅限于并行开发的假设。 在1970年出版的着作中，与马克斯·普朗克一起成为量子理论的创始人之一的维尔纳海森伯格指出，科学中抽象的倾向与艺术领域的倾向相当。 根据海森堡的说法，新的艺术和科学形式只能由新内容产生，但相反并不适用。 他写道，重建艺术或革命化科学意味着创造新的内容和概念，而不仅仅是新的形式。 A question more complex than that of parallels between art and science is the extent to which art influences the sciences. According to Peter Weibel, this question can be answered only methodologically, that is by applying a comparison which views art and science as methods. While science, says Weibel, is distinctly methodological in character, art is generally not regarded as a method: «This is our first claim: art and science can only reasonably be compared if weaccept that both are methods. This does not mean that we declare that both have the same methods. We only want to declare that both have a methodological approach, even if their methods are or can be different.» [2] 比艺术与科学之间的相似之处更复杂的问题是艺术对科学的影响程度。 根据Peter Weibel的说法，这个问题只能通过方法论来回答，即通过比较，将艺术和科学视为方法。 Weibel说，尽管Weibel在科学上具有明显的方法论性质，但艺术通常不被视为一种方法：“这是我们的第一个主张：如果我们认为两者都是方法，艺术和科学只能合理地进行比较。 这并不意味着我们宣称两者都有相同的方法。 我们只想表明两者都具有方法论的途径，即使他们的方法是或可能不同。” Accordingly it would be permissible to view art and science as convergent in the methodological sense. As Weibel sees it, science is influenced by art in regard to its methods, but not by its products and references: «Because any time science develops the tendency for its methods to become too authoritarian, too dogmatic, science turns to art and to the methodology of art which is plurality of methods.» [3] The objective nature exists neither in the framework of the sciences nor in culture regardless of social construction, «art and science meet and converge in the method of social construction.» [4] 因此，可以将艺术和科学视为方法论意义上的趋同。 正如魏贝尔所看到的那样，科学受其艺术方法的影响，但不受其产品和参考文献的影响：“因为任何时候科学的发展趋势都会使其方法变得过于专制，过于教条化，科学就转向艺术，转向本身就多元的艺术方法。”[^ 3]客观本质既不存在于科学的框架中，也不存在于文化中，不论社会建构如何，“艺术与科学在社会建构的方法中相遇并融合”。 This position finds its most radical expression in the science-theoretical contributions of Paul Feyerabend. As a critic of scientific rationalism, he develops new interpretations and connections among the arts and sciences. He is of the opinion that artists and scientists developing a style or theory frequently pursue a secondary intention, namely that of representing ‹the› truth or ‹the› reality. However, artistic styles are closely connected with styles of thought. 这一立场在Paul Feyerabend的科学理论贡献中找到了最激进的表达。 作为科学理性主义的批评家，他在艺术和科学之间发展了新的解释和联系。 他认为，发展一种风格或理论的艺术家和科学家经常追求第二个意图，即表现真理或现实。 然而，艺术风格与思想风格密切相关。 :::success 刘迪先 1~4 ::: 5. That which a specific form of thought understands concepts such as truth or reality to mean is what this form of thought asserts as truth. When one decides in favor of a style, a reality, or a form of truth, then one always chooses a human-made construction. In other words, Feyerabend negates the possibility of absolute rationality and logic in regard to that which is created by the human mind. He asserts that this relativist, and in a certain sense irrational, factor inherent in every branch of science places science in the proximity of art. According to Feyerabend, the sciences are not an institution of objective truth, but are arts along the lines of a progressive understanding of art. [5] 特定形式的思想理解真理或现实这些概念的含义是这种思想形式所说的真理。 当人们决定支持一种风格，一种现实或一种真理时，人们总会选择一种人造的建筑。 换句话说，费耶阿本德(Feyerabend)否定了关于人的思想所创造的绝对理性和逻辑的可能性。 他断言，这个相对主义者，以及某种意义上非理性因素，科学的每一个分支固有的因素都将科学置于艺术的附近。 根据费耶阿本德的说法，科学不是客观真理的制度，而是艺术逐渐理解的艺术。 Feyerabend’s line of argument reflects the skepticism that deeply influenced occidental culture and science well into the twentieth century. The aforementioned questions of truth, reality and reason are central components of the contest between rationalism and relativism affecting art no less directlythan science. If the nature of science were to be considered a research method under the premises of reality, plausibility, and dialectics, then whoever attempted to identify these three principles by strictly observing the complexity of the objects would, according to the Spanish scientist Jorge Wagensberg, reach the conclusion that the object resisted the method. The only manner of proceeding would be to «soften up» the method, with the result that «science is transformed into ideology.» «At its core ideology means not research, but faith. It follows from this consideration that one must stop with ideology all the holes which science has itself failed to stop. […] If the knowledge towards which we aspire is ruled not by laws but by world-views, then it would seem expedient to take our leave of scientific methods, and perhaps even adopt principles radically opposed to the latter. Precisely that is the case in art, in a kind of knowledge whose creators have not the least interest in distancing themselves from their creation.» [6] 费耶阿本德(Feyerabend)的论据反映了对西方文化和科学深深影响到二十世纪的怀疑论。上述关于真理，现实和理性的问题是理性主义和相对主义之间对艺术的争夺的核心组成部分，这些对艺术的影响不亚于科学。根据西班牙科学家Jorge Wagensberg的说法，如果科学的本质在现实，合理性和辩证法的前提下被认为是一种研究方法，那么无论谁试图通过严格观察这些物体的复杂性来确定这三个原则，该对象抵制该方法的结论。唯一的处理方式是“软化”方法，结果是“科学转化为意识形态”。“其核心思想意味着不是研究，而是信仰。&quot;从这一点出发，人们必须意识到科学自身未能阻止的所有漏洞…”如果我们所追求的知识不是由法律而是由世界观来统治的话，那么让我们放弃科学方法似乎是合适的，甚至可能采用与后者完全相反的原则。这恰恰就是艺术中的情况，一种知识的创造者并没有丝毫的兴趣来将自己从创作中解脱出来。“ Of particular relevance to the understanding of a new interpenetration of art and science is the generative nature of either area, which brings forth words or world-views of its own. For that reason, «the worlds of art and science are ideologically no longer opposites,» as Ilya Prigogine states, «the variety of the significates and the basic opacity of the world are reflected in new languages and new formalisms.» [7] 与理解艺术与科学的新相互渗透特别相关的是任何一个领域的生成性质，它带来了自己的文字或世界观。 出于这个原因，“艺术和科学的世界在意识形态上不再是对立的，”正如Ilya Prigogine所说，“世界的各种意义和基本的不透明性都反映在新语言和新形式主义中。” :::info 刘迪先 5~7 ::: The origins of information theory 信息论起源 :::success 寿盛楠8-11 ::: 8. The technological revolution received its fundamental impetus from the first industrial revolution in the nineteenth century. By starting up a process of mechanization, the industrial revolution triggered the phenomenon of crises of control. [8] The mounting production levels resulting from mechanization led to the need for control systems to accelerate the flow of information. Researchers began to seek solutions in feedback techniques, automatic control systems, and information processing. 技术革命从19世纪第一次工业革命那里获得了根本性的推动力。随着机械化的开展，工业革命扣响了控制危机这一现象的扳机。 [8]机械化带来的生产水平的递增激起了人们对控制系统的需求，以此来加速信息流动。研究人员开始在反馈技术、自动控制系统和信息处理方面寻求解决办法。 Under the title «On Governors» in 1868, Clerk Maxwell presented the first theoretical study towards an analysis of control and feedback mechanisms, so ushering in the radical transformation in automatic control engineering. By the late nineteenth century, a series of developments and technical innovations wereunderway that in the 1940s would serve as the basis of a new theory, namely cybernetics. [9] 1868年，在题为“On Governors”的一文中，Clerk Maxwell首次发表了对控制机制和反馈机制进行分析的理论研究，从而引发了自动控制工程领域的激进变革。到十九世纪后期，一系列的发展和技术革新正在进行，即将在20世纪40年代成为新理论的基础，即控制论。 [9] The control revolution produced not only feedback techniques and a new hierarchization of media, but also revolutionized the cultural reproduction forms of society. [10] This included areas like communications and art, since the technologies exercised a direct influence on the forms of sociocultural (re)production. 控制革命不仅产生了反馈技术、造就了新的媒体分层，而且还革新了社会的文化再生产形式。 [10]这其中便包括了诸如通信和艺术等领域，因为这些技术直接影响到了社会文化（再）生产的形式。 Until then, nevertheless, the themes associated with control mechanisms and automation were discussed in connection with only one common parameter, namely energy. As the basic concept of Newtonian mechanics, energy retained the same position in the natural sciences and in research fields like acoustics, electrical science, and optics. The invariant of ‹mass› similarly occupied a central position in physics. However, as production techniques continued to be improved, so the relationship of human and machine began to change likewise, leading to the emergence of questions about new terms and theories able to make this communication process between biological and technological systems the object of targeted research. 而在那之前，与控制机制和自动化相关的主题只与一个通用参数有关，即能量。作为牛顿力学的基本概念，能量在自然科学、声学、电子科学和光学等研究领域保有同样的地位。 (mass)的不变性同样在物理学中占据了中心位置。然而，随着生产技术的不断完善，人与机器的关系也开始发生变化，导致出现了一些关于新术语和新理论的问题，这些新的术语和理论能使生物系统和技术系统之间的交流过程成为有针对性的研究对象。 The constitution of two new disciplines: cybernetics and artificial intelligence 两个新学科的构成：控制论与人工智能 That society can only be understood through a study of the messages and the communication facilities which belong to it; and that in the future development of these messages and communication facilities, messages between man and machines, between machines and man, and between machine and machine, are destined to play an ever increasing part,» [11] was the key idea of the American mathematician Norbert Wiener (1894–1964), which he elaborated in his book «The Human Use of Human Beings. Cybernetics and Society,» published in 1950 after a first technical study «Cybernetic, or Control and Communication in the Animal and in the Machine» of 1948. In 1950 likewise, the British mathematician Alan Turing (1912–1954) raised the question of the feasibility of logical thought by machines. In his essay «Computing Machinery and Intelligence,» published in volume 59 of the philosophical journal «Mind,» Turing proceeds from the basic question with which his text begins: «Can machines think?» 只有通过研究属于它的信息和通信设施才能理解“社会”；而且在这些信息和通信设施的未来发展中，人与机器之间，机器与人之间，机器与机器之间的信息注定将会发挥越来越大的作用，“[11]是美国重要思想家与数学家诺伯特·维纳（Norbert Wiener，1894-1964），在他的书《人类的人类使用，控制论与社会》一书中详细阐述了这一点。 该书于1950年发表，经过第一次技术研究《1948年动物和机器中的控制与沟通》之后。在1950年，同样，英国数学家艾伦图灵（1912-1954）提出了机器逻辑思维的可行性。在哲学杂志《心》”第59卷发表的论文«计算机械与情报»之中，图灵从他的文本开始的基本问题出发：“机器能思考吗？” Until the mid-twentieth century no more than a few researchers working in isolation were concerned with subjects such as communication between dissimilar systems (for instance, biological and technical systems), or with the feasibility of technically designing thought machines. In addition to Wiener and Turing their ranks included Charles Babbage, Claude Shannon, Warren Weaver and Hermann Schmidt. However, from the 1950s on these subjects rapidly became two fields of basic research: cybernetics and Artificial Intelligence. [12] The two aforementioned texts triggered a flood of publications containing speculation and analysis on these subjects. In the first three years after 1950 alone, more than a thousand essays published dealt with intelligence and with communication with and between machines. Yet, when Turing published his essay there existed no more than four digital computers worldwide (Mark I and EDSAC in England, ENIAC and BINAC in the USA). [13] Although Turing’s theorem—everything the human mind can do in the form of an algorithm can also be carried out by a Universal Turing Machine—was based on models so far investigated only as a hypothetical experiment, several researchers were inspired to empirically confirm or disprove it by building machines. 一直到二十世纪中叶，只有很少的一部分研究人员在关注诸如不同系统（例如生物系统和技术系统）之间的通信或者从技术上设计思想机器的可行性等等主题。除了维纳和图灵之外，他们（学者）的队伍还包括查尔斯巴贝奇，克劳德香农，沃伦韦弗和赫尔曼施密特。然而，从20世纪50年代开始，这些主题迅速演变为基础研究的两个领域：控制论和人工智能。 [12]上述两篇文章引发了大量的出版物的出版，其中包括对这些主题的猜测和分析。在1950年以后的头三年之中，发表的论文超过一千篇，涉及智能和机器间的沟通。然而，当图灵发表他的文章时，世界上数字计算机不超过四台（英格兰的Mark I和EDSAC，美国的ENIAC和BINAC）。 [13]虽然图灵定理 - 人类大脑能够以算法的形式做的所有事情也可以通过通用图灵机来实现 - 基于迄今为止只作为假设实验进行过调查的模型，但几位研究人员受到启发以凭经验证实或者通过建造机器来进行反驳。 :::info 冯浩祯11 ~ 13 ::: Communication The approach of cybernetics—a name derived from the Greek term ‹kybernetes› (steersman)—consists in transferring the theory of control and message transmission, whether in the machine or in a living being, to the fields of communication and machine control. The objective is to investigate the relationships between animal and machine, and in the case of the machine the specific mode of its behavior, as a characteristic of the performance to be expected. [14] 控制论的方法 —— 一个源于希腊语（舵手）的名称 —— 将无论是在机器还是在生物体中的控制和信息传输理论，都转移到了信息交流与机器控制领域。其目的是调查分析动物和机器之间的关系，以及以机器的特定行为模式，作为预期性能的一个特征。[14] On the basis of the observation of certain analogies between machines and living organisms, the mathematician asserts that no reason actually exists not to make a machine resemble a human being, since one and the other develop tendencies toward decreasing entropy, meaning that both are examples of local anti-entropic phenomena. 在观察机器和生物体之间的某些相似性的基础上，数学家断言，实际上机器与人类是有理由相似的，因为他们都倾向于熵减，这意味着两者都有局部anti-entropic（反熵）的现象。 Turing likewise conceded priority to the subject of communication. His famous experiment—the imitationgame, as he called it, also known as the Church-Turing thesis or Turing Theorem—for verifying the intelligence of a computer was concerned less with the actual construction of such a machine than with simulating with machines the human capability of communication. Turing was here acting in line with a tradition of measuring the faculty of thought by the ability to use human language. Descartes had already presented the logically semantic usage of language as a criterion for identifying thinking beings. For a long time, the mastery of semantics would remain a basic problem of Artificial Intelligence. 图灵同样将重点放在交流上。 他著名的实验 —— 他称之为“模仿游戏”，也被称为Church-Turing thesis（丘奇-图灵论题）或Turing Theorem（图灵定理） —— 证明计算机的智能与机器模拟人沟通的能力相关，而不是与这种机器的实际构造相关。笛卡尔已经将语言的逻辑语义用法作为识别思维存在的标准。 在很长一段时间里，语义的掌握仍然是人工智能的一个基本问题。 Information In contrast to that tradition Wiener’s cybernetics sought operational ways of developing a specific language that would enable communication between dissimilar systems, and aimed to adapt semantics to specific goals in the process. Viewed from this perspective, Wiener’s theory replaced the notion of energy with that of information as the elementary parameter of communication, and thus postulated the definition of this new invariant for cybernetic science as a whole, which is a basic prerequisite for understanding the range of the cybernetic approach. 与传统相反，Wiener’s（维纳的）控制论寻求开发一种能够在不同系统之间进行通信的特定语言的操作方式，并且旨在过程中使语义适应的特定的目标。从这个角度来看，Wiener’s（维纳的）理论用作为交流的基本参数的信息取代了能量的概念，并因此假定这个作为一个整体的新的控制论科学不变量的定义，这是理解控制论方法工作范围的一个基本先决条件。 Unlike Newton’s mechanics, which operates with closed systems, information is applied to open systems. In this way it must be seen as a key enabling linkage and communication between dissimilar systems, and between the latter and the external world. ‹Mass› and ‹energy› are directly related to matter in the natural sciences, whereas ‹information› is not conveyed by any substance, but is based on variable properties: Information can be reproduced (duplicated or copied), destroyed (erased), or reiterated (repeated). «Information is a name for the content of what is exchanged with the outer world as we adjust to it, and make our adjustment felt upon it. The process of receiving and of using information is the process of our adjusting to the contingencies of the outer environment, and of our living effectively within that environment.» [14] To this extent, not the possible quantity of circulating information is crucial to the effectiveness of communication, but the degree to which this information is integrated into communication. Along the lines of cybernetics, then,significant information is not the entirety of all information transmitted, but that information which passes through the ‹filters.› 与牛顿的机械系统不同，该系统采用封闭系统运行，信息应用于开放系统。 通过这种方式，它必须被看作是不同系统之间以及后者与外部世界之间的关键连接和交流。 &lt;质量&gt;和&lt;能量&gt;与自然科学中的物质直接相关，&lt;信息&gt;不是由任何物质传递的，而是基于不同的属性：信息可以被复制（复制或拷贝），销毁（擦除） 或重申（重复）。“信息是我们在适应它时与外部世界交换内容的名称，并使我们的可以调整感受到它。 接收和使用信息的过程是我们适应外部环境的突发事件和调整我们在该环境中可以有效地生活的过程。“[14]在这种层面上，重要的不是大量传播信息对于交流的有效性，而是这种信息融入交流的程度。然后，根据控制论的观点，重要信息并不是所有信息的完整传递，而是通过&lt;过滤器&gt;的信息。 :::success 吴衍彬14-18 ::: Feedback 反馈 In the field of information and communication Wiener devoted particular attention to the question of automatons and the development of feedback models. His core interest lay in investigating machines capable of evaluating input and of integrating the stored experience into the further feedback loops. In this respect, feedback is a method of making systems self-regulating, by which the results of preceding activities are re-integrated in the procedural sequence and thus enable runtime corrections to be made permanently. To this end, machines must be capable of learning processes. 在信息和通信领域，维纳特别关注自动机问题和反馈模型的发展。他的核心兴趣在于研究能够评估输入并将存储的体验整合到更多反馈环路的机器。在这方面，反馈是一种使系统自我调节的方法，通过该方法将前面活动的结果重新集成在过程序列当中，从而使在运行的同时修正可以够永久地持续下去。为此，机器必须能够学习过程。 Although his approaches and conclusions are very different from those of Wiener, Turing in his essay likewise clearly indicated the necessity of developing systems capable of learning. Devoted to the subject of learning machines, the essay takes as its starting point the principle that «education can take place provided that communication in both directions between teacher and pupil can take place by some means or other.» [15] Turing’s theory already aims at the need to create systems that guarantee for bi-directional communication of this kind. Necessary for this purpose are «unemotional channels of communication» over which it is possible to «teach a machine by punishments and rewards to obey orders given in some language, e.g., a symbolic language.» [16] 虽然他的方法和结论与维纳的方法和结论有很大不同，但图灵在他的论文中也清楚地表明了开发能够学习的系统的必要性。致力于学习机器的主题，这篇文章的出发点是“教育的前提是当教师和学生之间的双向沟通可以通过某种方式进行。”[15]。图灵的理论瞄准的是需要创建保证这种双向通信机制的系统。为此，非常必须的是“非情感的沟通渠道”，通过这种沟通渠道，可以实现“通过惩罚和奖励教导机器遵守某些语言给出的命令，例如象征性的语言”。[16] Human-machine communication Turing’s idea was directed at the concept today known as ‹interface› or ‹humanmachine interface.› This intermediary element is a kind of ‹translator› who transforms the information conveyed in symbolic language into binary code, the language of the computer. To this extent, the interface opens up a communication channel between the two systems, between the human and the electronic. 图灵的思想被用于当今知名的&lt;接口&gt;或者是&lt;人机接口&gt;的概念。这个媒介的元素是&lt;翻译器&gt;的一种类型：转换符号语言的表达通过计算机二进制代码的语言来传达信息。通过这样的扩展，这个接口便开启了人和电子设备两个系统之间通信的通道。 :::success 倪华夏 21 ::: Turing here went one step further than the feedback theory of Wiener, whose concept was confined to recursive processes within single systems. Turing, by contrast, conceived of a system capable oflearning and based on the exchange of information between human and machine. The approaches of the two mathematicians differ above all in the possibility of comparing systems. Norbert Wiener took as his point of departure the principle that a resemblance exists between living beings and machines, with the learning process being restricted to the acquisition of information and the ability to memorize the results of past operations for future usage. Alan Turing insisted that there was a difference between the behavior of the human nervous system, in which «chemical phenomena are at least as important as electrical» [17] and the capabilities of a discrete machine. [18] Machines «which move by sudden jumps or clicks from one quite definite state to another» [19] do not, strictly speaking, exist, since in reality everything is a constant process. This difference therefore makes impossible a direct connection between human beings and machines, and at the same time demands the development of a ‹channel› (interface) that initiates this communication. [20] Turing’s proposal was thus a decisive step towards the development of electronic interfaces for human-machine communication, and beyond that for the development of interactive, digital systems. This communication channel permits bi-directional information exchange, and therefore also learning processes. On the basis of this method, Turing repudiated the thesis set up by Ada Lovelace in 1842. [21] Using investigations made with the ‹analytic machine› of Charles Babbage, Lady Lovelace had claimed that a machine can do only that which it is instructed to do, and therefore is never capable of producing anything truly new. [22] Turing contradicted this thesis with the question «who can be certain that ‹original work› that he has done was not simply the growth of the seed planted in him by teaching, or the effect of following well-known general principles?» [23] He further pointed out that the machine must be to a certain degree ‹undisciplined› or random-controlled in order that its behavior can be considered intelligent. [24]Precisely this element of chance was what lent the machine ‹creative› ability, namely the ability to solve problems. 图灵在这里比维纳的反馈理论更进一步，它的概念仅限于单个系统内的递归过程。相反，图灵构想了一个能够学习的系统，并基于人机交互信息。两位数学家的方法在比较系统的可能性上有所不同。诺伯特·维纳以他的出发点为基础，认为生物与机器之间存在相似之处，学习过程仅限于获取信息，并能够记忆过去操作的结果以备将来使用。艾伦图灵坚持认为人类神经系统的行为与“离散机器的能力”之间存在着差异，其中“化学现象至少与电力一样重要”[18]。 [^ 19]从严格意义上说，机器“突然跳跃或点击从一个相当确定的状态移动到另一个状态”[^ 20]并不存在，因为实际上一切都是一个连续的过程。因此，这种差异使得人与机器之间不可能直接连接，并且同时要求开发启动该通信的&lt;通道&gt;（接口）。因此，图灵的提案是开发用于人机通信的电子接口的决定性步骤，并超越了开发交互式数字系统的决心。该通信渠道允许双向信息交换，因此也允许学习过程。在这种方法的基础上，图灵驳斥了Ada Lovelace在1842年设立的论文。[^ 22]利用Charles Babbage的所做的调查，Lady Lovelace声称机器只能做到被指示去做，因此永远不会产生任何真正新的东西。图灵提出问题来反驳，“谁能够确信他所做的工作并不仅仅是教他种在他身上的种子的成长，还是遵循众所周知的一般原则的影响？ »[^ 24]他进一步指出，机器必须达到某种“无规律的”或者随机控制的程度，才可以被认为是智能的。 [^ 25]正是这种随机性是机器产生创造性的能力，即解决问题的能力。 Although discrete machines that could pass the Turing Test are feasible, they would succeed notbecause they were replicas of the human brain but because they would have been programmed accordingly. As Turing himself realized, the basic problem lies in the area of programming. In fact, it was not necessary to wait the fifty years assumed by Turing in order to program «computers, with a storage capacity of about 109, to make them play the imitation game so well that an average interrogator will not have more than a 70 per cent chance of making the right identification after five minutes of questioning.» [25] The programs have been written, and have passed the Turing Test with a high degree of interactivity. One might therefore conclude that the problem is not solely confined to investigating the possibilities of Artificial Intelligence. [26] 尽管可以通过图灵测试的分立机器是可行的，但它们会成功，不是因为它们是人脑的复制品，而是因为它们会被相应地编程。 正如图灵自己意识到的那样，基本问题在于编程领域。 事实上，没有必要等待图灵假定的50年来编程这样一个计算机“有109个储存器，能够很好的运行冒充(人类)的游戏，并使普通的询问着不会超过70%概率做出正确的判断”这些程序已经编写完成，并且已经通过了高互动性的的图灵测试。 有人可能因此得出结论：问题不仅仅局限于调查人工智能的可能性。 Viewed from the contemporary perspective, cybernetics and AI cannot be reduced to solely scientific, economic, or technical interest. Since these theories belong to a socio-technical field in which communication structures, world-views and people-views are formed and transformed, they are concerned with philosophic issues of perception, cognition, language, ethics, and aesthetics. If information technology is basically working towards the automation of mental processes, then it directly or indirectly reaches into disciplines concerned with human cognition or creativity. 从当代角度来看，控制论和人工智能不能仅仅归结为科学，经济或技术的兴趣。 由于这些理论属于这样一个社会技术领域：在这个领域交流模式中，世界观和人们的观点被形成和转化，他们关心的是感知，认知，语言，伦理和美学等哲学问题。 如果信息技术基本上致力于心理过程的自动化，那么它直接或间接地涉及与人类认知或创造有关的学科。 Translation by Tom Morrison 翻译：Tom Morrison See Werner Heisenberg, Physik und Erkenntnis, Gesammelte Werke, vol. 3, Munich, 1985. 见Werner Heisenberg，Physik und Erkenntnis，Gesammelte Werke，vol. 3，慕尼黑，1985 ↩︎ Peter Weibel, «The Unreasonable Effectiveness of the Methodological Convergence of Art and Science,» in Art @ Science, Christa Sommerer/Laurent Mignonneau (eds), Vienna/New York, 1998, p. 170. Peter Weibel，“艺术与科学的方法论融合的不合理有效性”，Art @ Science，Christa Sommerer / Laurent Mignonneau（编辑），维也纳/纽约，1998年，170。 ↩︎ Peter Weibel, «The Unreasonable Effectiveness of the Methodological Convergence of Art and Science,» in Art @ Science, Christa Sommerer/Laurent Mignonneau (eds), Vienna/New York, 1998, p. 173. ↩︎ Peter Weibel, «The Unreasonable Effectiveness of the Methodological Convergence of Art and Science,» in Art @ Science, Christa Sommerer/Laurent Mignonneau (eds), Vienna/New York, 1998, p. 174. ↩︎ See Paul K. Feyerabend, Against Method, London, 1975. ↩︎ Jorge Wagensberg, «Las reglas del juego,» in Proceso al Azar, Jorge Wagensberg (ed.), Barcelona, 1986, p. 13. ↩︎ Ilya Prigogine, «Enfrentándose con lo irracional,» in Proceso al Azar, Jorge Wagensberg (ed.), Barcelona, 1986, p. 158. ↩︎ See James Beniger, The Control Revolution. Technological and Economic Origins of the Information Society, Cambridge, 1986. ↩︎ See Jochen Schulte-Sasse, «Von der schriftlichen zur elektronischen Kultur: Über neuere Wechselbeziehungen zwischen Mediengeschichte und Kulturgeschichte,» in Materialität der Kommunikation, Hans Ulrich Gumbrecht/Ludwig Pfeiffer (eds), Frankfurt/Main, 1988, pp. 429–453. ↩︎ Jochen Schulte-Sasse, «Von der schriftlichen zur elektronischen Kultur: Über neuere Wechselbeziehungen zwischen Mediengeschichte und Kulturgeschichte,» in Materialität der Kommunikation, Hans Ulrich Gumbrecht/Ludwig Pfeiffer (eds), Frankfurt/Main, 1988, p. 433. ↩︎ Norbert Wiener, The Human Use of Human Beings. Cybernetics and Society, Boston, 1950/1954, p. 16. ↩︎ Abbreviated as AI. ↩︎ The first computer running on a program was developed in 1941 by Konrad Zuse in Germany. [^14]： Norbert Wiener, The Human Use of Human Beings. Cybernetics and Society, Boston, 1950/1954. ↩︎ Norbert Wiener, The Human Use of Human Beings. Cybernetics and Society, Boston, 1950/1954, pp. 17–18. ↩︎ Alan M. Turing, «Computing Machinery and Intelligence» (1950), in Mind, 59, pp. 433–460. ↩︎ Alan M. Turing, «Computing Machinery and Intelligence,» in Mind, 59, pp. 433– 460. ↩︎ Alan M. Turing, «Computing Machinery and Intelligence,» in Mind, 59, pp. 433– 460. ↩︎ «Discrete» signifies numerical values that are separated by finite intervals and, breaking down into individual points, are countable. A discrete quantity has a defined number of possible values. ↩︎ Alan M. Turing, «Computing Machinery and Intelligence,» in Mind, 59, pp. 433– 460. ↩︎ See Wulf R. Halbach, Interfaces: Medien- und kommunikationstheoretische Elemente einer Interface- Theorie, Munich, 1994, p. 143. ↩︎ Daughter of Lord Byron and assistant of Charles Babbage. ↩︎ See Ada A. Lovelace, «Sketch of the Analytical Engine Invented by Charles Babbage,» Geneva, 1842, reprinted in Philip and Emily Morrison, Charles Babbage and His Calculating Engines, New York, 1962, pp. 248–249 and 284. ↩︎ See Alan M. Turing, «Rechenmaschinen und Intelligenz» in Intelligence Service — Schriften, Berlin. 1987, p. 153. Alan M. Turing, «Computing Machinery and Intelligence,» in Mind, 59, pp. 433– 460. ↩︎ Alan M. Turing, «Computing Machinery and Intelligence,» in Mind, 59, pp. 433– 460. ↩︎ Alan M. Turing, «Computing Machinery and Intelligence,» in Mind, 59, pp. 433– 460. ↩︎ See Margaret A. Boden (ed.), The Philosophy of Artificial Intelligence, Oxford, 1989/1990. © Media Art Net 2004 ↩︎","tags":[{"name":"MediaArtNetII","slug":"MediaArtNetII","permalink":"http://liudixian.github.io/tags/MediaArtNetII/"}],"categories":[]},{"title":"MarkHansen","date":"2018-11-07T17:43:45.000Z","path":"2018/11/08/MarkHansen/","text":"Markhansen Day 1 comesfrom Germany \b Poststructuralism, America name for a movement in France from 1960-1970-80 A critical developments from structuralism Claude Levi-Strauss structural linguistics 语言结构学 Sign -&gt;signifer能指 -&gt;signify所指 后结构主义 语言结构学-德里达Jacques Derrida 结构心理学-拉康Jacques Lacan 后结构主义-福柯Michel Foucault order of discource话语秩序 罗兰巴特 Hermeneutic -hermes 解释学 能指与所指 互相作用 能指是所指的物质支持-结构主义 meterial suport 是不存在的 --媒介学家的论调 虚构小说所构建的世界 M.H understanding Media Mcluhan 的肤浅-理论之下没有内容 贡献：电子媒介与模拟媒介的转变是感知的转变 对媒介理论的总结 具体例子-热媒体、冷媒体等等 Guttenburg Galaxy “印刷技术、书写对人成为单一的个体的贡献” 共同感官体验与个人感官你体验——微信 M.H的老师 Bias of Communication argued that different kinds of writing surfaces worked within and produced different kinds of empires. 两种偏见 Time bias 时间偏见: -heavy, monumental 石碑等书写界面–中央集权政府 Space bias : \b草纸的书写界面 非中央集权 Fridrich Kittler background in Hermeneutic analyse of literature Discourse Network 1800/1900 - analysis of literature in relation to technical system 1800Romantic poetry 1900 literature in ralation to… Film, Gramophone,Typewriter three kinds of analog mediatisation 将声音与视觉的体验联系起来 \bsystematize literature Alphabetic Monopoly Kittler’s sources Foucault -Archoeology of Knowledge what’s is said-------&gt;enouciated what’s sayble? ------&gt;enouciation 在特定的时空中那些是已说的，那些是能说的 产出的话语权？ 规定着我们说话的文化档案 What’s lacking here is a \blacking：媒体技术对文化档案的支持 meidia technology of suport 媒介技术的规定性与界定性：对于’sayble’ technogical and meterial the suport of said or sayble Key theoretical issues in media N.KatherineHayles Conflict between attention to material of the medium and to the meaning Claude Shannon, methematical of Information Communications Other key figures in history of media study 我们何以成为后人类 信息不是material German versus American media theroy 德国在拥抱一种后解释学的研究方法 ex：基林斯基 媒体考古学 Bernard Stigler 技术的起源： 人与技术的共存关系 Derrida 书写 – 技术 每一种媒体都是毒药同时又提供了一种解药 Mark hansne’s work within meida studies Embodying technesis:Technology Beyond Writinig-focus on postcnostructural(Derrida, Lacan, Deleuze-Guattari) New philosophy for New Media 2004 Borgson perception as subception indeterminism determinism决定论[1] Bodies in Code 2006 Fouces on Maurice argument Feed \bforward 提前获取 计算机科技的计算速度越来越快以至于超越了我们感知范围以外 data capitalism :由我们产生的数据\b不属于我们 传播的偏向 帝国与传播 梅西会议 控制论 #Day3 Image (article) something about Lev Manovich’ The Language of New Media DN Rodowick Virtual life of Film Kittler Grammophon Filme typewrite Kittler bold claim about digital media michell:kittle is wrong hansem:Kittler is right but not for the reason he think alphabetic monopoly(no concept of medium)1800-1839-------&gt;technical media diferentiation(1839相机–1850 留声机–1890电影)-----&gt;digital graph LR; a(alphabetic,1800-1839)-->e(\"technical media\"); e-->d(digital); Key role of time/teaporrality role of Foucault shift from poetry to literature Typewriter DAY4 Jaffrey Shaw vimeo视频 1995年奥地利林茨 作者：Jeffrey Shaw 软件：Adolf Matthias 设备：Huib Nelissen 制作：ZKM艺术与媒体中心，卡尔斯鲁厄[2] Primery retention Secendery retention terthery retention EVE expended virtual environment Day5 ##西蒙东 ####Induiduation 个体化 圣诞节哈萨克 信息存在与个体化之前 graph LR a(information)-->b(Processing--efect by media) b-->c(human) media as mediation of human experience media as a sort of the operationaty of the world 决定论（又称拉普拉斯信条）是一种认为自然界和人类社会普遍存在客观规律和因果联系的理论和学说，其与非决定论相对。心理学中的决定论认为，人的一切活动，都是先前某种原因和几种原因导致的结果，人的行为是可以根据先前的条件、经历来预测的。 量子力学并没有支持自由意志，只是于微观世界物质具有概率波等存在不确定性，不过其依然具有稳定的客观规律，不以人的意志为转移。 ↩︎ 该装置有一个直径9米的圆柱形投影屏幕，中央有一个圆形的机动平台，三台视频投影仪将图像传输到屏幕的120度部分。在屏幕周围连续旋转这个观察窗口可以看到完整的360度计算机生成的场景。虽然工作受到控制，并且通常从屏幕的圆周内观看，路人也可以在其外表面上观看投影图像。这项工作中的用户界面是一个修改后的摄像机。通过旋转此相机并使用其缩放和播放按钮，观看者可控制其在虚拟场景中的前进，后退和旋转运动，以及平台和投影图像在圆形屏幕周围的旋转。投影的景观显示了一个电脑环境，有11个圆柱体，可以在不同地点拍摄全景风景照片，包括澳大利亚，日本，拉帕尔马，巴厘岛，法国和德国。每个虚拟圆柱具有与实际投影屏幕相同的高度和直径，以便当观看者位于全景图像的中心时，它填充屏幕并精确重构原始的360度相机视图。通过这种方式，艺术品将其全景图像放置在一个建筑框架中，该框架将虚拟景观的设计与安装本身的设计相关联，从而使虚拟空间和实际空间在多层次意义上共同活动。这些全景圆柱体放置在地面上，标有希伯利’生命之树’图。每幅全景的位置将其景观的视觉特征与其在图中的符号位置的内涵联系起来。相机界面上的取景器显示了该图的一幅鸟瞰图，该图以观看者在景观中的实际位置动态居中。相机接口顶部的麦克风可拾取观看者制作的任何声音，并控制投影场景中滚动的三维文字的释放。从各种来源引用，这些文本提供了关于地点和语言问题的讨论。虽然字母起源于屏幕中心，但是观看者的运动在组成上决定了他们在虚拟空间中的物理排列。形成每个观众在这部作品中出现的叙述和空间痕迹，他们生成的字母在几分钟后变得越来越透明，直到它们消失。 ↩︎","tags":[{"name":"媒体理论","slug":"媒体理论","permalink":"http://liudixian.github.io/tags/媒体理论/"}],"categories":[]},{"title":"银灰色的风景","date":"2018-11-01T16:02:37.000Z","path":"2018/11/02/landscape/","text":"","tags":[],"categories":[{"name":"未分类","slug":"未分类","permalink":"http://liudixian.github.io/categories/未分类/"}]},{"title":"Mt&t 年终分享","date":"2018-11-01T16:02:22.000Z","path":"2018/11/02/cotom/","text":"2018 年终 会议日程 – Adamy 12.23 活动日程 19：00 - 21：00 活动规则： 19：00 读书会+共享资源库新策划 19：15 读书会书单商议 19：30 共享资源库操作讲解与练习 20：00 刘迪先分享 20：20 罗爽分享 20：40 杨伟光分享 CATwiki 结构 分类： 媒体艺术理论 艺术家 展览 技术媒介 根标签： 读书小组计划 许煜《递归与偶然》(Recursivity and Contingency)（Howard Caygill序, Rowman and Littlefield International, Spring 2019） 千高原 德勒兹 Lyotard_Jean-Francois_The_Postmodern_Condition_A_Report_on_Knowledge Donna J. Haraway-Simians, Cyborgs, and Women_ The Reinvention of Nature-Routledge (1991) Bruno Latour-We Have Never Been Modern-Harvard University Press (1993) (Clarendon Lectures in Management Studies) Bruno Latour-Reassembling the Social_ An Introduction to Actor-Network-Theory-Oxford University Press, USA (2005) Bruno LaTour-Laboratory Life_ The Construction of Scientific Facts-Princeton University Press (1986) The Stack: On Software and Sovereignty. By Benjamin H. Bratton Michel Serres and Bruno Latour-Conversations on Science, Culture, and Time_ Michel Serres with Bruno Latour (Studies in Literature and Science)-University of Michigan Press (1995) Critical Terms for Media Studies|eds. W.J.T Mitchell and Mark B.N Hansen|University of Chicago Press 刘迪先 媒体艺术网络 技术与时间I 思考快与慢 增长的极限 我们从未现代过 The stack GEB George Zarkadakis-In Our Own Image_ Savior or Destroyer_-Pegasus Books (2016) James Bridle-New Dark Age - Technology and the End of the Future Network undersea A prehistory of cloud 主题分享 分享你觉得有价值的东西 20’ 旧书单 https://hackmd.io/jT3qgP4qQgeOQF2IXKpj8Q","tags":[],"categories":[{"name":"未分类","slug":"未分类","permalink":"http://liudixian.github.io/categories/未分类/"}]},{"title":"Listenning","date":"2018-11-01T04:42:51.000Z","path":"2018/11/01/listenning/","text":"听 2018 沉浸式交互现场体验空间 \bV2_ 不稳定媒体实验室 荷兰 鹿特丹","tags":[],"categories":[{"name":"Interactive Art","slug":"Interactive-Art","permalink":"http://liudixian.github.io/categories/Interactive-Art/"}]},{"title":"Zielinski","date":"2018-05-09T16:25:33.000Z","path":"2018/05/10/Zielinski/","text":"2018/5/15 上午-prospective archeology展望式考古学 I Prospective archology – respective archology（回溯的，\b考古学，是传统的考古学） organ projection器官投射 massage 按摩 推拿 the medium is the massage ernst kapp技术哲学先驱 18** ERnst kapp 卡普的《技术哲学纲要》[1] &lt;organ projection: Bonelike crane Kapp 1877&gt; Extelligence Q&amp;A 表演艺术？表演艺术是对电子革命的批评…表演艺术是\b与女性有非常强的关联性对于男性主导的电子文化/艺术的\b相对的面的\b相应反应 延展电影 – 看电影是要满足什么样的欲望？ II 感官的等级与平等 光–积极与消极 积极–德国，北欧 消极–墨家[2](、中国的女性 透镜 墨家 沈括[3] III Deep Time(and its consequencess) deep time 深沉时间 Archaeology 考古学 Genealogy 谱系学 Variantology\b 变体学 deep time conceptine的投射—James Hutton:Theory of earth1795[4] THE MACHINE WITH 2 TIME ARROWS DEEP TIME PICTURE the / Option / Version Bunuel/Dali, Andalousian Dog 1929 [5] 平行蒙太奇 Abu Zayd iba lshaq al-lbadi (808-873) --阿拉伯的眼球解剖 眼睛与脑()的联系 视觉与认识的联系？ music/Sound/Noise Cassetta mathematica Athanasius Kircher 1630s object: Florence 数学-音乐 kischer ““合众为一”（拉丁语：E pluribus unum，英语：Out of Many, One）是美国国徽上的格言之一，出现在国徽的正面。” ----艺术家的任务（。。。） III Generator of Surprise 1: # Expanded Animation 延展动画 glass projection 书籍-翻页动画 ... ... ... 六种模式 to bring liefe to the hard and dry material death as 。。。 … … Animations of dead bodies Computing the physical IIII 声音艺术谱系 符号学理论解释 \b 无端考古学中的声音 为谁调音、调音的机制(技术) 作为社会活动的演奏中，调音变成非常重要的因素 调音在不同地域与文化的deep time分析 毕达哥拉斯的数学理论与调音 通过数学形式的调音归根结底是一个数学与几何学的\b计算问题 比例—上帝完美的调音 弦–连接人与上帝的媒介…angle Macrocosm and microcosm 5/17 基特尔的 来自拉康的思想的发明— 电影、打字机、留声机 《时间/无间》 --李振华！ 深圳动画双年展 catalog 《摄影哲学的思考》 julian murphet 高频算法诗歌 语义，句法排列 david link —poetry mechine \b马尔科夫链 输入法的自动纠错功能 zhihu TAPE-MARK-1-by-Nanni-Balestrini Umberto Eco翁贝托·艾柯用自动纠错的算法来创造诗歌，改变机器本来的用途… # 讨论 算法本来就没什么固定的功能... flusser档案 交互界面要躲在什么之后？ 皮肤-纹身-界面 界面-建筑装潢 界面–烟火与天空 5/18 无端考古学 an-archology 对海德格尔的批判 发明新的档案管理方式 &quot;Surprise Generator&quot;来自分子生物学 档案– 档案的意义发生变化 archive supervison subvision 无端考古学档案馆 无直角的、动态的，有着电子皮肤的-界面 漂浮在空中的，不稳定的三个球状物 瓦尔堡的视觉化资源墙 艺术作品的档案管理 戈达尔的电影史电影 拉康\b 三界 (Ctundlinien einer Philosophie der Technik，1877)，被认为是技术哲学的奠基性著作。该书用了一个副标题“从新观点看文化发生史”，并提出了工具和器物是人体器官投影的核心概念与理论。这表明，卡普试图用器官投影论的新观点，通过作为技术文化的工具发生历程来解释人类文化的演进历史。卡普认为，人体的外形和功能总是作为人类最理解的客观存在，当成创造技术的外形和功能的尺度，投影到外部环境：所有工具的源泉和本原的技术，都是建立在人的器官特别是手的基础之上的。因此，人是制造器物的尺度。他指出：“在工具和器官之间所呈现的那种内在的关系，以及一种将要被揭示和强调的关系——尽管较之于有意识的发明而言，他更多地是一种无意识的发现——就是人通过工具不断地创造自己。因为其效用和力量日益增长的器官是控制的因素，所以一种工具的何时形式只能起源于那种器官。”[2]基于这一理论，卡普对许多器物和工具做了详尽的解释：“这样大量的精神创造物突然从手、臂和牙齿中涌现出来。弯曲的手指变成了一只钩子，手的凹陷成为一只碗；人们从刀、矛、桨、铲、耙、犁和锹等，看到了臂、手和手指的各种各样的姿势，很显然，它们适合于打猎、捕鱼，从园艺，以及耕作。”[3]卡普还强调了器官投影论对工具发展的深远意义：作为器官投影，不仅工具的形状、结构和功能跟人体的器官一样，而且尺寸和数量关系也可以从人体推算出来。他已经预见到人工智能技术了，还暗示出把器官投影论从自然环境的外部转向社会环境的内部开拓。卡普可谓把技术与人体器官关联起来的第一人。 ↩︎ 光学八条) ↩︎ 光学: 沈括通过观察实验，对小孔成像、凹面镜成像等原理作了准确而生动的描述， 透光镜结构示意图 透光镜结构示意图 他用“碍”（焦点）的概念，指出了光的直线传播、凹面镜成像的规律，并把光通过“碍”成像称之为格术，即现代光学中的等角空间变换关系。 沈括还对平面、凹凸面等镜面成像的不同进行研究，注意到表面曲率不同与成像之间的关系，并以此对“古人铸鉴”时正确处理镜面凹凸与成像大小的关系进行了研究与分析，提出若将小平面镜磨凸，就可“全纳人面”。 [77] 沈括还对透光铜镜的原理作出了正确推论，推动了后世对“透光镜”的研究。此外，沈括还第一次记录了“红光验尸”的内容，是中国关于滤光应用的最早记载，至今还有现实意义。 [78] ↩︎ https://en.wikipedia.org/wiki/Theory_of_the_Earth — html book ↩︎ 《安达鲁之犬》，是一部法国16分钟的无声超现实主义短片，由西班牙导演路易斯·布努埃尔执导，路易斯·布努埃尔与著名艺术家萨尔瓦多·达利共同创作。该片于1928年拍摄，是导演路易斯·布努埃尔的处女作。最初影片于1929年在巴黎有限上映，但是不久就广为流传，连续放映了8个月。 —youtube link ↩︎","tags":[],"categories":[]}]}