<!DOCTYPE html>
<html class="has-navbar-fixed-top">
<head><meta name="generator" content="Hexo 3.8.0">
    <meta charset="utf-8">
<title>刘迪先</title>
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">

<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/outdated-browser/1.1.5/outdatedbrowser.min.css">






<meta name="keywords" content="media art and theory">



    <meta name="keywords" content="media art and theory">
<meta property="og:type" content="website">
<meta property="og:title" content="刘迪先">
<meta property="og:url" content="http://liudixian.github.io/page/3/index.html">
<meta property="og:site_name" content="刘迪先">
<meta property="og:locale" content="zh">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="刘迪先">





<link rel="icon" href="/favicon.png">


<link rel="stylesheet" href="//fonts.googleapis.com/css?family=Ovo|Source+Code+Pro">
<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/bulma/0.6.2/css/bulma.min.css">


<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/lightgallery/1.6.8/css/lightgallery.min.css">
<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/justifiedGallery/3.6.5/css/justifiedGallery.min.css">


<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/highlight.js/9.12.0/styles/atom-one-light.min.css">

<link rel="stylesheet" href="/css/style.css">

<script defer src="//use.fontawesome.com/releases/v5.0.8/js/all.js"></script>


    
    
    
    
    
    
    
    
    
    

    


</head>
<body>
    
<nav class="navbar is-transparent is-fixed-top navbar-main" role="navigation" aria-label="main navigation">
    <div class="container">
        <div class="navbar-brand">
            <a class="navbar-item navbar-logo" href="/">
                
                <img src="/images/logo.png" alt="" height="28">
                
            </a>
            <div class="navbar-burger">
                <span></span>
                <span></span>
                <span></span>
            </div>
        </div>
        
        <div class="navbar-menu navbar-start">
            
            <a class="navbar-item " href="/archives">Archives</a>
            
            <a class="navbar-item " href="/categories/媒介理论">媒介理论</a>
            
            <a class="navbar-item " href="/categories/works">Works</a>
            
            <a class="navbar-item " href="/categories/技术">技术</a>
            
            <a class="navbar-item " href="/about">About</a>
            
        </div>
        
        <div class="navbar-menu navbar-end">
            
            <a class="navbar-item search" title="Chercher" href="javascript:;">
                <i class="fas fa-search"></i>
            </a>
            
            
            
            <a class="navbar-item" title="GitHub" href="https://github.com/ppoffice/hexo-theme-minos" rel="external nofollow noopener noreferrer" target="_blank">
                
                <i class="fab fa-github"></i>
                
            </a>
               
            
        </div>
    </div>
</nav>

    <section class="section">
    <div class="container">
    
        <article class="article content gallery" itemscope="" itemprop="blogPost">
    <h1 class="article-title is-size-3 is-size-4-mobile" itemprop="name">
        
            <a href="/2018/11/15/虚构的生态学/" itemprop="url">虚构的生态学</a>
        
    </h1>
    <div class="article-meta columns is-variable is-1 is-multiline is-mobile is-size-7-mobile">
        <span class="column is-narrow">
            <time datetime="2018-11-15T01:10:28.000Z" itemprop="datePublished">11月 15 2018</time>
        </span>
        
        
        <span class="column is-narrow">
            
            
            13 分钟 lire (À propos 2010 mots)
        </span>
        
    </div>
    <div class="article-entry is-size-6-mobile" itemprop="articleBody">
    
        <h5 id="&#x8D44;&#x6E90;&#x7D27;&#x7F3A;&#x7684;&#x81EA;&#x7136;&#x8D44;&#x6E90;&#x73B0;&#x5B9E;"><a href="#&#x8D44;&#x6E90;&#x7D27;&#x7F3A;&#x7684;&#x81EA;&#x7136;&#x8D44;&#x6E90;&#x73B0;&#x5B9E;" class="headerlink" title="&#x8D44;&#x6E90;&#x7D27;&#x7F3A;&#x7684;&#x81EA;&#x7136;&#x8D44;&#x6E90;&#x73B0;&#x5B9E;"></a>&#x8D44;&#x6E90;&#x7D27;&#x7F3A;&#x7684;&#x81EA;&#x7136;&#x8D44;&#x6E90;&#x73B0;&#x5B9E;</h5><p>&#x539F;&#x6807;&#x9898;&#xFF1A;<strong><em>A Fictive Ecology: Natural resource for reource-heavy realities</em></strong></p>
<br>

<p>Eschewing normative definitions pertaining to the bionomics of technology, <em>Ecologies excursion</em> participants select and define key materials with which to construct a new ecology.</p>
<p>&#x907F;&#x514D;&#x4E0E;&#x6280;&#x672F;&#x751F;&#x7269;&#x5B66;&#x6709;&#x5173;&#x7684;&#x89C4;&#x8303;&#x6027;&#x5B9A;&#x4E49;&#xFF0C;<em>&#x751F;&#x6001;&#x6E38;&#x89C8;</em> &#x53C2;&#x4E0E;&#x8005;&#x9009;&#x62E9;&#x548C;&#x5B9A;&#x4E49;&#x6784;&#x5EFA;&#x65B0;&#x751F;&#x6001;&#x5B66;&#x7684;&#x5173;&#x952E;&#x6750;&#x6599;&#x3002;</p>
        <p class="article-more-link">
            <a href="/2018/11/15/虚构的生态学/#more">Lire la Suite</a>
        </p>
    
    </div>
    
    
</article>




    
        <article class="article content gallery" itemscope="" itemprop="blogPost">
    <h1 class="article-title is-size-3 is-size-4-mobile" itemprop="name">
        
            <a href="/2018/11/10/交流，互动和系统/" itemprop="url">系统美学与交互语境</a>
        
    </h1>
    <div class="article-meta columns is-variable is-1 is-multiline is-mobile is-size-7-mobile">
        <span class="column is-narrow">
            <time datetime="2018-11-10T12:24:14.000Z" itemprop="datePublished">11月 10 2018</time>
        </span>
        
        
        <span class="column is-narrow">
            
            
            1 小时 lire (À propos 7529 mots)
        </span>
        
    </div>
    <div class="article-entry is-size-6-mobile" itemprop="articleBody">
    
        <h1 id="Cybernetic-Aesthetics-and-communicative-Context"><a href="#Cybernetic-Aesthetics-and-communicative-Context" class="headerlink" title="Cybernetic Aesthetics and communicative Context"></a>Cybernetic Aesthetics and communicative Context</h1><p><em>Claudia Giannetti</em></p>
<p><a href="http://mediaartnet.org/themes/aesthetics_of_the_digital/aesthetics_and_communicative%20Context/" rel="external nofollow noopener noreferrer" target="_blank">http://mediaartnet.org/themes/aesthetics_of_the_digital/aesthetics_and_communicative%20Context/</a></p>
<h6 id="tags-&#x7FFB;&#x8BD1;"><a href="#tags-&#x7FFB;&#x8BD1;" class="headerlink" title="tags: &#x7FFB;&#x8BD1;"></a>tags: <code>&#x7FFB;&#x8BD1;</code></h6><h3 id="Communication-interaction-and-systems&#x4EA4;&#x6D41;&#xFF0C;&#x4E92;&#x52A8;&#xFF0C;&#x548C;&#x7CFB;&#x7EDF;"><a href="#Communication-interaction-and-systems&#x4EA4;&#x6D41;&#xFF0C;&#x4E92;&#x52A8;&#xFF0C;&#x548C;&#x7CFB;&#x7EDF;" class="headerlink" title="Communication, interaction, and systems&#x4EA4;&#x6D41;&#xFF0C;&#x4E92;&#x52A8;&#xFF0C;&#x548C;&#x7CFB;&#x7EDF;"></a>Communication, interaction, and systems&#x4EA4;&#x6D41;&#xFF0C;&#x4E92;&#x52A8;&#xFF0C;&#x548C;&#x7CFB;&#x7EDF;</h3><ol>
<li>The idea of a scientific analysis of organization systems was first formulated in the early twentieth century by the Russian researcher Alexander Bogdanov. [^1] His system theory, which attempts to register all organization elements in their entirety, introduced the basic concepts of the open system (with reference to living systems) and of feedback, and made Bogdanov a forerunner of cybernetics and of the systemic theories Ludwig von Bertalanffy would develop two decades later. [^2]</li>
</ol>
<p>&#x4FC4;&#x7F57;&#x65AF;&#x7814;&#x7A76;&#x5458;Alexander Bogdanov&#xFF08;&#x4E9A;&#x5386;&#x5C71;&#x5927;&#xB7;&#x6CE2;&#x683C;&#x4E39;&#x8BFA;&#x592B;&#xFF09;&#x5728;&#x4E8C;&#x5341;&#x4E16;&#x7EAA;&#x521D;&#x9996;&#x5148;&#x63D0;&#x51FA;&#x4E86;&#x5BF9;&#x7EC4;&#x7EC7;&#x4F53;&#x7CFB;&#x8FDB;&#x884C;&#x79D1;&#x5B66;&#x5206;&#x6790;&#x7684;&#x6784;&#x60F3;&#x3002; [1]&#x4ED6;&#x7684;&#x7CFB;&#x7EDF;&#x7406;&#x8BBA;&#x8BD5;&#x56FE;&#x5168;&#x90E8;&#x63D0;&#x51FA;&#x6240;&#x6709;&#x7CFB;&#x7EDF;&#x6027;&#x7684;&#x5143;&#x7D20;&#xFF0C;&#x4ECB;&#x7ECD;&#x4E86;&#x5F00;&#x653E;&#x7CFB;&#x7EDF;&#xFF08;&#x53C2;&#x8003;&#x751F;&#x547D;&#x7CFB;&#x7EDF;&#xFF09;&#x548C;&#x53CD;&#x9988;&#x7684;&#x57FA;&#x672C;&#x6982;&#x5FF5;&#xFF0C;&#x5E76;&#x4E14;&#x4F7F;Bogdanov&#xFF08;&#x535A;&#x683C;&#x4E39;&#x8BFA;&#x592B;&#xFF09;&#x5148;&#x5BFC;&#x7684;&#x63A7;&#x5236;&#x8BBA;&#x548C;Ludwig von Bertalanffy&#xFF08;&#x8DEF;&#x5FB7;&#x7EF4;&#x5E0C;&#x51AF;&#x8D1D;&#x5854;&#x6717;&#x83F2;&#xFF09;&#x5148;&#x5BFC;&#x7684;&#x7CFB;&#x7EDF;&#x7406;&#x8BBA;&#x5728;&#x4E8C;&#x5341;&#x5E74;&#x540E;&#x6709;&#x6240;&#x53D1;&#x5C55;&#x3002;</p>
<p>&#x5434;&#x884D;&#x5F6C;</p>
<ol start="2">
<li>The first comprehensive contribution to the understanding and dissemination of the theory of self-organization was the result of the research carried out by the physicist and cyberneticist Heinz von Foerster from the late 1950s on, and especially after the publication of his treatise &#xAB;On Self- Organizing Systems and their Environment&#xBB; of 1960. Heinz von Foerster was well acquainted with cybernetics and information theory, and likewise with the basics of Artificial Intelligence (A. Turing and J. von Neumann) and system theory (P. Weiss and L. von Bertalanffy). Taking these theories as his starting point, heproposed that concepts such as those of redundancy, entropy or information (cybernetics) as well as those of self-regulation, autonomy and hierarchic order (system theory) be applied in the examination of organization. As Foerster saw it, every system exists autonomously&#x2014;according to its own laws&#x2014;and is organizationally self-contained, meaning its organization is selfreferential, self-maintaining, and recursive. He understood reality to be an interactive construction in which the observer and what is observed are two interdependent sub-aspects. In consequence, objectivity exists merely as an illusion on the part of the subject, even without whom a perception could exist independently. This implies that perception takes place by means of a linkage of observer and system unit, and namely in the domain in which this unit operates. In the 1970s and 1980s the basic concepts of system research, which relate to interaction, self-organization, co-evolution, or the environment, were further developed by a number of scientists, and translated into new theories. [^3] System theory received an important impetus from the theory of &#xAB;autopoiesis&#xBB; [^4] developed from the 1970s onward by the Chilean biologist Humberto together with the neuroscientist Francisco J. Varela. This theory linked for the first time two areas until then studied only separately: biology, or the theory of the organization of living organisms, and cognitive theory, which is particularly concerned with the problem of the cognition and perception of phenomena. In 1969 Maturana drew up the thesis according to which the nervous system is a closed system. [^5]</li>
</ol>
<p>&#x5BF9;&#x81EA;&#x7EC4;&#x7EC7;&#x7406;&#x8BBA;&#x7684;&#x7406;&#x89E3;&#x548C;&#x4F20;&#x64AD;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x5168;&#x9762;&#x8D21;&#x732E;&#x662F;&#x7269;&#x7406;&#x5B66;&#x5BB6;&#x548C;&#x63A7;&#x5236;&#x8BBA;&#x5BB6;Heinz von Foerster&#x4ECE;20&#x4E16;&#x7EAA;50&#x5E74;&#x4EE3;&#x540E;&#x671F;&#x5F00;&#x59CB;&#xFF0C;&#x7279;&#x522B;&#x662F;&#x5728;&#x4ED6;&#x7684;&#x8BBA;&#x6587;&#xAB;On Self- Organizing Systems and their Environment&#xBB;&#xFF08;&#xAB;&#x8BBA;&#x81EA;&#x7EC4;&#x7EC7;&#x7CFB;&#x7EDF;&#x53CA;&#x5176;&#x73AF;&#x5883;&#xBB; &#xFF09;&#x5728;1960&#x5E74;&#x51FA;&#x7248;&#x4E4B;&#x540E;&#xFF0C;Heinz von Foerster&#x638C;&#x63E1;&#x63A7;&#x5236;&#x8BBA;&#x548C;&#x4FE1;&#x606F;&#x8BBA;&#xFF0C;&#x540C;&#x6837;&#x638C;&#x63E1;&#x4EBA;&#x5DE5;&#x667A;&#x80FD;&#xFF08;A. Turing&#x548C;J. von Neumann&#xFF09;&#x548C;&#x7CFB;&#x7EDF;&#x8BBA;&#xFF08;P. Weiss&#x548C;L. von Bertalanffy&#xFF09;&#x7684;&#x57FA;&#x7840;&#x77E5;&#x8BC6;&#x3002; &#x4EE5;&#x8FD9;&#x4E9B;&#x7406;&#x8BBA;&#x4E3A;&#x51FA;&#x53D1;&#x70B9;&#xFF0C;&#x4ED6;&#x63D0;&#x51FA;&#x5197;&#x4F59;&#xFF0C;&#x71B5;&#x6216;&#x4FE1;&#x606F;&#xFF08;&#x63A7;&#x5236;&#x8BBA;&#xFF09;&#x4EE5;&#x53CA;&#x81EA;&#x6211;&#x8C03;&#x8282;&#xFF0C;&#x81EA;&#x6CBB;&#x548C;&#x7B49;&#x7EA7;&#x79E9;&#x5E8F;&#xFF08;&#x7CFB;&#x7EDF;&#x8BBA;&#xFF09;&#x7B49;&#x6982;&#x5FF5;&#x5E94;&#x7528;&#x4E8E;&#x7CFB;&#x7EDF;&#x6027;&#x7684;&#x8003;&#x5BDF;&#x3002;&#x6B63;&#x5982;Foerster&#x6240;&#x770B;&#x5230;&#x7684;&#x90A3;&#x6837;&#xFF0C;&#x6BCF;&#x4E2A;&#x7CFB;&#x7EDF;&#x90FD;&#x662F;&#x6839;&#x636E;&#x81EA;&#x5DF1;&#x7684;&#x89C4;&#x5F8B;&#x81EA;&#x6CBB;&#x5730;&#x5B58;&#x5728;&#x7684;&#xFF0C;&#x5E76;&#x4E14;&#x5728;&#x7EC4;&#x7EC7;&#x4E0A;&#x662F;&#x72EC;&#x7ACB;&#x7684;&#xFF0C;&#x610F;&#x5473;&#x7740;&#x5B83;&#x7684;&#x7EC4;&#x7EC7;&#x662F;&#x81EA;&#x6211;&#x6307;&#x6D89;&#x7684;&#xFF0C;&#x81EA;&#x6211;&#x7EF4;&#x62A4;&#x7684;&#x548C;&#x9012;&#x5F52;&#x7684;&#x3002; &#x4ED6;&#x5C06;&#x73B0;&#x5B9E;&#x7406;&#x89E3;&#x4E3A;&#x4E00;&#x79CD;&#x4EA4;&#x4E92;&#x5F0F;&#x7684;&#x6784;&#x9020;&#xFF0C;&#x5176;&#x4E2D;&#x89C2;&#x5BDF;&#x8005;&#x548C;&#x6240;&#x89C2;&#x5BDF;&#x5230;&#x7684;&#x662F;&#x4E24;&#x4E2A;&#x76F8;&#x4E92;&#x4F9D;&#x8D56;&#x7684;&#x5B50;&#x65B9;&#x9762;&#xFF08;sub-aspects&#xFF09;&#x3002; &#x7ED3;&#x679C;&#xFF0C;&#x5BA2;&#x89C2;&#x5B58;&#x5728;&#x4EC5;&#x4EC5;&#x662F;&#x4F5C;&#x4E3A;&#x4E3B;&#x4F53;&#x65B9;&#x9762;&#x7684;&#x5E7B;&#x60F3;&#xFF0C;&#x5373;&#x4F7F;&#x4EBA;&#x7684;&#x611F;&#x89C9;&#x662F;&#x6CA1;&#x6709;&#x529E;&#x6CD5;&#x72EC;&#x7ACB;&#x5B58;&#x5728;&#x7684;&#x3002; &#x8FD9;&#x610F;&#x5473;&#x7740;&#x611F;&#x77E5;&#x901A;&#x8FC7;&#x89C2;&#x5BDF;&#x8005;&#x548C;&#x7CFB;&#x7EDF;&#x5355;&#x5143;&#x7684;&#x8054;&#x7CFB;&#x53D1;&#x751F;&#xFF0C;&#x5373;&#x5728;&#x8BE5;&#x5355;&#x5143;&#x8FD0;&#x4F5C;&#x7684;&#x9886;&#x57DF;&#x4E4B;&#x95F4;&#x53D1;&#x751F;&#x3002;&#x5728;20&#x4E16;&#x7EAA;70&#x5E74;&#x4EE3;&#x548C;80&#x5E74;&#x4EE3;&#xFF0C;&#x4E0E;&#x76F8;&#x4E92;&#x4F5C;&#x7528;&#xFF0C;&#x81EA;&#x7EC4;&#x7EC7;&#xFF0C;&#x5171;&#x540C;&#x8FDB;&#x5316;&#x6216;&#x73AF;&#x5883;&#x76F8;&#x5173;&#x7684;&#x7CFB;&#x7EDF;&#x7814;&#x7A76;&#x7684;&#x57FA;&#x672C;&#x6982;&#x5FF5;&#xFF0C;&#x7531;&#x8BB8;&#x591A;&#x79D1;&#x5B66;&#x5BB6;&#x8FDB;&#x4E00;&#x6B65;&#x53D1;&#x5C55;&#xFF0C;&#x5E76;&#x8F6C;&#x5316;&#x4E3A;&#x65B0;&#x7684;&#x7406;&#x8BBA;&#x3002; [3]&#x7CFB;&#x7EDF;&#x7406;&#x8BBA;&#x53D7;&#x5230;&#x4E86;&#x667A;&#x5229;&#x751F;&#x7269;&#x5B66;&#x5BB6;Humberto&#xFF08;&#x6E29;&#x8D1D;&#x6258;&#xFF09;&#x4E0E;&#x795E;&#x7ECF;&#x79D1;&#x5B66;&#x5BB6;Francisco J. Varela&#xFF08;&#x5F17;&#x6717;&#x897F;&#x65AF;&#x79D1;&#x74E6;&#x96F7;&#x62C9;&#xFF09;&#x4E00;&#x8D77;&#x4ECE;20&#x4E16;&#x7EAA;70&#x5E74;&#x4EE3;&#x53D1;&#x5C55;&#x8D77;&#x6765;&#x7684;&#x201C;autopoiesis&#x201D;&#xFF08;&#x201C;&#x81EA;&#x521B;&#x751F;&#x6210;&#x201D;&#xFF09;&#x7406;&#x8BBA;&#x7684;&#x91CD;&#x8981;&#x63A8;&#x52A8;&#x3002; &#x8FD9;&#x4E2A;&#x7406;&#x8BBA;&#x7B2C;&#x4E00;&#x6B21;&#x628A;&#x4E24;&#x4E2A;&#x9886;&#x57DF;&#x8054;&#x7CFB;&#x8D77;&#x6765;&#xFF0C;&#x76F4;&#x5230;&#x90A3;&#x65F6;&#x624D;&#x5206;&#x522B;&#x7814;&#x7A76;&#xFF1A;&#x751F;&#x7269;&#x5B66;&#x6216;&#x751F;&#x7269;&#x7EC4;&#x7EC7;&#x7406;&#x8BBA;&#xFF0C;&#x8BA4;&#x77E5;&#x7406;&#x8BBA;&#xFF0C;&#x7279;&#x522B;&#x5173;&#x6CE8;&#x73B0;&#x8C61;&#x7684;&#x8BA4;&#x77E5;&#x548C;&#x611F;&#x77E5;&#x95EE;&#x9898;&#x3002; 1969&#x5E74;&#xFF0C;&#x9A6C;&#x56FE;&#x62C9;&#x7EB3;&#x64B0;&#x5199;&#x4E86;&#x4E00;&#x7BC7;&#x8BBA;&#x6587;&#xFF0C;&#x8BBA;&#x8FF0;&#x4E86;&#x795E;&#x7ECF;&#x7CFB;&#x7EDF;&#x662F;&#x4E00;&#x4E2A;&#x5C01;&#x95ED;&#x7684;&#x7CFB;&#x7EDF;&#x3002;[5]</p>
<ol start="3">
<li><p>According to this thesis, living systems are autopoietic. [^6] An autopoietic system operates as a closed system that generates only states of autopoiesis. The most important consequence of an autopoietic organization consists in the fact that everything occurring within the system is subjected to autopoiesis; otherwise the living system would collapse, because changes in the state of the organism and of the nervous system as well as of the medium act reciprocally, and so give rise to continuous autopoiesis. That means that living systems are determined by their structure (&#xAB;structure-specified&#xBB;), and that autopoiesis represents their constitutive attribute. The expansion of the cognitive processes(action and interaction) by the nervous system enables, according to Maturana, non-physical interactions between organisms in simple relationships&#x2014;and therefore communication. [^7]<br>&#x6839;&#x636E;&#x8FD9;&#x7BC7;&#x8BBA;&#x6587;&#xFF0C;&#x751F;&#x547D;&#x7CFB;&#x7EDF;&#x662F;&#x81EA;&#x751F;&#x7684;&#x3002; [^ 6]&#x4E00;&#x4E2A;&#x81EA;&#x521B;&#x751F;&#x7CFB;&#x7EDF;&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x53EA;&#x4EA7;&#x751F;&#x81EA;&#x52A8;&#x751F;&#x6210;&#x72B6;&#x6001;&#x7684;&#x5C01;&#x95ED;&#x7CFB;&#x7EDF;&#x8FD0;&#x884C;&#x3002; &#x4E00;&#x4E2A;&#x81EA;&#x521B;&#x751F;&#x7EC4;&#x7EC7;&#x7684;&#x6700;&#x91CD;&#x8981;&#x7684;&#x540E;&#x679C;&#x5728;&#x4E8E;&#xFF0C;&#x7CFB;&#x7EDF;&#x5185;&#x53D1;&#x751F;&#x7684;&#x6240;&#x6709;&#x4E8B;&#x60C5;&#x90FD;&#x4F1A;&#x53D7;&#x5230;&#x81EA;&#x52A8;&#x751F;&#x6210;&#x7684;&#x5F71;&#x54CD;; &#x5426;&#x5219;&#x751F;&#x547D;&#x7CFB;&#x7EDF;&#x5C31;&#x4F1A;&#x5D29;&#x6E83;&#xFF0C;&#x56E0;&#x4E3A;&#x751F;&#x7269;&#x4F53;&#x548C;&#x795E;&#x7ECF;&#x7CFB;&#x7EDF;&#x4EE5;&#x53CA;&#x5A92;&#x4F53;&#x72B6;&#x6001;&#x7684;&#x53D8;&#x5316;&#x4F1A;&#x76F8;&#x4E92;&#x4F5C;&#x7528;&#xFF0C;&#x4ECE;&#x800C;&#x5BFC;&#x81F4;&#x4E0D;&#x65AD;&#x7684;&#x81EA;&#x6211;&#x521B;&#x751F;&#x3002; &#x8FD9;&#x610F;&#x5473;&#x7740;&#x751F;&#x547D;&#x7CFB;&#x7EDF;&#x662F;&#x7531;&#x5B83;&#x4EEC;&#x7684;&#x7ED3;&#x6784;&#x51B3;&#x5B9A;&#x7684;&#xFF08;&#x201C;&#x7ED3;&#x6784;&#x6307;&#x5B9A;&#x201D;&#xFF09;&#xFF0C;&#x5E76;&#x4E14;&#x81EA;&#x751F;&#x6210;&#x4EE3;&#x8868;&#x4E86;&#x5B83;&#x4EEC;&#x7684;&#x6784;&#x6210;&#x5C5E;&#x6027;&#x3002; &#x6839;&#x636E;Maturana&#x7684;&#x89C2;&#x70B9;&#xFF0C;&#x795E;&#x7ECF;&#x7CFB;&#x7EDF;&#x7684;&#x8BA4;&#x77E5;&#x8FC7;&#x7A0B;&#xFF08;&#x884C;&#x4E3A;&#x548C;&#x76F8;&#x4E92;&#x4F5C;&#x7528;&#xFF09;&#x7684;&#x6269;&#x5C55;&#x4F7F;&#x5F97;&#x7B80;&#x5355;&#x5173;&#x7CFB;&#x4E2D;&#x7684;&#x751F;&#x7269;&#x4F53;&#x4E4B;&#x95F4;&#x7684;&#x975E;&#x7269;&#x7406;&#x76F8;&#x4E92;&#x4F5C;&#x7528;&#x6210;&#x4E3A;&#x53EF;&#x80FD;&#xFF0C;&#x4ECE;&#x800C;&#x4FC3;&#x8FDB;&#x4E86;&#x6C9F;&#x901A;&#x3002;[^7]</p>
</li>
<li><p>These non-physical interactions distinguish human beings from organisms that lack a nervous system and in which interactions are purely physical in nature (as in the case of a plant, for example, where the reception of a photon triggers photosynthesis). Communication as interaction is a component of the system, and as a cognitive process does not refer to an autonomous external reality, but is&#x2014;according to Maturana&#x2014;a process of behavioral coordination between the observers through structural coupling. In this way, the cognitive domain is characterized by consensual coordinations of actions that enable operations to take place in many different cognitive domains constituting different realization modes of autopoiesis. [^8]<br>&#x8FD9;&#x4E9B;&#x975E;&#x7269;&#x7406;&#x7684;&#x76F8;&#x4E92;&#x4F5C;&#x7528;&#x5C06;&#x4EBA;&#x7C7B;&#x4E0E;&#x7F3A;&#x4E4F;&#x795E;&#x7ECF;&#x7CFB;&#x7EDF;&#x7684;&#x751F;&#x7269;&#x533A;&#x5206;&#x5F00;&#x6765;&#xFF0C;&#x5E76;&#x4E14;&#x5176;&#x4E2D;&#x76F8;&#x4E92;&#x4F5C;&#x7528;&#x7EAF;&#x7CB9;&#x662F;&#x7269;&#x7406;&#x6027;&#x8D28;&#x7684;&#xFF08;&#x4F8B;&#x5982;&#x690D;&#x7269;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4F8B;&#x5982;&#xFF0C;&#x63A5;&#x6536;&#x5149;&#x5B50;&#x89E6;&#x53D1;&#x5149;&#x5408;&#x4F5C;&#x7528;&#xFF09;&#x3002; &#x4EA4;&#x6D41;&#x4F5C;&#x4E3A;&#x4EA4;&#x4E92;&#x4F5C;&#x7528;&#x662F;&#x7CFB;&#x7EDF;&#x7684;&#x4E00;&#x4E2A;&#x7EC4;&#x6210;&#x90E8;&#x5206;&#xFF0C;&#x800C;&#x8BA4;&#x77E5;&#x8FC7;&#x7A0B;&#x5E76;&#x4E0D;&#x662F;&#x6307;&#x81EA;&#x4E3B;&#x7684;&#x5916;&#x90E8;&#x73B0;&#x5B9E;&#xFF0C;&#x800C;&#x662F; - &#x6839;&#x636E;Maturana - &#x901A;&#x8FC7;&#x7ED3;&#x6784;&#x8026;&#x5408;&#x89C2;&#x5BDF;&#x8005;&#x4E4B;&#x95F4;&#x7684;&#x884C;&#x4E3A;&#x534F;&#x8C03;&#x8FC7;&#x7A0B;&#x3002; &#x901A;&#x8FC7;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#xFF0C;&#x8BA4;&#x77E5;&#x9886;&#x57DF;&#x7684;&#x7279;&#x70B9;&#x662F;&#x534F;&#x8C03;&#x4E00;&#x81F4;&#x7684;&#x884C;&#x4E3A;&#xFF0C;&#x4F7F;&#x884C;&#x52A8;&#x80FD;&#x591F;&#x53D1;&#x751F;&#x5728;&#x6784;&#x6210;&#x81EA;&#x521B;&#x751F;&#x7684;&#x4E0D;&#x540C;&#x5B9E;&#x73B0;&#x6A21;&#x5F0F;&#x7684;&#x8BB8;&#x591A;&#x4E0D;&#x540C;&#x8BA4;&#x77E5;&#x9886;&#x57DF;&#x4E2D;&#x3002;</p>
</li>
<li><p>If one speaks of a &#x2039;world&#x203A; or of &#x2039;our culture,&#x203A; then one would seem to be referring to something external, something independent of humanity, or to &#x2039;an&#x203A; objective reality. Contradicting this view, Constructivist theory holds that an organism creates its world on the basis of its physiological and functional constitution. As Maturana surmises: we create the world by perceiving it.<br>&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x4EBA;&#x8C08;&#x5230;&#x4E00;&#x4E2A;&lt;&#x4E16;&#x754C;&gt;&#x6216;&lt;&#x6211;&#x4EEC;&#x7684;&#x6587;&#x5316;&gt;&#xFF0C;&#x90A3;&#x4E48;&#x4EBA;&#x4EEC;&#x4F3C;&#x4E4E;&#x6307;&#x7684;&#x662F;&#x67D0;&#x79CD;&#x5916;&#x5728;&#x7684;&#xFF0C;&#x72EC;&#x7ACB;&#x4E8E;&#x4EBA;&#x7C7B;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x6216;&#x8005;&#x662F;&#x5BA2;&#x89C2;&#x7684;&#x73B0;&#x5B9E;&#x3002; &#x4E0E;&#x5EFA;&#x6784;&#x4E3B;&#x4E49;&#x7406;&#x8BBA;&#x76F8;&#x53CD;&#x7684;&#x662F;&#xFF0C;&#x5EFA;&#x6784;&#x4E3B;&#x4E49;&#x7406;&#x8BBA;&#x8BA4;&#x4E3A;&#xFF0C;&#x6709;&#x673A;&#x4F53;&#x4EE5;&#x5176;&#x751F;&#x7406;&#x548C;&#x529F;&#x80FD;&#x7ED3;&#x6784;&#x4E3A;&#x57FA;&#x7840;&#x521B;&#x9020;&#x4E86;&#x5B83;&#x7684;&#x4E16;&#x754C;&#x3002; &#x6B63;&#x5982;Maturana&#x6240;&#x731C;&#x6D4B;&#x7684;&#x90A3;&#x6837;&#xFF1A;&#x6211;&#x4EEC;&#x901A;&#x8FC7;&#x611F;&#x77E5;&#x521B;&#x9020;&#x4E16;&#x754C;&#x3002;</p>
</li>
<li><p>Accordingly, three basic conclusions can be formulated from the systemtheoretic perspective. First, it is not permissible to allocate the cognitive phenomena, including language and communication, to any connotative or denotative function of reality which is independent of the observer; second, that which is produced by cultures is the result of interactions between living systems, as well as between living systems and their specific environment (or &#xAB;niche,&#xBB; as Maturana calls it); and, third, neither cultures nor the results, such as art, of creative operations emerge as &#x2039;independent&#x203A; attributes or objective and autonomous realities, but are always dependent on the observer, i.e. on the cognitive system. Therefore they are attributes of the consensual domain in which living systems operate. Only over context- and observer-dependency is it even possible to explain to human perception and cognition the operationality of cognition. [^9] If this finding is transferred to art, then one could join Werner Heisenberg in saying that whatone views is not the work itself, but the work while being exposed to a particular mode of observation.<br>&#x56E0;&#x6B64;&#xFF0C;&#x4ECE;&#x7CFB;&#x7EDF;&#x7406;&#x8BBA;&#x7684;&#x89D2;&#x5EA6;&#x51FA;&#x53D1;&#x53EF;&#x4EE5;&#x5F97;&#x51FA;&#x4E09;&#x4E2A;&#x57FA;&#x672C;&#x7ED3;&#x8BBA;&#x3002;&#x9996;&#x5148;&#xFF0C;&#x4E0D;&#x5141;&#x8BB8;&#x5C06;&#x5305;&#x62EC;&#x8BED;&#x8A00;&#x548C;&#x4EA4;&#x6D41;&#x5728;&#x5185;&#x7684;&#x8BA4;&#x77E5;&#x73B0;&#x8C61;&#x5206;&#x914D;&#x7ED9;&#x4E0E;&#x89C2;&#x5BDF;&#x8005;&#x65E0;&#x5173;&#x7684;&#x4EFB;&#x4F55;&#x5185;&#x9690;&#x6216;&#x5916;&#x5EF6;&#x7684;&#x73B0;&#x5B9E;&#x529F;&#x80FD;;&#x5176;&#x6B21;&#xFF0C;&#x7531;&#x6587;&#x5316;&#x4EA7;&#x751F;&#x7684;&#x4E1C;&#x897F;&#x662F;&#x751F;&#x547D;&#x7CFB;&#x7EDF;&#x4E4B;&#x95F4;&#x4EE5;&#x53CA;&#x751F;&#x547D;&#x7CFB;&#x7EDF;&#x4E0E;&#x5176;&#x7279;&#x5B9A;&#x73AF;&#x5883;&#x4E4B;&#x95F4;&#x76F8;&#x4E92;&#x4F5C;&#x7528;&#x7684;&#x7ED3;&#x679C;&#xFF08;&#x6216;Maturana&#x79F0;&#x4E4B;&#x4E3A;&#x201C;niche&#x201D;&#xFF09;;&#x7B2C;&#x4E09;&#xFF0C;&#x521B;&#x9020;&#x6027;&#x64CD;&#x4F5C;&#x7684;&#x6587;&#x5316;&#x548C;&#x7ED3;&#x679C;&#xFF08;&#x5982;&#x827A;&#x672F;&#xFF09;&#x65E2;&#x4E0D;&#x662F;&#x72EC;&#x7ACB;&#x7684;&#xFF0C;&#x4E5F;&#x4E0D;&#x662F;&#x5BA2;&#x89C2;&#x7684;&#xFF0C;&#x81EA;&#x4E3B;&#x7684;&#x73B0;&#x5B9E;&#xFF0C;&#x800C;&#x662F;&#x59CB;&#x7EC8;&#x4F9D;&#x8D56;&#x4E8E;&#x89C2;&#x5BDF;&#x8005;&#xFF0C;&#x5373;&#x8BA4;&#x77E5;&#x7CFB;&#x7EDF;&#x3002;&#x56E0;&#x6B64;&#x5B83;&#x4EEC;&#x662F;&#x751F;&#x547D;&#x7CFB;&#x7EDF;&#x8FD0;&#x884C;&#x7684;&#x5171;&#x8BC6;&#x9886;&#x57DF;&#x7684;&#x5C5E;&#x6027;&#x3002;&#x53EA;&#x6709;&#x5728;&#x60C5;&#x5883;&#x548C;&#x89C2;&#x5BDF;&#x8005;&#x4F9D;&#x8D56;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x624D;&#x6709;&#x53EF;&#x80FD;&#x5411;&#x4EBA;&#x7C7B;&#x8BA4;&#x77E5;&#x548C;&#x8BA4;&#x77E5;&#x89E3;&#x91CA;&#x8BA4;&#x77E5;&#x7684;&#x64CD;&#x4F5C;&#x6027;&#x3002;&#x5982;&#x679C;&#x8FD9;&#x4E00;&#x53D1;&#x73B0;&#x8F6C;&#x79FB;&#x5230;&#x827A;&#x672F;&#x4E0A;&#xFF0C;&#x90A3;&#x4E48;&#x4EBA;&#x4EEC;&#x53EF;&#x4EE5;&#x52A0;&#x5165;&#x7EF4;&#x5C14;&#x7EB3;&#x6D77;&#x68EE;&#x5821;&#x7684;&#x89C2;&#x70B9;&#xFF0C;&#x5373;&#x4EFB;&#x4F55;&#x4EBA;&#x7684;&#x89C2;&#x70B9;&#x4E0D;&#x662F;&#x4F5C;&#x54C1;&#x672C;&#x8EAB;&#xFF0C;&#x800C;&#x662F;&#x4F5C;&#x54C1;&#x5728;&#x63A5;&#x89E6;&#x67D0;&#x79CD;&#x7279;&#x5B9A;&#x7684;&#x89C2;&#x5BDF;&#x6A21;&#x5F0F;&#x65F6;&#x3002;</p>
</li>
<li><p>Ken Rinaldo&#x2019;s A-life installation &#xAB;Autopoiesis&#xBB; (2000) is an example of the application of organization parameters to interactive art. It assigns an important role to the environment and to the observers, since both intervene in the individual or collective behavior of the robots, as if the latter were biological beings. Rinaldo creates two organizational levels in the interactive installation: an internal process of organization generated by the communicative reciprocal relationship among the robots and independent of the environment; and a system of organization that is based on the intelligent sensors employed and heightens the data-processing capacity by registering the presence of foreign elements and immediately generating feedback. Thus, by means of the technological simulation of artificial life, his work experiments with &#x2039;organic&#x203A; autopoietic mechanisms, and underscores the interdependence of the machines, the function of the viewer, and the close relationship to the environment.<br>Ken Rinaldo&#x7684;A-life&#x88C5;&#x7F6E;&#xAB;Autopoiesis&#xBB;&#xFF08;2000&#xFF09;&#x662F;&#x7EC4;&#x7EC7;&#x53C2;&#x6570;&#x5E94;&#x7528;&#x4E8E;&#x4E92;&#x52A8;&#x827A;&#x672F;&#x7684;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#x3002;&#x5B83;&#x8D4B;&#x4E88;&#x73AF;&#x5883;&#x548C;&#x89C2;&#x5BDF;&#x8005;&#x4E00;&#x4E2A;&#x91CD;&#x8981;&#x7684;&#x89D2;&#x8272;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x90FD;&#x4ECB;&#x5165;&#x673A;&#x5668;&#x4EBA;&#x7684;&#x4E2A;&#x4EBA;&#x6216;&#x96C6;&#x4F53;&#x884C;&#x4E3A;&#xFF0C;&#x5C31;&#x597D;&#x50CF;&#x540E;&#x8005;&#x662F;&#x751F;&#x7269;&#x4E00;&#x6837;&#x3002;&#x91CC;&#x7EB3;&#x5C14;&#x591A;&#x5728;&#x4EA4;&#x4E92;&#x5F0F;&#x5B89;&#x88C5;&#x4E2D;&#x521B;&#x5EFA;&#x4E86;&#x4E24;&#x4E2A;&#x7EC4;&#x7EC7;&#x7EA7;&#x522B;&#xFF1A;&#x4E00;&#x4E2A;&#x7531;&#x673A;&#x5668;&#x4EBA;&#x4E4B;&#x95F4;&#x7684;&#x4EA4;&#x4E92;&#x6027;&#x76F8;&#x4E92;&#x5173;&#x7CFB;&#x4EA7;&#x751F;&#x7684;&#x72EC;&#x7ACB;&#x4E8E;&#x73AF;&#x5883;&#x7684;&#x7EC4;&#x7EC7;&#x5185;&#x90E8;&#x8FC7;&#x7A0B;;&#x4EE5;&#x53CA;&#x57FA;&#x4E8E;&#x6240;&#x4F7F;&#x7528;&#x7684;&#x667A;&#x80FD;&#x4F20;&#x611F;&#x5668;&#x7684;&#x7EC4;&#x7EC7;&#x7CFB;&#x7EDF;&#xFF0C;&#x5E76;&#x901A;&#x8FC7;&#x6CE8;&#x518C;&#x5916;&#x6765;&#x5143;&#x7D20;&#x7684;&#x5B58;&#x5728;&#x5E76;&#x7ACB;&#x5373;&#x751F;&#x6210;&#x53CD;&#x9988;&#x6765;&#x63D0;&#x9AD8;&#x6570;&#x636E;&#x5904;&#x7406;&#x80FD;&#x529B;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x901A;&#x8FC7;&#x5BF9;&#x4EBA;&#x9020;&#x751F;&#x547D;&#x7684;&#x6280;&#x672F;&#x6A21;&#x62DF;&#xFF0C;&#x4ED6;&#x7684;&#x4F5C;&#x54C1;&#x5C1D;&#x8BD5;&#x4E86;&lt;&#x6709;&#x673A;&gt;&#x81EA;&#x52A8;&#x751F;&#x6210;&#x673A;&#x5236;&#xFF0C;&#x5E76;&#x5F3A;&#x8C03;&#x4E86;&#x673A;&#x5668;&#x7684;&#x76F8;&#x4E92;&#x4F9D;&#x8D56;&#x6027;&#xFF0C;&#x89C2;&#x4F17;&#x7684;&#x529F;&#x80FD;&#x4EE5;&#x53CA;&#x4E0E;&#x73AF;&#x5883;&#x7684;&#x5BC6;&#x5207;&#x5173;&#x7CFB;&#x3002;</p>
<div class="video-container"><iframe src="//www.youtube.com/embed/3w53KboB-00" frameborder="0" allowfullscreen></iframe></div>
<p style="text-align:center">&#xAB;Autopoiesis&#xBB;&#xFF08;2000&#xFF09;</p>
</li>
<li><p>Maturana and Varela&#x2019;s model of autopoeisis roused controversy at the same time as they stimulated new approaches to problems of cognitive research. Together with the contributions of Heinz von Foerster and, in the area of cognitive psychology, of Ernst von Glasersfeld, the model delivered impulses for a new current known as Constructivism or Radical Constructivism. This mode of thought is decisive insofar as it negates any possibility of being able to understand systems by means of analytic and reductionist methods, since it acknowledges the principle of self-organization to be fundamental. Man is part of a world of his own construction, and his life depends on the interactions formed by this interlocking system, or network.<br>This model, however, aims to avoid tendencies toward an orthodox Constructivist attitude. The risk of research concentrating on internal and autopoietic processes of neuronal organization consists largely in the fact that their model conception refers to a closed apparatus with no knowledge of the external. The brain can be viewed as an operational, self-referential system in the sense of a purely internal function; in the cognitive system, however, interior and exterior (environment) are interrelated. Theacquisition of knowledge, education and culture is dependent on individual experiences of life.<br>Maturana&#x548C;Varela&#x7684;autopoeisis&#x6A21;&#x578B;&#x5728;&#x6FC0;&#x53D1;&#x5BF9;&#x8BA4;&#x77E5;&#x7814;&#x7A76;&#x95EE;&#x9898;&#x7684;&#x65B0;&#x65B9;&#x6CD5;&#x7684;&#x540C;&#x65F6;&#x6FC0;&#x8D77;&#x4E86;&#x4E89;&#x8BAE;&#x3002;&#x52A0;&#x4E0A;Heinz von Foerster&#x7684;&#x8D21;&#x732E;&#xFF0C;&#x4EE5;&#x53CA;&#x5728;&#x8BA4;&#x77E5;&#x5FC3;&#x7406;&#x5B66;&#x65B9;&#x9762;&#xFF0C;Ernst von Glasersfeld&#x7684;&#x8D21;&#x732E;&#xFF0C;&#x8BE5;&#x6A21;&#x578B;&#x63A8;&#x52A8;&#x4E86;&#x4E00;&#x79CD;&#x79F0;&#x4E3A;&#x5EFA;&#x6784;&#x4E3B;&#x4E49;&#x6216;&#x6FC0;&#x8FDB;&#x5EFA;&#x6784;&#x4E3B;&#x4E49;&#x7684;&#x65B0;&#x6F6E;&#x6D41;&#x3002;&#x8FD9;&#x79CD;&#x601D;&#x7EF4;&#x65B9;&#x5F0F;&#x662F;&#x51B3;&#x5B9A;&#x6027;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x627F;&#x8BA4;&#x81EA;&#x7EC4;&#x7EC7;&#x7684;&#x57FA;&#x672C;&#x539F;&#x5219;&#x662F;&#x5426;&#x80FD;&#x901A;&#x8FC7;&#x5206;&#x6790;&#x548C;&#x8FD8;&#x539F;&#x65B9;&#x6CD5;&#x6765;&#x7406;&#x89E3;&#x7CFB;&#x7EDF;&#x3002;&#x4EBA;&#x662F;&#x4ED6;&#x81EA;&#x5DF1;&#x5EFA;&#x6784;&#x7684;&#x4E16;&#x754C;&#x7684;&#x4E00;&#x90E8;&#x5206;&#xFF0C;&#x4ED6;&#x7684;&#x751F;&#x6D3B;&#x53D6;&#x51B3;&#x4E8E;&#x8FD9;&#x4E2A;&#x4E92;&#x76F8;&#x8FDE;&#x9501;&#x7684;&#x7CFB;&#x7EDF;&#x6216;&#x7F51;&#x7EDC;&#x6240;&#x5F62;&#x6210;&#x7684;&#x76F8;&#x4E92;&#x4F5C;&#x7528;&#x3002;<br>&#x7136;&#x800C;&#xFF0C;&#x8FD9;&#x79CD;&#x6A21;&#x5F0F;&#x65E8;&#x5728;&#x907F;&#x514D;&#x6B63;&#x7EDF;&#x5EFA;&#x6784;&#x4E3B;&#x4E49;&#x6001;&#x5EA6;&#x7684;&#x503E;&#x5411;&#x3002;&#x7814;&#x7A76;&#x96C6;&#x4E2D;&#x4E8E;&#x795E;&#x7ECF;&#x7EC4;&#x7EC7;&#x5185;&#x90E8;&#x548C;&#x81EA;&#x521B;&#x751F;&#x8FC7;&#x7A0B;&#x7684;&#x7814;&#x7A76;&#x98CE;&#x9669;&#x5F88;&#x5927;&#x7A0B;&#x5EA6;&#x4E0A;&#x53D6;&#x51B3;&#x4E8E;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x4E8B;&#x5B9E;&#xFF0C;&#x5373;&#x4ED6;&#x4EEC;&#x7684;&#x6A21;&#x578B;&#x6982;&#x5FF5;&#x6307;&#x7684;&#x662F;&#x4E00;&#x79CD;&#x4E0D;&#x77E5;&#x9053;&#x5916;&#x90E8;&#x56E0;&#x7D20;&#x7684;&#x5C01;&#x95ED;&#x8BBE;&#x5907;&#x3002;&#x5927;&#x8111;&#x53EF;&#x4EE5;&#x88AB;&#x770B;&#x4F5C;&#x7EAF;&#x7CB9;&#x5185;&#x5728;&#x529F;&#x80FD;&#x610F;&#x4E49;&#x4E0A;&#x7684;&#x53EF;&#x64CD;&#x4F5C;&#x7684;&#x81EA;&#x6211;&#x6307;&#x6D89;&#x7CFB;&#x7EDF;;&#x7136;&#x800C;&#xFF0C;&#x5728;&#x8BA4;&#x77E5;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x5185;&#x90E8;&#x548C;&#x5916;&#x90E8;&#xFF08;&#x73AF;&#x5883;&#xFF09;&#x662F;&#x76F8;&#x4E92;&#x5173;&#x8054;&#x7684;&#x3002;&#x83B7;&#x53D6;&#x77E5;&#x8BC6;&#xFF0C;&#x6559;&#x80B2;&#x548C;&#x6587;&#x5316;&#x53D6;&#x51B3;&#x4E8E;&#x4E2A;&#x4EBA;&#x7684;&#x751F;&#x6D3B;&#x7ECF;&#x9A8C;&#x3002;</p>
</li>
<li><p>Selfreferentiality does not mean isolation, since the systems can be influenced from outside, even if the manner of this influence is determined by their functional organization. [^10] Essential to the perception and construction of reality are other processes that produce a model of one&#x2019;s own body (of the ego), and a spatiotemporal model as well as a model of the place in the time-space. The importance for brain activity of the limbic system&#x2014;of the emotional and intentional components&#x2014;makes it clear that the understanding and interpreting of reality are not exclusively the results of neuronal processes.<br>&#x81EA;&#x6211;&#x8BA4;&#x540C;&#x5E76;&#x4E0D;&#x610F;&#x5473;&#x7740;&#x5B64;&#x7ACB;&#xFF0C;&#x56E0;&#x4E3A;&#x5373;&#x4F7F;&#x8FD9;&#x79CD;&#x5F71;&#x54CD;&#x7684;&#x65B9;&#x5F0F;&#x662F;&#x7531;&#x5176;&#x529F;&#x80FD;&#x7EC4;&#x7EC7;&#x51B3;&#x5B9A;&#x7684;&#xFF0C;&#x7CFB;&#x7EDF;&#x4E5F;&#x53EF;&#x80FD;&#x53D7;&#x5230;&#x5916;&#x754C;&#x7684;&#x5F71;&#x54CD;&#x3002; [^ 10]&#x5BF9;&#x73B0;&#x5B9E;&#x7684;&#x611F;&#x77E5;&#x548C;&#x5EFA;&#x6784;&#x7684;&#x57FA;&#x672C;&#x8981;&#x7D20;&#x662F;&#x4EA7;&#x751F;&#x81EA;&#x5DF1;&#x7684;&#x8EAB;&#x4F53;&#x6A21;&#x578B;&#xFF08;&#x81EA;&#x6211;&#x7684;&#x6A21;&#x578B;&#xFF09;&#xFF0C;&#x4EE5;&#x53CA;&#x65F6;&#x7A7A;&#x6A21;&#x578B;&#x548C;&#x65F6;&#x7A7A;&#x4F4D;&#x7F6E;&#x6A21;&#x578B;(Essential to the perception and construction of reality are other processes that produce a model of one&#x2019;s own body (of the ego), and a spatiotemporal model as well as a model of the place in the time-space. )&#x3002; &#x8FB9;&#x7F18;&#x7CFB;&#x7EDF;&#x7684;&#x5927;&#x8111;&#x6D3B;&#x52A8;&#x7684;&#x91CD;&#x8981;&#x6027; - &#x60C5;&#x611F;&#x548C;&#x610F;&#x56FE;&#x7684;&#x7EC4;&#x6210;&#x90E8;&#x5206; - &#x660E;&#x786E;&#x5730;&#x8868;&#x660E;&#xFF0C;&#x5BF9;&#x73B0;&#x5B9E;&#x7684;&#x7406;&#x89E3;&#x548C;&#x89E3;&#x91CA;&#x4E0D;&#x5B8C;&#x5168;&#x662F;&#x795E;&#x7ECF;&#x8FC7;&#x7A0B;&#x7684;&#x7ED3;&#x679C;&#x3002;</p>
</li>
<li><p>That which is experienced as reality is socially conditioned, for its construction rests on interaction with other individuals, on consensual domains, on language and culture. In summary it can be said that knowledge is a creative process that depends both on cognition and on interpersonal relationships and interactions with the environment: thus the entirety of knowledge, culture and art is based on the consensus, interactions and networking of individuals constituting society.<br>&#x90A3;&#x4E9B;&#x88AB;&#x8BA4;&#x4E3A;&#x662F;&#x73B0;&#x5B9E;&#x7684;&#x4E1C;&#x897F;&#x662F;&#x793E;&#x4F1A;&#x6761;&#x4EF6;&#x6027;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x7684;&#x6784;&#x5EFA;&#x4F9D;&#x8D56;&#x4E8E;&#x4E0E;&#x5176;&#x4ED6;&#x4E2A;&#x4EBA;&#x4E4B;&#x95F4;&#x7684;&#x4E92;&#x52A8;&#xFF0C;&#x57FA;&#x4E8E;&#x5171;&#x8BC6;&#x7684;&#x9886;&#x57DF;&#xFF0C;&#x8BED;&#x8A00;&#x548C;&#x6587;&#x5316;&#x3002; &#x603B;&#x4E4B;&#xFF0C;&#x53EF;&#x4EE5;&#x8BF4;&#x77E5;&#x8BC6;&#x662F;&#x4E00;&#x4E2A;&#x521B;&#x9020;&#x6027;&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x65E2;&#x4F9D;&#x8D56;&#x4E8E;&#x8BA4;&#x77E5;&#xFF0C;&#x4E5F;&#x4F9D;&#x8D56;&#x4E8E;&#x4EBA;&#x9645;&#x5173;&#x7CFB;&#x548C;&#x4E0E;&#x73AF;&#x5883;&#x7684;&#x76F8;&#x4E92;&#x4F5C;&#x7528;&#xFF1A;&#x56E0;&#x6B64;&#xFF0C;&#x77E5;&#x8BC6;&#xFF0C;&#x6587;&#x5316;&#x548C;&#x827A;&#x672F;&#x7684;&#x6574;&#x4F53;&#x57FA;&#x4E8E;&#x6784;&#x6210;&#x793E;&#x4F1A;&#x7684;&#x4E2A;&#x4EBA;&#x7684;&#x5171;&#x8BC6;&#xFF0C;&#x4E92;&#x52A8;&#x548C;&#x7F51;&#x7EDC;&#x3002;</p>
<h3 id="Media-art-as-intercommunicative-process"><a href="#Media-art-as-intercommunicative-process" class="headerlink" title="Media art as intercommunicative process"></a>Media art as intercommunicative process</h3><p>&#x5A92;&#x4F53;&#x827A;&#x672F;&#x662F;&#x4E92;&#x52A8;&#x7684;&#x8FC7;&#x7A0B;</p>
</li>
<li><p>Albert Einstein once stated that scientific theories are free creations of the human mind, and that he considered it to be the most wonderful thing to be able to use them, nevertheless, to explain the world. The same might be said of art. As a free creation of the human mind, it does not explain an independent world; rather, it takes issue with the experience of the subject in his world, and offers various explanatory models for a context in which the observer and the work partake.<br>&#x963F;&#x5C14;&#x4F2F;&#x7279;&#x7231;&#x56E0;&#x65AF;&#x5766;&#x66FE;&#x7ECF;&#x8BF4;&#x8FC7;&#xFF0C;&#x79D1;&#x5B66;&#x7406;&#x8BBA;&#x662F;&#x4EBA;&#x7C7B;&#x601D;&#x60F3;&#x7684;&#x81EA;&#x7531;&#x521B;&#x9020;&#xFF0C;&#x5E76;&#x4E14;&#x4ED6;&#x8BA4;&#x4E3A;&#x80FD;&#x591F;&#x4F7F;&#x7528;&#x5B83;&#x4EEC;&#x662F;&#x6700;&#x5947;&#x5999;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x4F46;&#x662F;&#x5B83;&#x53EF;&#x4EE5;&#x89E3;&#x91CA;&#x4E16;&#x754C;&#x3002; &#x827A;&#x672F;&#x4E5F;&#x662F;&#x5982;&#x6B64;&#x3002; &#x4F5C;&#x4E3A;&#x4EBA;&#x7C7B;&#x601D;&#x60F3;&#x7684;&#x81EA;&#x7531;&#x521B;&#x9020;&#xFF0C;&#x5B83;&#x4E0D;&#x80FD;&#x89E3;&#x91CA;&#x4E00;&#x4E2A;&#x72EC;&#x7ACB;&#x7684;&#x4E16;&#x754C;; &#x76F8;&#x53CD;&#xFF0C;&#x5B83;&#x5728;&#x4ED6;&#x7684;&#x4E16;&#x754C;&#x4E2D;&#x5BF9;&#x4E3B;&#x4F53;&#x7684;&#x7ECF;&#x9A8C;&#x63D0;&#x51FA;&#x4E86;&#x95EE;&#x9898;&#xFF0C;&#x5E76;&#x4E3A;&#x89C2;&#x5BDF;&#x8005;&#x548C;&#x5DE5;&#x4F5C;&#x53C2;&#x4E0E;&#x8005;&#x7684;&#x60C5;&#x5883;&#x63D0;&#x4F9B;&#x4E86;&#x5404;&#x79CD;&#x89E3;&#x91CA;&#x6A21;&#x578B;&#x3002;</p>
</li>
<li><p>Vil&#xE9;m Flusser&#x2019;s thesis states that the function of art is to create other worlds and to enable access to other realities. Anyone who produces a work of art not only expresses with it a part of himself and his environment, but also brings about a dialogue with other observers and a projection of other realities. Because art commits itself to this process, changing the world&#x2014;expanding human realities (knowledge, experiences, sensations or perceptions)&#x2014; becomes its cause.</p>
</li>
<li><p>From this perspective, every reality is based on experiences and actions of the creator as well as of the viewer, and is thus one argument in a (possible) explanation. As an operation within a consensual domain, the dialogic process can expand this domain and contribute to the emergence of new consensual domains, leading to an expansion of experiences, knowledge and arguments, which can potentially result in an altered cognitive horizon. Accordingly, as a form of communication, art must be ascribed to the domain of cognition that creates the prerequisites of communication. &#xAB;Thought, science and art are selfreferential cognitive processes, but they are not self-maintaining: they need the physical-chemical existence of organisms that bring forth cognition, and with it thought, science and art. Whereas autopoietic systems can invariably carry out self-maintenance only in the physical-chemical framework preordained by their environment, cognitive processes are free from these restrictions and obey only internal laws and exigencies.&#xBB; [^11]</p>
</li>
<li><p>In the art domain, therefore, reference to knowledge does not mean an approach to its possible contents exclusively on the basis of reason; rather, the intention is to emphasize that the co-influence of emotions and sensory experiences in the process of assimilating a work of art is an inseparable part of the dialogic process.</p>
</li>
<li><p>In summary, two hypotheses can be set up. One is that since explanations of art are not constitutive, reductionist or transcendental, it is by no means a matter of the search for a single and definitive explanation for the domain of art. The other is that the function of art consists in changing the world, with the latter being understood to mean the expansions of human realities and cognitive domains, and consequently also of the knowledge and experiences resulting from possible interactions and the dialogic exchange in the explanatory context of the cognitive worlds. This leads to the question of how art can execute the communicative process.</p>
</li>
<li><p>The branch of aesthetics more closely modeled on communication science examines social processes that develop expressive forms as well as phenomena of aesthetic expression fulfilling communicative functions (communication media, events, or social ceremonies).In art it is possible to distinguish among various modes of proceeding by which the problematic of communication is tackled: through the role of the viewer in the context of the work, through the analysis of the reception, or&#x2014;as proposed for instance by Fred Forest and the proponents of &#x2039;communication aesthetics&#x203A;&#x2014;from sociological viewpoints concerned with the influence of art on viewer, society or culture.</p>
</li>
<li><p>Art is an especially complex socio-cultural domain because in the process of communication it avails itself of a mainly metaphoric, symbolic and non-trivial language. If there are several domains of reality, and all of them are equally valid, the theories of art aesthetics cannot individually lay claim to universal acceptance; nor can they be viewed as inherent to the object. Sense and meaning do not lie in the work of art itself, and cannot be conveyed through the latter in the expectation that the work will be adequately interpreted. In art, meanings are time-bound, culture-specific, observer-dependent cognitive processes; therefore, works of art cannot speak for themselves.</p>
</li>
<li><p>A work of art should indeed invite the observer to enter its domain of reality and take an interest in its view of the world. If one viewer, or a group of viewers, is led to new consensual domains by a work of art, and hence to new cognition, then not only the creative act has been accomplished successfully, but communication has been, too: the spreading of a world-view to a community. Although art-works and communication are separate domains, neither works of art nor systems of art can exist without communication, no more so than art-communication is possible without art; accordingly, art-works serve the coupling of cognition and communication. [^12] This amounts to a new theoretical position that deviates from the cybernetic model.</p>
</li>
<li><p>Communication is no longer understood to mean the transmission of information, and nor is it seen as the transmission of knowledge from one system to another. It replaces the information-technical principle of communication with the model of the construction process within the cognitive systems and between systems. [^13] This process-oriented perspective is observer-dependent, i.e. as part of a network of social systems, every observer or observer community co-constitutessystems, and these naturally include art systems among others. Orientation has shifted from information objectivity to intersubjective interactivity.</p>
</li>
<li><p>One consequence is that art is becoming a kind of &#xAB;catalyst of society&#x2019;s cultural reflection.&#xBB; [^14] Proposals representing a threat to the existence of a consensus-based cognitive domain can meet with strong emotional rejection within the cultural community. By contrast, twentieth-century art offers countless examples of cases in which with the aid of intentional polemics cognition domains were expanded through the institution of &#x2039;art&#x203A; being forced to criticize itself.</p>
</li>
<li><p>The meaning of art and its aesthetics is to be sought in the function it exercises within the given observer communities, as well as in its ability to bring about by means of a language of its own an emotional and conceptual dialogue with the observer and the community.</p>
<h3 id="Interactivity-the-interface-question"><a href="#Interactivity-the-interface-question" class="headerlink" title="Interactivity: the interface question"></a>Interactivity: the interface question</h3><p>Just as people need the media for communication, technical interfaces enable different systems to be linked. It is a matter thereby of reducing spatio-temporal distances and of optimizing the response time and flexibility of the connection. The resultant re-definition of the positions adopted by both systems&#x2014;subject and machine&#x2014;influences the communication process. On the one hand, the subject is no longer merely an operator controlling a tool; on the other hand, the machine undergoes constant growth in regard to the independence of its functioning&#x2014;in other words, it is no longer a &#x2039;simple&#x203A; tool in the traditional sense.</p>
</li>
<li><p>This gradual assimilation of the position and weighting in the humanmachine communication process [^15] is clearly evident in the &#xAB;Interface Model&#xBB; of William Bricken. [^16] With it he attempts to minimize the distance between the systems (A) and (B) and at the same time to demonstrate the reciprocal influence exercised on the agents by the interaction processes. This means that every transmission of information influences and defines the linked systems. In &#xAB;Interface Model 4&#xBB; Bricken introduces a further factor: the context. According to Bricken the interface boundaryrepresents the knowledge of the interaction environment on the part of the interacting agents. On being introduced into the interaction process, the parameter of context becomes an influencing factor in the communication process. Context is a component of the interaction between two systems in the measure which they share this parameter, but can be altered in the course of the process.</p>
<h3 id="Context-and-environment"><a href="#Context-and-environment" class="headerlink" title="Context and environment"></a>Context and environment</h3></li>
<li><p>The position of Niklas Luhmann must be recalled to mind in regard to the factors of context/environment. System theory abandoned the idea of a totality constituted of parts in order to introduce the explicit reference to the environment. Luhmann goes one step further by making the structures and processes of a system dependent on their relationships to a specific environment, indicating that these structures and processes are comprehensible only in relation to this environment. This mutual dependence declares that one cannot design or create an interactive system in isolated form, since as a completed element it would a posteriori adapt to a random environment. &#xAB;Systems of interaction are formed when the presence of people is used to solve through communication the problem of dual contingency. Presence brings with it perceptibility, and insofar structural coupling to communicatively not controllable consciousness processes.&#xBB; [^17]<br>Communication, in Luhmann&#x2019;s view, is in real life an environmentadapted operation. This adaptation, however, is not completely controllable in terms of cognition or, put differently, no communication is capable of checking every single step of the process.</p>
</li>
<li><p>Alongside context/environment, time is another significant point of reference both from the perspective of optimizing interaction and recursivity as well as in regard to the response times between two systems. The endeavor to optimize the human-machine interaction process and the response times involved led to an enhancement of the visualization and sensorial perception of computer-processed information.</p>
<h3 id="Translation"><a href="#Translation" class="headerlink" title="Translation"></a>Translation</h3></li>
<li><p>A further, crucial question is aimed directly at the notion of translation. Abraham A. Moles had already addressed the subject of &#x2039;translation&#x203A; [^18] as one of the main factors in the human-machine relationship. From the technical viewpoint the interface assumes the function of translating and conveying information between two interconnected systems. As Halbach emphasizes, the problem lies precisely in the notion of &#x2039;translation,&#x203A; because not only does it connect various input and output channels, it also regulates and communicates various coding methods. &#xAB;When it is a matter of interfaces of human-machine interaction, then (a) input and output channels cannot be adjusted to each other, since they are precisely what a human being, as an autopoietic system, does not possess, and (b) is it not possible to speak of a translation of the coding method, since the subsymbolic representation forms of the human nervous have not (yet) been decrypted.&#xBB; [^19]<br>Due to the employment of technical media, interaction based on a human-machine interface denotes a qualitative expansion of communication computer displays and interfaces function as control mechanisms that maintain the equivalence of communication. For this reason, control&#x2014;conscious or unconscious&#x2014;is among the most relevant research tasks in the area of interactive systems.</p>
</li>
<li><p>Today&#x2019;s systems convey to the user impressions or sensations that are only partially attributable to his own sensory or motor activities, since the possibilities of interaction and the generation of outputs (for instance, moving three-dimensional images, or sound) are determined by the particular program constituting the user&#x2019;s field of action. In the measure to which the user cannot completely control the cognitive processes of interactive communication in the simulated environment, part of the control must necessarily be exercised by the system itself.</p>
<h3 id="Models-of-interactive-systems"><a href="#Models-of-interactive-systems" class="headerlink" title="Models of interactive systems"></a>Models of interactive systems</h3></li>
<li><p>The actions of the observer thus exercise a fundamental and complementary function in interactive systems. The resultant need for synchronous humanmachine reactions, and the interdependence between the context of the subject and that of the systemenvironment, lead to the question of the different typologies of interactive systems and their strategies.</p>
</li>
<li><p>Various works of media art deploying reactive systems and digital images at the same time directly or indirectly investigate the changes that the observer, by means of data manipulation over interfaces, can bring about in the work. Three models of interactive system can be roughly distinguished on the basis of media-assisted forms of interactivity: [^20]<br>&#x2014; Discrete or active systems: although the user can control the content called up, and the sequence in which this occurs, he/she has no influence on the transmitted information, since the management of this information, which demonstrates predictable behavior, is integrated.<br>&#x2014; Reactive systems: the work&#x2019;s behavior, which is media-assisted and based on feedback structures, results from the direct reaction to external stimuli, for instance user control or altered environmental conditions. Selection methods and recursive events create cognitive situations for the participative user.<br>&#x2014; Interactive systems: open program structuring, over which the receiver can also act as transmitter. Since the user can influence the procedure and appearance of the work, or even add new information in the case of more complex systems, it is a matter of content-related interactivity. Temporal, spatial, or content-based relations are established between interactor and work.</p>
</li>
<li><p>Heinz von Foerster makes a distinction between trivial and non-trivial machines in regard to technical specificity. Trivial machines are causally describable and predictable, and conceivable only in non-physical areas such as mathematics. Machines in physical space are always non-trivial, since this space is subject to entropic processes. Two types of non-trivial machines can be distinguished: those which attempt to adjust their behavior to the trivial machines, and those which behave non-trivially. The former are purposeoriented machines, the latter are ones which are potentially suitable for interactivity. [^21]</p>
</li>
<li><p>According to Peter Weibel three different models of interactivity can be drawn up from the viewpoints of behavior and consciousness: synaesthetic interactivity, which consists of interactivity between variousmaterials and elements, such as image and sound, color and music; synergetic interactivity, which takes place between states of energy, as in works that react to changes in their environment; and communicative or kinetic interactivity between different people and between persons and objects.<br>In all cases, environment or context are of crucial importance to the human-machine performance. As stated already, the integration of context into the interactivity process means acknowledging it as a conditioning factor in the communication process. Peter Weibel reflects upon the relationship of dependence between observer and context in his interactive installation &#xAB;Cartesian Chaos&#xBB; of 1992.</p>
<h3 id="Art-system"><a href="#Art-system" class="headerlink" title="Art/system"></a>Art/system</h3></li>
<li><p>Interactivity in art is therefore composed, as Peter Weibel proposes, of three digital characteristics: virtuality, variability, and viability.[^22] On the other hand, the human-machine interface attests to the transformation of a culture based on narratively logocentric and sequential structures into a &#x2039;digital culture&#x203A; that is visual, sensory, retroactive and nonlinear (hypertextual) in orientation. The special potentiality of digital technology (including the telematic) is applied in order to overcome the boundaries of the purely instrumental and so accomplish the transformation into a medium of the imaginary generating cognitively and sensorially experiencable (virtual) environments.</p>
</li>
<li><p>On the basis of all these factors associated with media art in general and with interactive art in particular, a crucial shift in the meaning of &#x2039;art&#x203A; towards that of &#x2039;system&#x203A;[^23] is clearly discernible (without wanting to simply replace one term with another).</p>
</li>
<li><p>The analysis of interactive systems leads to the conclusion that the interest lies no longer in the production of a work of art that reflects upon world- views through the reproduction or interpretation of ways of seeing, but that the work of art, as a &#x2039;system,&#x203A; attempts to scrutinize the world itself: the realities, the contexts, the life, the biological system of humanity. It is a system that opens up new &#x2039;world-views.&#x203A; Contemporary art creation assisted by processbased methods and systemic models is gainingnew significance in the sociocultural context, and thereby contradicting art&#x2019;s postulated loss of function in the present-day world. Moreover, the idiosyncrasy of the process as well as the interactive and systemic character of the work produced inevitably entails a transformation of aesthetic paradigms.</p>
</li>
<li><p>The systemic practices based on the use of interactive technologies demand an aesthetic theory appropriate to their methods. Endo-physics, which is closely linked with Constructivism, hereby offers ideal foundations for concepts inspiring proposals for an &#xAB;endo-aesthetics,&#xBB;[^24]a theory considered to be suitable for recording the different manifestations of interactive and artificial systems.<br>Translation by Tom Morrison<br><a href="https://hackmd.io/FJJo8niERte-bt4mvpE3cQ" rel="external nofollow noopener noreferrer" target="_blank">&#x5168;&#x7F51;&#x534F;&#x4F5C;</a></p>
</li>
</ol>
<p>[^1]: Alexander Bogdanov, Tektolog&#xED;a, published in three volumes in Russia between 1912 and 1917.<br>[^2]: Little notice was taken of Bogdanov&#x2019;s writings during his lifetime, however, and the lack of promulgation meant that it was the Austrian biologist Ludwig von Bertalanffy&#x2019;s ideas in regard to general system theory which turned into a scientific current the transformation of systemic thought. See Ludwig von Bertalanffy, &#xAB;Der Organismus als physikalisches System betrachtet,&#xBB; in Die Naturwissenschaften, Bd. 28, 1940, pp. 521&#x2013;531; &#xAB;The Theory of Open Systems in Physics and Biology,&#xBB; in Science, vol. 111, 1950, pp. 23&#x2013;29; General System Theory, New York, 1968.<br>[^3]: Like, for example, Ilya Prigogine and dissipative structures; Manfred Eigen and hyper-cycles; Hermann Haken and laser theory.<br>[^4]: &#x2039;Autopoiesis&#x203A;&#x2014;from the Greek &#x2039;auto&#x203A; (self) and &#x2039;poiein&#x203A; (shaping)&#x2014;means &#x2039;self-shaping.&#x203A;<br>[^5]: &#xAB;The nervous system is a closed network of interacting active neuronal elements (neurons, effectors and receptors) that are structurally realized as cellular components of the organism. As such, it operates as a closed network of changing relations of activity between its components; that is, it is constitutive to the organization of the nervous system that any change of relations of activity between its components leads to further changes of relations of activity between them, and that in that sense it operates without inputs or outputs. Therefore, any action upon an environment that an observer sees as a result of the operation of the nervous system is a feature of the structural changes that take place in the nervous system as a cellular network, and not a feature of its operation as such.&#xBB; Humberto Maturana, &#xAB;Ontology of Observing. The biological foundations of self consciousness and the physical domain of existence&#xBB; in chapter 9 &#xAB;Consequences&#xBB;. See Humberto Maturana and Francisco Varela, Autopoiesis and Cognition: The Realization of the Living, Boston, 1980.<br>[^6]: &#xAB;In the distinction of living systems, this distinction as entities engaged as adequate action consists in bringing them forth (in the praxis of living of the observer), both in conservation of autopoiesis and of adaptation and as a moment in their ontongenic drift in a medium. In other words, I have shown that for any particular circumstance of distinction of a living system, conservation of living (conservation of autopiesis and of adaptation) constitutes adequate action in those circumstances, and, hence, knowledge: living systems are cognitive systems, and to live is to know.&#xBB; Humberto Maturana, &#xAB;Ontology of Observing. The biological foundations of self consciousness and the physical domain of existence&#xBB; in chapter 8 &#xAB;Consequences&#xBB;. See Humberto Maturana<br>[^7]: Humberto Maturana, La realidad: &#xBF;objetiva o construida? II, Barcelona,1996, p. 214. Cf. Humberto Maturana and Francisco J. Varela, The Tree of Knowledge: The Biological Roots of Human Understanding, Boston, 1987.<br>[8] Humberto Maturana, &#xAB;Kognition,&#xBB; in Der Diskurs des Radikalen Konstruktivismus, Siegfried J. Schmidt (ed.), Frankfurt-on-Main, 1987, p. 114. See Humberto Maturana and Francisco Varela, Autopoiesis and Cognition: The Realization of the Living, Boston, 1980.<br>[^9]: Humberto Maturana, &#xAB;Kognition,&#xBB; in Der Diskurs des Radikalen Konstruktivismus, Siegfried J. Schmidt (ed.), Frankfurt/Main, 1987, pp. 89&#x2013;118.<br>[^10]: Cf. Gerhard Roth, &#xAB;Erkenntnis und Realit&#xE4;t: Das reale Gehirn und seine Wirklichkeit,&#xBB; in Der Diskurs des Radikalen Konstruktivismus, Siegfried J. Schmidt (ed.), Frankfurt/Main, 1987, p. 241. This would be one of the counter-arguments to Maturana&#x2019;s assertion that cognitive systems are autopoietic (cf. Humberto Maturana, &#xAB;Kognition,&#xBB; in Der Diskurs des Radikalen<br>[^11]: Gerhard Roth, &#xAB;Autopoise und Kognition: Die Theorie H. R. Maturanas und die Notwendigkeit ihrer Weiterentwicklung&#xBB;, in Der Diskurs des Radikalen Konstruktivismus, Siegfried J. Schmidt (ed.), Frankfurt/Main, 1987, p. 282.<br>[^12]: Cf. Siegfried J. Schmidt, Kalte Faszination, Weilerswist, 2000, p. 297.<br>[13] Cf. Erich Jantsch, &#xAB;Erkenntnistheoretische Aspekte der Selbstorganisation nat&#xFC;rlicher Systeme&#xBB; in Der Diskurs des Radikalen Konstruktivismus, Siegfried J. Schmidt (ed.), Frankfurton- Main, 1987, p. 170.<br>[^14]: Siegfried J. Schmidt, Kalte Faszination, Weilerswist, 2000, p. 288.<br>[^15]: Cf. the text section on &#xAB;Man&#x2013;Machine&#x2013;Communication&#xBB; in Claudia Giannetti, &#xAB;Art, Science, and Technology.&#xBB;<br>[^16]: William Bricken, &#xAB;An Interface Model,&#xBB; internal paper of ATARI Systems Research, Ms (draft), 1983, p. 5, cited after Wulf R. Halbach, Interfaces: Medien- und kommunikationstheoretische Elemente einer Interface-Theorie, Munich, 1994, p. 161.<br>[^17]: Niklas Luhmann, Die Gesellschaft der Gesellschaft, Frankfurt-on-Main, 1997, p. 814.<br>[^18]: Cf. Claudia Giannetti, &#xAB;Information Aesthetics.&#xBB;<br>[^19]: Wulf R. Halbach, Interfaces: Medien- und kommunikationstheoretische Elemente einer Interface-Theorie, Munich, 1994, p. 166.<br>[^20]: For further suggestions see Fran&#xE7;oise Holtz-Bonneau, L&#x2019;image et l&#x2019;ordinateur, Paris, 1986.<br>[^21]: See Peter Krieg, &#xAB;Versuch &#xFC;ber Interaktion und Medien,&#xBB; in K&#xFC;nstliche Spiele, Georg Hartwagner et al. (eds), Munich, 1993, pp. 180&#x2013;181.<br>[^22]: See Peter Weibel, &#xAB;The Unreasonable Effectiveness of the Methodological Convergence of Art and Science,&#xBB; in Art @ Science, Christa Sommerer/Laurent Mignonneau (eds), Vienna/New York, 1998.<br>[^23]: Fred Forest wrote in 1985: &#xAB;Replacer l&#x2019;art, aujourd&#x2019;hui, dans les syst&#xE8;mes situ&#xE9;s aux divers niveaux d&#x2019;organisation de la r&#xE9;alit&#xE9;, en faisant sauter les cloisonnements disciplinaires, me para&#xEE;t une t&#xE2;che n&#xE9;cessaire et &#xE0; la fois en&#xE9;vitable.&#xBB; See Fred Forest, &#xAB;Manifeste pour une esth&#xE9;tique de la communication&#xBB; in Esth&#xE9;tique des Arts M&#xE9;diatiques, Louise Poissant (ed.), Qu&#xE9;bec, 1995, p. 36. In the catalog for the Interactive Media Festival, San Francisco, 1995, Roy Ascott replaced the notion of art with that of the system. Besides Weibel cf. also Louis Bec.<br>[^24]: Cf. also the text section &#xAB;Principles of endo-physics&#xBB; in Claudia Giannetti, &#xAB;Endoaesthetics.&#xBB;<br>&#xA9; Media Art Net 2004</p>

    
    </div>
    
    
</article>




    
        <article class="article content gallery" itemscope="" itemprop="blogPost">
    <h1 class="article-title is-size-3 is-size-4-mobile" itemprop="name">
        
            <a href="/2018/11/10/艺术，科学和技术/" itemprop="url">艺术，科学与技术</a>
        
    </h1>
    <div class="article-meta columns is-variable is-1 is-multiline is-mobile is-size-7-mobile">
        <span class="column is-narrow">
            <time datetime="2018-11-10T12:15:41.000Z" itemprop="datePublished">11月 10 2018</time>
        </span>
        
        
        <span class="column is-narrow">
            
            
            1 小时 lire (À propos 8079 mots)
        </span>
        
    </div>
    <div class="article-entry is-size-6-mobile" itemprop="articleBody">
    
        <h1 id="ART-SCIENCE-AND-TECHNOLOGY&#x827A;&#x672F;&#xFF0C;&#x79D1;&#x5B66;&#xFF0C;&#x548C;&#x6280;&#x672F;"><a href="#ART-SCIENCE-AND-TECHNOLOGY&#x827A;&#x672F;&#xFF0C;&#x79D1;&#x5B66;&#xFF0C;&#x548C;&#x6280;&#x672F;" class="headerlink" title="ART, SCIENCE, AND TECHNOLOGY&#x827A;&#x672F;&#xFF0C;&#x79D1;&#x5B66;&#xFF0C;&#x548C;&#x6280;&#x672F;"></a>ART, SCIENCE, AND TECHNOLOGY&#x827A;&#x672F;&#xFF0C;&#x79D1;&#x5B66;&#xFF0C;&#x548C;&#x6280;&#x672F;</h1><p><strong>Claudia Giannetti</strong> &#x514B;&#x52B3;&#x8FEA;&#x5A05;&#xB7;&#x8A79;&#x5185;&#x8482;<br><a href="http://mediaartnet.org/themes/aesthetics_of_the_digital/art_science_technology/" rel="external nofollow noopener noreferrer" target="_blank"><em>link</em></a><br><a href="https://hackmd.io/6gpqSVlJR1WHtBUh-6s2JA" rel="external nofollow noopener noreferrer" target="_blank">&#x6570;&#x5B57;&#x7F8E;&#x5B66;&#x76EE;&#x5F55;</a></p>
<h6 id="tags-&#x7FFB;&#x8BD1;-MT-amp-T"><a href="#tags-&#x7FFB;&#x8BD1;-MT-amp-T" class="headerlink" title="tags: &#x7FFB;&#x8BD1; MT&amp;T"></a>tags: <code>&#x7FFB;&#x8BD1;</code> <code>MT&amp;T</code></h6><h3 id="Art-science-art"><a href="#Art-science-art" class="headerlink" title="Art - science - art"></a>Art - science - art</h3><h3 id="&#x827A;&#x672F;-&#x79D1;&#x5B66;-&#x827A;&#x672F;"><a href="#&#x827A;&#x672F;-&#x79D1;&#x5B66;-&#x827A;&#x672F;" class="headerlink" title="&#x827A;&#x672F;-&#x79D1;&#x5B66;-&#x827A;&#x672F;"></a>&#x827A;&#x672F;-&#x79D1;&#x5B66;-&#x827A;&#x672F;</h3><ol>
<li><p>Deliberations on the connection between art and science have various points of departure. The most general considerations are limited to the assumption of a parallel development. In his writings published in 1970, Werner Heisenberg, who along with Max Planck counts as a founding father of quantum theory, stated that the tendencies towards abstraction in the sciences were comparable with those in the field of art. According to Heisenberg, new artistic and scientific forms can result only from new content, but the converse does not apply. To renew art or to revolutionize science, he wrote, meant to create new content and concepts, and not just new forms. [^1]<br>&#x5BF9;&#x827A;&#x672F;&#x4E0E;&#x79D1;&#x5B66;&#x4E4B;&#x95F4;&#x5173;&#x7CFB;&#x7684;&#x8BA8;&#x8BBA;&#x6709;&#x4E0D;&#x540C;&#x7684;&#x51FA;&#x53D1;&#x70B9;&#x3002; &#x6700;&#x666E;&#x904D;&#x7684;&#x8003;&#x8651;&#x4EC5;&#x9650;&#x4E8E;&#x5E76;&#x884C;&#x5F00;&#x53D1;&#x7684;&#x5047;&#x8BBE;&#x3002; &#x5728;1970&#x5E74;&#x51FA;&#x7248;&#x7684;&#x7740;&#x4F5C;&#x4E2D;&#xFF0C;&#x4E0E;&#x9A6C;&#x514B;&#x65AF;&#xB7;&#x666E;&#x6717;&#x514B;&#x4E00;&#x8D77;&#x6210;&#x4E3A;&#x91CF;&#x5B50;&#x7406;&#x8BBA;&#x7684;&#x521B;&#x59CB;&#x4EBA;&#x4E4B;&#x4E00;&#x7684;&#x7EF4;&#x5C14;&#x7EB3;&#x6D77;&#x68EE;&#x4F2F;&#x683C;&#x6307;&#x51FA;&#xFF0C;&#x79D1;&#x5B66;&#x4E2D;&#x62BD;&#x8C61;&#x7684;&#x503E;&#x5411;&#x4E0E;&#x827A;&#x672F;&#x9886;&#x57DF;&#x7684;&#x503E;&#x5411;&#x76F8;&#x5F53;&#x3002; &#x6839;&#x636E;&#x6D77;&#x68EE;&#x5821;&#x7684;&#x8BF4;&#x6CD5;&#xFF0C;&#x65B0;&#x7684;&#x827A;&#x672F;&#x548C;&#x79D1;&#x5B66;&#x5F62;&#x5F0F;&#x53EA;&#x80FD;&#x7531;&#x65B0;&#x5185;&#x5BB9;&#x4EA7;&#x751F;&#xFF0C;&#x4F46;&#x76F8;&#x53CD;&#x5E76;&#x4E0D;&#x9002;&#x7528;&#x3002; &#x4ED6;&#x5199;&#x9053;&#xFF0C;&#x91CD;&#x5EFA;&#x827A;&#x672F;&#x6216;&#x9769;&#x547D;&#x5316;&#x79D1;&#x5B66;&#x610F;&#x5473;&#x7740;&#x521B;&#x9020;&#x65B0;&#x7684;&#x5185;&#x5BB9;&#x548C;&#x6982;&#x5FF5;&#xFF0C;&#x800C;&#x4E0D;&#x4EC5;&#x4EC5;&#x662F;&#x65B0;&#x7684;&#x5F62;&#x5F0F;&#x3002;</p>
</li>
<li><p>A question more complex than that of parallels between art and science is the extent to which art influences the sciences. According to Peter Weibel, this question can be answered only methodologically, that is by applying a comparison which views art and science as methods. While science, says Weibel, is distinctly methodological in character, art is generally not regarded as a method: &#xAB;This is our first claim: art and science can only reasonably be compared if weaccept that both are methods. This does not mean that we declare that both have the same methods. We only want to declare that both have a methodological approach, even if their methods are or can be different.&#xBB; [^2]<br>&#x6BD4;&#x827A;&#x672F;&#x4E0E;&#x79D1;&#x5B66;&#x4E4B;&#x95F4;&#x7684;&#x76F8;&#x4F3C;&#x4E4B;&#x5904;&#x66F4;&#x590D;&#x6742;&#x7684;&#x95EE;&#x9898;&#x662F;&#x827A;&#x672F;&#x5BF9;&#x79D1;&#x5B66;&#x7684;&#x5F71;&#x54CD;&#x7A0B;&#x5EA6;&#x3002; &#x6839;&#x636E;Peter Weibel&#x7684;&#x8BF4;&#x6CD5;&#xFF0C;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x53EA;&#x80FD;&#x901A;&#x8FC7;&#x65B9;&#x6CD5;&#x8BBA;&#x6765;&#x56DE;&#x7B54;&#xFF0C;&#x5373;&#x901A;&#x8FC7;&#x6BD4;&#x8F83;&#xFF0C;&#x5C06;&#x827A;&#x672F;&#x548C;&#x79D1;&#x5B66;&#x89C6;&#x4E3A;&#x65B9;&#x6CD5;&#x3002; Weibel&#x8BF4;&#xFF0C;&#x5C3D;&#x7BA1;Weibel&#x5728;&#x79D1;&#x5B66;&#x4E0A;&#x5177;&#x6709;&#x660E;&#x663E;&#x7684;&#x65B9;&#x6CD5;&#x8BBA;&#x6027;&#x8D28;&#xFF0C;&#x4F46;&#x827A;&#x672F;&#x901A;&#x5E38;&#x4E0D;&#x88AB;&#x89C6;&#x4E3A;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#xFF1A;&#x201C;&#x8FD9;&#x662F;&#x6211;&#x4EEC;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x4E3B;&#x5F20;&#xFF1A;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x8BA4;&#x4E3A;&#x4E24;&#x8005;&#x90FD;&#x662F;&#x65B9;&#x6CD5;&#xFF0C;&#x827A;&#x672F;&#x548C;&#x79D1;&#x5B66;&#x53EA;&#x80FD;&#x5408;&#x7406;&#x5730;&#x8FDB;&#x884C;&#x6BD4;&#x8F83;&#x3002; &#x8FD9;&#x5E76;&#x4E0D;&#x610F;&#x5473;&#x7740;&#x6211;&#x4EEC;&#x5BA3;&#x79F0;&#x4E24;&#x8005;&#x90FD;&#x6709;&#x76F8;&#x540C;&#x7684;&#x65B9;&#x6CD5;&#x3002; &#x6211;&#x4EEC;&#x53EA;&#x60F3;&#x8868;&#x660E;&#x4E24;&#x8005;&#x90FD;&#x5177;&#x6709;&#x65B9;&#x6CD5;&#x8BBA;&#x7684;&#x9014;&#x5F84;&#xFF0C;&#x5373;&#x4F7F;&#x4ED6;&#x4EEC;&#x7684;&#x65B9;&#x6CD5;&#x662F;&#x6216;&#x53EF;&#x80FD;&#x4E0D;&#x540C;&#x3002;&#x201D;</p>
</li>
<li><p>Accordingly it would be permissible to view art and science as convergent in the methodological sense. As Weibel sees it, science is influenced by art in regard to its methods, but not by its products and references: &#xAB;Because any time science develops the tendency for its methods to become too authoritarian, too dogmatic, science turns to art and to the methodology of art which is plurality of methods.&#xBB; [^3] The objective nature exists neither in the framework of the sciences nor in culture regardless of social construction, &#xAB;art and science meet and converge in the method of social construction.&#xBB; [^4]<br>&#x56E0;&#x6B64;&#xFF0C;&#x53EF;&#x4EE5;&#x5C06;&#x827A;&#x672F;&#x548C;&#x79D1;&#x5B66;&#x89C6;&#x4E3A;&#x65B9;&#x6CD5;&#x8BBA;&#x610F;&#x4E49;&#x4E0A;&#x7684;&#x8D8B;&#x540C;&#x3002; &#x6B63;&#x5982;&#x9B4F;&#x8D1D;&#x5C14;&#x6240;&#x770B;&#x5230;&#x7684;&#x90A3;&#x6837;&#xFF0C;&#x79D1;&#x5B66;&#x53D7;&#x5176;&#x827A;&#x672F;&#x65B9;&#x6CD5;&#x7684;&#x5F71;&#x54CD;&#xFF0C;&#x4F46;&#x4E0D;&#x53D7;&#x5176;&#x4EA7;&#x54C1;&#x548C;&#x53C2;&#x8003;&#x6587;&#x732E;&#x7684;&#x5F71;&#x54CD;&#xFF1A;&#x201C;&#x56E0;&#x4E3A;&#x4EFB;&#x4F55;&#x65F6;&#x5019;&#x79D1;&#x5B66;&#x7684;&#x53D1;&#x5C55;&#x8D8B;&#x52BF;&#x90FD;&#x4F1A;&#x4F7F;&#x5176;&#x65B9;&#x6CD5;&#x53D8;&#x5F97;&#x8FC7;&#x4E8E;&#x4E13;&#x5236;&#xFF0C;&#x8FC7;&#x4E8E;&#x6559;&#x6761;&#x5316;&#xFF0C;&#x79D1;&#x5B66;&#x5C31;&#x8F6C;&#x5411;&#x827A;&#x672F;&#xFF0C;&#x8F6C;&#x5411;&#x672C;&#x8EAB;&#x5C31;&#x591A;&#x5143;&#x7684;&#x827A;&#x672F;&#x65B9;&#x6CD5;&#x3002;&#x201D;[^ 3]&#x5BA2;&#x89C2;&#x672C;&#x8D28;&#x65E2;&#x4E0D;&#x5B58;&#x5728;&#x4E8E;&#x79D1;&#x5B66;&#x7684;&#x6846;&#x67B6;&#x4E2D;&#xFF0C;&#x4E5F;&#x4E0D;&#x5B58;&#x5728;&#x4E8E;&#x6587;&#x5316;&#x4E2D;&#xFF0C;&#x4E0D;&#x8BBA;&#x793E;&#x4F1A;&#x5EFA;&#x6784;&#x5982;&#x4F55;&#xFF0C;&#x201C;&#x827A;&#x672F;&#x4E0E;&#x79D1;&#x5B66;&#x5728;&#x793E;&#x4F1A;&#x5EFA;&#x6784;&#x7684;&#x65B9;&#x6CD5;&#x4E2D;&#x76F8;&#x9047;&#x5E76;&#x878D;&#x5408;&#x201D;&#x3002;</p>
</li>
<li><p>This position finds its most radical expression in the science-theoretical contributions of Paul Feyerabend. As a critic of scientific rationalism, he develops new interpretations and connections among the arts and sciences. He is of the opinion that artists and scientists developing a style or theory frequently pursue a secondary intention, namely that of representing &#x2039;the&#x203A; truth or &#x2039;the&#x203A; reality. However, artistic styles are closely connected with styles of thought.<br>&#x8FD9;&#x4E00;&#x7ACB;&#x573A;&#x5728;Paul Feyerabend&#x7684;&#x79D1;&#x5B66;&#x7406;&#x8BBA;&#x8D21;&#x732E;&#x4E2D;&#x627E;&#x5230;&#x4E86;&#x6700;&#x6FC0;&#x8FDB;&#x7684;&#x8868;&#x8FBE;&#x3002; &#x4F5C;&#x4E3A;&#x79D1;&#x5B66;&#x7406;&#x6027;&#x4E3B;&#x4E49;&#x7684;&#x6279;&#x8BC4;&#x5BB6;&#xFF0C;&#x4ED6;&#x5728;&#x827A;&#x672F;&#x548C;&#x79D1;&#x5B66;&#x4E4B;&#x95F4;&#x53D1;&#x5C55;&#x4E86;&#x65B0;&#x7684;&#x89E3;&#x91CA;&#x548C;&#x8054;&#x7CFB;&#x3002; &#x4ED6;&#x8BA4;&#x4E3A;&#xFF0C;&#x53D1;&#x5C55;&#x4E00;&#x79CD;&#x98CE;&#x683C;&#x6216;&#x7406;&#x8BBA;&#x7684;&#x827A;&#x672F;&#x5BB6;&#x548C;&#x79D1;&#x5B66;&#x5BB6;&#x7ECF;&#x5E38;&#x8FFD;&#x6C42;&#x7B2C;&#x4E8C;&#x4E2A;&#x610F;&#x56FE;&#xFF0C;&#x5373;&#x8868;&#x73B0;&#x771F;&#x7406;&#x6216;&#x73B0;&#x5B9E;&#x3002; &#x7136;&#x800C;&#xFF0C;&#x827A;&#x672F;&#x98CE;&#x683C;&#x4E0E;&#x601D;&#x60F3;&#x98CE;&#x683C;&#x5BC6;&#x5207;&#x76F8;&#x5173;&#x3002;<br>:::success</p>
<h4 id="&#x5218;&#x8FEA;&#x5148;-1-4"><a href="#&#x5218;&#x8FEA;&#x5148;-1-4" class="headerlink" title="&#x5218;&#x8FEA;&#x5148; 1~4"></a>&#x5218;&#x8FEA;&#x5148; 1~4</h4><p>:::</p>
</li>
<li><p>That which a specific form of thought understands concepts such as truth or reality to mean is what this form of thought asserts as truth. When one decides in favor of a style, a reality, or a form of truth, then one always chooses a human-made construction. In other words, Feyerabend negates the possibility of absolute rationality and logic in regard to that which is created by the human mind. He asserts that this relativist, and in a certain sense irrational, factor inherent in every branch of science places science in the proximity of art. According to Feyerabend, the sciences are not an institution of objective truth, but are arts along the lines of a progressive understanding of art. [^5]<br>&#x7279;&#x5B9A;&#x5F62;&#x5F0F;&#x7684;&#x601D;&#x60F3;&#x7406;&#x89E3;&#x771F;&#x7406;&#x6216;&#x73B0;&#x5B9E;&#x8FD9;&#x4E9B;&#x6982;&#x5FF5;&#x7684;&#x542B;&#x4E49;&#x662F;&#x8FD9;&#x79CD;&#x601D;&#x60F3;&#x5F62;&#x5F0F;&#x6240;&#x8BF4;&#x7684;&#x771F;&#x7406;&#x3002; &#x5F53;&#x4EBA;&#x4EEC;&#x51B3;&#x5B9A;&#x652F;&#x6301;&#x4E00;&#x79CD;&#x98CE;&#x683C;&#xFF0C;&#x4E00;&#x79CD;&#x73B0;&#x5B9E;&#x6216;&#x4E00;&#x79CD;&#x771F;&#x7406;&#x65F6;&#xFF0C;&#x4EBA;&#x4EEC;&#x603B;&#x4F1A;&#x9009;&#x62E9;&#x4E00;&#x79CD;&#x4EBA;&#x9020;&#x7684;&#x5EFA;&#x7B51;&#x3002; &#x6362;&#x53E5;&#x8BDD;&#x8BF4;&#xFF0C;&#x8D39;&#x8036;&#x963F;&#x672C;&#x5FB7;(Feyerabend)&#x5426;&#x5B9A;&#x4E86;&#x5173;&#x4E8E;&#x4EBA;&#x7684;&#x601D;&#x60F3;&#x6240;&#x521B;&#x9020;&#x7684;&#x7EDD;&#x5BF9;&#x7406;&#x6027;&#x548C;&#x903B;&#x8F91;&#x7684;&#x53EF;&#x80FD;&#x6027;&#x3002; &#x4ED6;&#x65AD;&#x8A00;&#xFF0C;&#x8FD9;&#x4E2A;&#x76F8;&#x5BF9;&#x4E3B;&#x4E49;&#x8005;&#xFF0C;&#x4EE5;&#x53CA;&#x67D0;&#x79CD;&#x610F;&#x4E49;&#x4E0A;&#x975E;&#x7406;&#x6027;&#x56E0;&#x7D20;&#xFF0C;&#x79D1;&#x5B66;&#x7684;&#x6BCF;&#x4E00;&#x4E2A;&#x5206;&#x652F;&#x56FA;&#x6709;&#x7684;&#x56E0;&#x7D20;&#x90FD;&#x5C06;&#x79D1;&#x5B66;&#x7F6E;&#x4E8E;&#x827A;&#x672F;&#x7684;&#x9644;&#x8FD1;&#x3002; &#x6839;&#x636E;&#x8D39;&#x8036;&#x963F;&#x672C;&#x5FB7;&#x7684;&#x8BF4;&#x6CD5;&#xFF0C;&#x79D1;&#x5B66;&#x4E0D;&#x662F;&#x5BA2;&#x89C2;&#x771F;&#x7406;&#x7684;&#x5236;&#x5EA6;&#xFF0C;&#x800C;&#x662F;&#x827A;&#x672F;&#x9010;&#x6E10;&#x7406;&#x89E3;&#x7684;&#x827A;&#x672F;&#x3002;</p>
</li>
<li><p>Feyerabend&#x2019;s line of argument reflects the skepticism that deeply influenced occidental culture and science well into the twentieth century. The aforementioned questions of truth, reality and reason are central components of the contest between rationalism and relativism affecting art no less directlythan science. If the nature of science were to be considered a research method under the premises of reality, plausibility, and dialectics, then whoever attempted to identify these three principles by strictly observing the complexity of the objects would, according to the Spanish scientist Jorge Wagensberg, reach the conclusion that the object resisted the method. The only manner of proceeding would be to &#xAB;soften up&#xBB; the method, with the result that &#xAB;science is transformed into ideology.&#xBB; &#xAB;At its core ideology means not research, but faith. It follows from this consideration that one must stop with ideology all the holes which science has itself failed to stop. [&#x2026;] If the knowledge towards which we aspire is ruled not by laws but by world-views, then it would seem expedient to take our leave of scientific methods, and perhaps even adopt principles radically opposed to the latter. Precisely that is the case in art, in a kind of knowledge whose creators have not the least interest in distancing themselves from their creation.&#xBB; [^6]<br>&#x8D39;&#x8036;&#x963F;&#x672C;&#x5FB7;(Feyerabend)&#x7684;&#x8BBA;&#x636E;&#x53CD;&#x6620;&#x4E86;&#x5BF9;&#x897F;&#x65B9;&#x6587;&#x5316;&#x548C;&#x79D1;&#x5B66;&#x6DF1;&#x6DF1;&#x5F71;&#x54CD;&#x5230;&#x4E8C;&#x5341;&#x4E16;&#x7EAA;&#x7684;&#x6000;&#x7591;&#x8BBA;&#x3002;&#x4E0A;&#x8FF0;&#x5173;&#x4E8E;&#x771F;&#x7406;&#xFF0C;&#x73B0;&#x5B9E;&#x548C;&#x7406;&#x6027;&#x7684;&#x95EE;&#x9898;&#x662F;&#x7406;&#x6027;&#x4E3B;&#x4E49;&#x548C;&#x76F8;&#x5BF9;&#x4E3B;&#x4E49;&#x4E4B;&#x95F4;&#x5BF9;&#x827A;&#x672F;&#x7684;&#x4E89;&#x593A;&#x7684;&#x6838;&#x5FC3;&#x7EC4;&#x6210;&#x90E8;&#x5206;&#xFF0C;&#x8FD9;&#x4E9B;&#x5BF9;&#x827A;&#x672F;&#x7684;&#x5F71;&#x54CD;&#x4E0D;&#x4E9A;&#x4E8E;&#x79D1;&#x5B66;&#x3002;&#x6839;&#x636E;&#x897F;&#x73ED;&#x7259;&#x79D1;&#x5B66;&#x5BB6;Jorge Wagensberg&#x7684;&#x8BF4;&#x6CD5;&#xFF0C;&#x5982;&#x679C;&#x79D1;&#x5B66;&#x7684;&#x672C;&#x8D28;&#x5728;&#x73B0;&#x5B9E;&#xFF0C;&#x5408;&#x7406;&#x6027;&#x548C;&#x8FA9;&#x8BC1;&#x6CD5;&#x7684;&#x524D;&#x63D0;&#x4E0B;&#x88AB;&#x8BA4;&#x4E3A;&#x662F;&#x4E00;&#x79CD;&#x7814;&#x7A76;&#x65B9;&#x6CD5;&#xFF0C;&#x90A3;&#x4E48;&#x65E0;&#x8BBA;&#x8C01;&#x8BD5;&#x56FE;&#x901A;&#x8FC7;&#x4E25;&#x683C;&#x89C2;&#x5BDF;&#x8FD9;&#x4E9B;&#x7269;&#x4F53;&#x7684;&#x590D;&#x6742;&#x6027;&#x6765;&#x786E;&#x5B9A;&#x8FD9;&#x4E09;&#x4E2A;&#x539F;&#x5219;&#xFF0C;&#x8BE5;&#x5BF9;&#x8C61;&#x62B5;&#x5236;&#x8BE5;&#x65B9;&#x6CD5;&#x7684;&#x7ED3;&#x8BBA;&#x3002;&#x552F;&#x4E00;&#x7684;&#x5904;&#x7406;&#x65B9;&#x5F0F;&#x662F;&#x201C;&#x8F6F;&#x5316;&#x201D;&#x65B9;&#x6CD5;&#xFF0C;&#x7ED3;&#x679C;&#x662F;&#x201C;&#x79D1;&#x5B66;&#x8F6C;&#x5316;&#x4E3A;&#x610F;&#x8BC6;&#x5F62;&#x6001;&#x201D;&#x3002;&#x201C;&#x5176;&#x6838;&#x5FC3;&#x601D;&#x60F3;&#x610F;&#x5473;&#x7740;&#x4E0D;&#x662F;&#x7814;&#x7A76;&#xFF0C;&#x800C;&#x662F;&#x4FE1;&#x4EF0;&#x3002;&#x201D;&#x4ECE;&#x8FD9;&#x4E00;&#x70B9;&#x51FA;&#x53D1;&#xFF0C;&#x4EBA;&#x4EEC;&#x5FC5;&#x987B;&#x610F;&#x8BC6;&#x5230;&#x79D1;&#x5B66;&#x81EA;&#x8EAB;&#x672A;&#x80FD;&#x963B;&#x6B62;&#x7684;&#x6240;&#x6709;&#x6F0F;&#x6D1E;&#x2026;&#x201D;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x6240;&#x8FFD;&#x6C42;&#x7684;&#x77E5;&#x8BC6;&#x4E0D;&#x662F;&#x7531;&#x6CD5;&#x5F8B;&#x800C;&#x662F;&#x7531;&#x4E16;&#x754C;&#x89C2;&#x6765;&#x7EDF;&#x6CBB;&#x7684;&#x8BDD;&#xFF0C;&#x90A3;&#x4E48;&#x8BA9;&#x6211;&#x4EEC;&#x653E;&#x5F03;&#x79D1;&#x5B66;&#x65B9;&#x6CD5;&#x4F3C;&#x4E4E;&#x662F;&#x5408;&#x9002;&#x7684;&#xFF0C;&#x751A;&#x81F3;&#x53EF;&#x80FD;&#x91C7;&#x7528;&#x4E0E;&#x540E;&#x8005;&#x5B8C;&#x5168;&#x76F8;&#x53CD;&#x7684;&#x539F;&#x5219;&#x3002;&#x8FD9;&#x6070;&#x6070;&#x5C31;&#x662F;&#x827A;&#x672F;&#x4E2D;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x4E00;&#x79CD;&#x77E5;&#x8BC6;&#x7684;&#x521B;&#x9020;&#x8005;&#x5E76;&#x6CA1;&#x6709;&#x4E1D;&#x6BEB;&#x7684;&#x5174;&#x8DA3;&#x6765;&#x5C06;&#x81EA;&#x5DF1;&#x4ECE;&#x521B;&#x4F5C;&#x4E2D;&#x89E3;&#x8131;&#x51FA;&#x6765;&#x3002;&#x201C;</p>
</li>
<li><p>Of particular relevance to the understanding of a new interpenetration of art and science is the generative nature of either area, which brings forth words or world-views of its own. For that reason, &#xAB;the worlds of art and science are ideologically no longer opposites,&#xBB; as Ilya Prigogine states, &#xAB;the variety of the significates and the basic opacity of the world are reflected in new languages and new formalisms.&#xBB; [^7]<br>&#x4E0E;&#x7406;&#x89E3;&#x827A;&#x672F;&#x4E0E;&#x79D1;&#x5B66;&#x7684;&#x65B0;&#x76F8;&#x4E92;&#x6E17;&#x900F;&#x7279;&#x522B;&#x76F8;&#x5173;&#x7684;&#x662F;&#x4EFB;&#x4F55;&#x4E00;&#x4E2A;&#x9886;&#x57DF;&#x7684;&#x751F;&#x6210;&#x6027;&#x8D28;&#xFF0C;&#x5B83;&#x5E26;&#x6765;&#x4E86;&#x81EA;&#x5DF1;&#x7684;&#x6587;&#x5B57;&#x6216;&#x4E16;&#x754C;&#x89C2;&#x3002; &#x51FA;&#x4E8E;&#x8FD9;&#x4E2A;&#x539F;&#x56E0;&#xFF0C;&#x201C;&#x827A;&#x672F;&#x548C;&#x79D1;&#x5B66;&#x7684;&#x4E16;&#x754C;&#x5728;&#x610F;&#x8BC6;&#x5F62;&#x6001;&#x4E0A;&#x4E0D;&#x518D;&#x662F;&#x5BF9;&#x7ACB;&#x7684;&#xFF0C;&#x201D;&#x6B63;&#x5982;Ilya Prigogine&#x6240;&#x8BF4;&#xFF0C;&#x201C;&#x4E16;&#x754C;&#x7684;&#x5404;&#x79CD;&#x610F;&#x4E49;&#x548C;&#x57FA;&#x672C;&#x7684;&#x4E0D;&#x900F;&#x660E;&#x6027;&#x90FD;&#x53CD;&#x6620;&#x5728;&#x65B0;&#x8BED;&#x8A00;&#x548C;&#x65B0;&#x5F62;&#x5F0F;&#x4E3B;&#x4E49;&#x4E2D;&#x3002;&#x201D;</p>
</li>
</ol>
<p>:::info<br>&#x5218;&#x8FEA;&#x5148; 5~7<br>:::</p>
<h3 id="The-origins-of-information-theory"><a href="#The-origins-of-information-theory" class="headerlink" title="The origins of information theory"></a>The origins of information theory</h3><h3 id="&#x4FE1;&#x606F;&#x8BBA;&#x8D77;&#x6E90;"><a href="#&#x4FE1;&#x606F;&#x8BBA;&#x8D77;&#x6E90;" class="headerlink" title="&#x4FE1;&#x606F;&#x8BBA;&#x8D77;&#x6E90;"></a>&#x4FE1;&#x606F;&#x8BBA;&#x8D77;&#x6E90;</h3><p>:::success</p>
<h6 id="&#x5BFF;&#x76DB;&#x6960;8-11"><a href="#&#x5BFF;&#x76DB;&#x6960;8-11" class="headerlink" title="&#x5BFF;&#x76DB;&#x6960;8-11"></a>&#x5BFF;&#x76DB;&#x6960;8-11</h6><p>:::</p>
<ol start="8">
<li><p>The technological revolution received its fundamental impetus from the first industrial revolution in the nineteenth century. By starting up a process of mechanization, the industrial revolution triggered the phenomenon of crises of control. [^8] The mounting production levels resulting from mechanization led to the need for control systems to accelerate the flow of information. Researchers began to seek solutions in feedback techniques, automatic control systems, and information processing.<br>&#x6280;&#x672F;&#x9769;&#x547D;&#x4ECE;19&#x4E16;&#x7EAA;&#x7B2C;&#x4E00;&#x6B21;&#x5DE5;&#x4E1A;&#x9769;&#x547D;&#x90A3;&#x91CC;&#x83B7;&#x5F97;&#x4E86;&#x6839;&#x672C;&#x6027;&#x7684;&#x63A8;&#x52A8;&#x529B;&#x3002;&#x968F;&#x7740;&#x673A;&#x68B0;&#x5316;&#x7684;&#x5F00;&#x5C55;&#xFF0C;&#x5DE5;&#x4E1A;&#x9769;&#x547D;&#x6263;&#x54CD;&#x4E86;&#x63A7;&#x5236;&#x5371;&#x673A;&#x8FD9;&#x4E00;&#x73B0;&#x8C61;&#x7684;&#x6273;&#x673A;&#x3002; [8]&#x673A;&#x68B0;&#x5316;&#x5E26;&#x6765;&#x7684;&#x751F;&#x4EA7;&#x6C34;&#x5E73;&#x7684;&#x9012;&#x589E;&#x6FC0;&#x8D77;&#x4E86;&#x4EBA;&#x4EEC;&#x5BF9;&#x63A7;&#x5236;&#x7CFB;&#x7EDF;&#x7684;&#x9700;&#x6C42;&#xFF0C;&#x4EE5;&#x6B64;&#x6765;&#x52A0;&#x901F;&#x4FE1;&#x606F;&#x6D41;&#x52A8;&#x3002;&#x7814;&#x7A76;&#x4EBA;&#x5458;&#x5F00;&#x59CB;&#x5728;&#x53CD;&#x9988;&#x6280;&#x672F;&#x3001;&#x81EA;&#x52A8;&#x63A7;&#x5236;&#x7CFB;&#x7EDF;&#x548C;&#x4FE1;&#x606F;&#x5904;&#x7406;&#x65B9;&#x9762;&#x5BFB;&#x6C42;&#x89E3;&#x51B3;&#x529E;&#x6CD5;&#x3002;</p>
</li>
<li><p>Under the title &#xAB;On Governors&#xBB; in 1868, Clerk Maxwell presented the first theoretical study towards an analysis of control and feedback mechanisms, so ushering in the radical transformation in automatic control engineering. By the late nineteenth century, a series of developments and technical innovations wereunderway that in the 1940s would serve as the basis of a new theory, namely cybernetics. [^9]<br>1868&#x5E74;&#xFF0C;&#x5728;&#x9898;&#x4E3A;&#x201C;On Governors&#x201D;&#x7684;&#x4E00;&#x6587;&#x4E2D;&#xFF0C;Clerk Maxwell&#x9996;&#x6B21;&#x53D1;&#x8868;&#x4E86;&#x5BF9;&#x63A7;&#x5236;&#x673A;&#x5236;&#x548C;&#x53CD;&#x9988;&#x673A;&#x5236;&#x8FDB;&#x884C;&#x5206;&#x6790;&#x7684;&#x7406;&#x8BBA;&#x7814;&#x7A76;&#xFF0C;&#x4ECE;&#x800C;&#x5F15;&#x53D1;&#x4E86;&#x81EA;&#x52A8;&#x63A7;&#x5236;&#x5DE5;&#x7A0B;&#x9886;&#x57DF;&#x7684;&#x6FC0;&#x8FDB;&#x53D8;&#x9769;&#x3002;&#x5230;&#x5341;&#x4E5D;&#x4E16;&#x7EAA;&#x540E;&#x671F;&#xFF0C;&#x4E00;&#x7CFB;&#x5217;&#x7684;&#x53D1;&#x5C55;&#x548C;&#x6280;&#x672F;&#x9769;&#x65B0;&#x6B63;&#x5728;&#x8FDB;&#x884C;&#xFF0C;&#x5373;&#x5C06;&#x5728;20&#x4E16;&#x7EAA;40&#x5E74;&#x4EE3;&#x6210;&#x4E3A;&#x65B0;&#x7406;&#x8BBA;&#x7684;&#x57FA;&#x7840;&#xFF0C;&#x5373;&#x63A7;&#x5236;&#x8BBA;&#x3002; [9]</p>
</li>
<li><p>The control revolution produced not only feedback techniques and a new hierarchization of media, but also revolutionized the cultural reproduction forms of society. [^10] This included areas like communications and art, since the technologies exercised a direct influence on the forms of sociocultural (re)production.<br>&#x63A7;&#x5236;&#x9769;&#x547D;&#x4E0D;&#x4EC5;&#x4EA7;&#x751F;&#x4E86;&#x53CD;&#x9988;&#x6280;&#x672F;&#x3001;&#x9020;&#x5C31;&#x4E86;&#x65B0;&#x7684;&#x5A92;&#x4F53;&#x5206;&#x5C42;&#xFF0C;&#x800C;&#x4E14;&#x8FD8;&#x9769;&#x65B0;&#x4E86;&#x793E;&#x4F1A;&#x7684;&#x6587;&#x5316;&#x518D;&#x751F;&#x4EA7;&#x5F62;&#x5F0F;&#x3002; [10]&#x8FD9;&#x5176;&#x4E2D;&#x4FBF;&#x5305;&#x62EC;&#x4E86;&#x8BF8;&#x5982;&#x901A;&#x4FE1;&#x548C;&#x827A;&#x672F;&#x7B49;&#x9886;&#x57DF;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x4E9B;&#x6280;&#x672F;&#x76F4;&#x63A5;&#x5F71;&#x54CD;&#x5230;&#x4E86;&#x793E;&#x4F1A;&#x6587;&#x5316;&#xFF08;&#x518D;&#xFF09;&#x751F;&#x4EA7;&#x7684;&#x5F62;&#x5F0F;&#x3002;</p>
</li>
<li><p>Until then, nevertheless, the themes associated with control mechanisms and automation were discussed in connection with only one common parameter, namely energy. As the basic concept of Newtonian mechanics, energy retained the same position in the natural sciences and in research fields like acoustics, electrical science, and optics. The invariant of &#x2039;mass&#x203A; similarly occupied a central position in physics. However, as production techniques continued to be improved, so the relationship of human and machine began to change likewise, leading to the emergence of questions about new terms and theories able to make this communication process between biological and technological systems the object of targeted research.<br>&#x800C;&#x5728;&#x90A3;&#x4E4B;&#x524D;&#xFF0C;&#x4E0E;&#x63A7;&#x5236;&#x673A;&#x5236;&#x548C;&#x81EA;&#x52A8;&#x5316;&#x76F8;&#x5173;&#x7684;&#x4E3B;&#x9898;&#x53EA;&#x4E0E;&#x4E00;&#x4E2A;&#x901A;&#x7528;&#x53C2;&#x6570;&#x6709;&#x5173;&#xFF0C;&#x5373;&#x80FD;&#x91CF;&#x3002;&#x4F5C;&#x4E3A;&#x725B;&#x987F;&#x529B;&#x5B66;&#x7684;&#x57FA;&#x672C;&#x6982;&#x5FF5;&#xFF0C;&#x80FD;&#x91CF;&#x5728;&#x81EA;&#x7136;&#x79D1;&#x5B66;&#x3001;&#x58F0;&#x5B66;&#x3001;&#x7535;&#x5B50;&#x79D1;&#x5B66;&#x548C;&#x5149;&#x5B66;&#x7B49;&#x7814;&#x7A76;&#x9886;&#x57DF;&#x4FDD;&#x6709;&#x540C;&#x6837;&#x7684;&#x5730;&#x4F4D;&#x3002; (mass)&#x7684;&#x4E0D;&#x53D8;&#x6027;&#x540C;&#x6837;&#x5728;&#x7269;&#x7406;&#x5B66;&#x4E2D;&#x5360;&#x636E;&#x4E86;&#x4E2D;&#x5FC3;&#x4F4D;&#x7F6E;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x968F;&#x7740;&#x751F;&#x4EA7;&#x6280;&#x672F;&#x7684;&#x4E0D;&#x65AD;&#x5B8C;&#x5584;&#xFF0C;&#x4EBA;&#x4E0E;&#x673A;&#x5668;&#x7684;&#x5173;&#x7CFB;&#x4E5F;&#x5F00;&#x59CB;&#x53D1;&#x751F;&#x53D8;&#x5316;&#xFF0C;&#x5BFC;&#x81F4;&#x51FA;&#x73B0;&#x4E86;&#x4E00;&#x4E9B;&#x5173;&#x4E8E;&#x65B0;&#x672F;&#x8BED;&#x548C;&#x65B0;&#x7406;&#x8BBA;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x8FD9;&#x4E9B;&#x65B0;&#x7684;&#x672F;&#x8BED;&#x548C;&#x7406;&#x8BBA;&#x80FD;&#x4F7F;&#x751F;&#x7269;&#x7CFB;&#x7EDF;&#x548C;&#x6280;&#x672F;&#x7CFB;&#x7EDF;&#x4E4B;&#x95F4;&#x7684;&#x4EA4;&#x6D41;&#x8FC7;&#x7A0B;&#x6210;&#x4E3A;&#x6709;&#x9488;&#x5BF9;&#x6027;&#x7684;&#x7814;&#x7A76;&#x5BF9;&#x8C61;&#x3002;</p>
</li>
</ol>
<h3 id="The-constitution-of-two-new-disciplines-cybernetics-and-artificial-intelligence"><a href="#The-constitution-of-two-new-disciplines-cybernetics-and-artificial-intelligence" class="headerlink" title="The constitution of two new disciplines: cybernetics and artificial intelligence"></a>The constitution of two new disciplines: cybernetics and artificial intelligence</h3><h3 id="&#x4E24;&#x4E2A;&#x65B0;&#x5B66;&#x79D1;&#x7684;&#x6784;&#x6210;&#xFF1A;&#x63A7;&#x5236;&#x8BBA;&#x4E0E;&#x4EBA;&#x5DE5;&#x667A;&#x80FD;"><a href="#&#x4E24;&#x4E2A;&#x65B0;&#x5B66;&#x79D1;&#x7684;&#x6784;&#x6210;&#xFF1A;&#x63A7;&#x5236;&#x8BBA;&#x4E0E;&#x4EBA;&#x5DE5;&#x667A;&#x80FD;" class="headerlink" title="&#x4E24;&#x4E2A;&#x65B0;&#x5B66;&#x79D1;&#x7684;&#x6784;&#x6210;&#xFF1A;&#x63A7;&#x5236;&#x8BBA;&#x4E0E;&#x4EBA;&#x5DE5;&#x667A;&#x80FD;"></a>&#x4E24;&#x4E2A;&#x65B0;&#x5B66;&#x79D1;&#x7684;&#x6784;&#x6210;&#xFF1A;&#x63A7;&#x5236;&#x8BBA;&#x4E0E;&#x4EBA;&#x5DE5;&#x667A;&#x80FD;</h3><ol start="12">
<li><p>That society can only be understood through a study of the messages and the communication facilities which belong to it; and that in the future development of these messages and communication facilities, messages between man and machines, between machines and man, and between machine and machine, are destined to play an ever increasing part,&#xBB; [^11] was the key idea of the American mathematician Norbert Wiener (1894&#x2013;1964), which he elaborated in his book &#xAB;The Human Use of Human Beings. Cybernetics and Society,&#xBB; published in 1950 after a first technical study &#xAB;Cybernetic, or Control and Communication in the Animal and in the Machine&#xBB; of 1948. In 1950 likewise, the British mathematician Alan Turing (1912&#x2013;1954) raised the question of the feasibility of logical thought by machines. In his essay &#xAB;Computing Machinery and Intelligence,&#xBB; published in volume 59 of the philosophical journal &#xAB;Mind,&#xBB; Turing proceeds from the basic question with which his text begins: &#xAB;Can machines think?&#xBB;<br>&#x53EA;&#x6709;&#x901A;&#x8FC7;&#x7814;&#x7A76;&#x5C5E;&#x4E8E;&#x5B83;&#x7684;&#x4FE1;&#x606F;&#x548C;&#x901A;&#x4FE1;&#x8BBE;&#x65BD;&#x624D;&#x80FD;&#x7406;&#x89E3;&#x201C;&#x793E;&#x4F1A;&#x201D;&#xFF1B;&#x800C;&#x4E14;&#x5728;&#x8FD9;&#x4E9B;&#x4FE1;&#x606F;&#x548C;&#x901A;&#x4FE1;&#x8BBE;&#x65BD;&#x7684;&#x672A;&#x6765;&#x53D1;&#x5C55;&#x4E2D;&#xFF0C;&#x4EBA;&#x4E0E;&#x673A;&#x5668;&#x4E4B;&#x95F4;&#xFF0C;&#x673A;&#x5668;&#x4E0E;&#x4EBA;&#x4E4B;&#x95F4;&#xFF0C;&#x673A;&#x5668;&#x4E0E;&#x673A;&#x5668;&#x4E4B;&#x95F4;&#x7684;&#x4FE1;&#x606F;&#x6CE8;&#x5B9A;&#x5C06;&#x4F1A;&#x53D1;&#x6325;&#x8D8A;&#x6765;&#x8D8A;&#x5927;&#x7684;&#x4F5C;&#x7528;&#xFF0C;&#x201C;[11]&#x662F;&#x7F8E;&#x56FD;&#x91CD;&#x8981;&#x601D;&#x60F3;&#x5BB6;&#x4E0E;&#x6570;&#x5B66;&#x5BB6;&#x8BFA;&#x4F2F;&#x7279;&#xB7;&#x7EF4;&#x7EB3;&#xFF08;Norbert Wiener&#xFF0C;1894-1964&#xFF09;&#xFF0C;&#x5728;&#x4ED6;&#x7684;&#x4E66;&#x300A;&#x4EBA;&#x7C7B;&#x7684;&#x4EBA;&#x7C7B;&#x4F7F;&#x7528;&#xFF0C;&#x63A7;&#x5236;&#x8BBA;&#x4E0E;&#x793E;&#x4F1A;&#x300B;&#x4E00;&#x4E66;&#x4E2D;&#x8BE6;&#x7EC6;&#x9610;&#x8FF0;&#x4E86;&#x8FD9;&#x4E00;&#x70B9;&#x3002; &#x8BE5;&#x4E66;&#x4E8E;1950&#x5E74;&#x53D1;&#x8868;&#xFF0C;&#x7ECF;&#x8FC7;&#x7B2C;&#x4E00;&#x6B21;&#x6280;&#x672F;&#x7814;&#x7A76;&#x300A;1948&#x5E74;&#x52A8;&#x7269;&#x548C;&#x673A;&#x5668;&#x4E2D;&#x7684;&#x63A7;&#x5236;&#x4E0E;&#x6C9F;&#x901A;&#x300B;&#x4E4B;&#x540E;&#x3002;&#x5728;1950&#x5E74;&#xFF0C;&#x540C;&#x6837;&#xFF0C;&#x82F1;&#x56FD;&#x6570;&#x5B66;&#x5BB6;&#x827E;&#x4F26;&#x56FE;&#x7075;&#xFF08;1912-1954&#xFF09;&#x63D0;&#x51FA;&#x4E86;&#x673A;&#x5668;&#x903B;&#x8F91;&#x601D;&#x7EF4;&#x7684;&#x53EF;&#x884C;&#x6027;&#x3002;&#x5728;&#x54F2;&#x5B66;&#x6742;&#x5FD7;&#x300A;&#x5FC3;&#x300B;&#x201D;&#x7B2C;59&#x5377;&#x53D1;&#x8868;&#x7684;&#x8BBA;&#x6587;&#xAB;&#x8BA1;&#x7B97;&#x673A;&#x68B0;&#x4E0E;&#x60C5;&#x62A5;&#xBB;&#x4E4B;&#x4E2D;&#xFF0C;&#x56FE;&#x7075;&#x4ECE;&#x4ED6;&#x7684;&#x6587;&#x672C;&#x5F00;&#x59CB;&#x7684;&#x57FA;&#x672C;&#x95EE;&#x9898;&#x51FA;&#x53D1;&#xFF1A;&#x201C;&#x673A;&#x5668;&#x80FD;&#x601D;&#x8003;&#x5417;&#xFF1F;&#x201D;</p>
</li>
<li><p>Until the mid-twentieth century no more than a few researchers working in isolation were concerned with subjects such as communication between dissimilar systems (for instance, biological and technical systems), or with the feasibility of technically designing thought machines. In addition to Wiener and Turing their ranks included Charles Babbage, Claude Shannon, Warren Weaver and Hermann Schmidt. However, from the 1950s on these subjects rapidly became two fields of basic research: cybernetics and Artificial Intelligence. [^12] The two aforementioned texts triggered a flood of publications containing speculation and analysis on these subjects. In the first three years after 1950 alone, more than a thousand essays published dealt with intelligence and with communication with and between machines. Yet, when Turing published his essay there existed no more than four digital computers worldwide (Mark I and EDSAC in England, ENIAC and BINAC in the USA). [^13] Although Turing&#x2019;s theorem&#x2014;everything the human mind can do in the form of an algorithm can also be carried out by a Universal Turing Machine&#x2014;was based on models so far investigated only as a hypothetical experiment, several researchers were inspired to empirically confirm or disprove it by building machines.<br>&#x4E00;&#x76F4;&#x5230;&#x4E8C;&#x5341;&#x4E16;&#x7EAA;&#x4E2D;&#x53F6;&#xFF0C;&#x53EA;&#x6709;&#x5F88;&#x5C11;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x7814;&#x7A76;&#x4EBA;&#x5458;&#x5728;&#x5173;&#x6CE8;&#x8BF8;&#x5982;&#x4E0D;&#x540C;&#x7CFB;&#x7EDF;&#xFF08;&#x4F8B;&#x5982;&#x751F;&#x7269;&#x7CFB;&#x7EDF;&#x548C;&#x6280;&#x672F;&#x7CFB;&#x7EDF;&#xFF09;&#x4E4B;&#x95F4;&#x7684;&#x901A;&#x4FE1;&#x6216;&#x8005;&#x4ECE;&#x6280;&#x672F;&#x4E0A;&#x8BBE;&#x8BA1;&#x601D;&#x60F3;&#x673A;&#x5668;&#x7684;&#x53EF;&#x884C;&#x6027;&#x7B49;&#x7B49;&#x4E3B;&#x9898;&#x3002;&#x9664;&#x4E86;&#x7EF4;&#x7EB3;&#x548C;&#x56FE;&#x7075;&#x4E4B;&#x5916;&#xFF0C;&#x4ED6;&#x4EEC;&#xFF08;&#x5B66;&#x8005;&#xFF09;&#x7684;&#x961F;&#x4F0D;&#x8FD8;&#x5305;&#x62EC;&#x67E5;&#x5C14;&#x65AF;&#x5DF4;&#x8D1D;&#x5947;&#xFF0C;&#x514B;&#x52B3;&#x5FB7;&#x9999;&#x519C;&#xFF0C;&#x6C83;&#x4F26;&#x97E6;&#x5F17;&#x548C;&#x8D6B;&#x5C14;&#x66FC;&#x65BD;&#x5BC6;&#x7279;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x4ECE;20&#x4E16;&#x7EAA;50&#x5E74;&#x4EE3;&#x5F00;&#x59CB;&#xFF0C;&#x8FD9;&#x4E9B;&#x4E3B;&#x9898;&#x8FC5;&#x901F;&#x6F14;&#x53D8;&#x4E3A;&#x57FA;&#x7840;&#x7814;&#x7A76;&#x7684;&#x4E24;&#x4E2A;&#x9886;&#x57DF;&#xFF1A;&#x63A7;&#x5236;&#x8BBA;&#x548C;&#x4EBA;&#x5DE5;&#x667A;&#x80FD;&#x3002; [12]&#x4E0A;&#x8FF0;&#x4E24;&#x7BC7;&#x6587;&#x7AE0;&#x5F15;&#x53D1;&#x4E86;&#x5927;&#x91CF;&#x7684;&#x51FA;&#x7248;&#x7269;&#x7684;&#x51FA;&#x7248;&#xFF0C;&#x5176;&#x4E2D;&#x5305;&#x62EC;&#x5BF9;&#x8FD9;&#x4E9B;&#x4E3B;&#x9898;&#x7684;&#x731C;&#x6D4B;&#x548C;&#x5206;&#x6790;&#x3002;&#x5728;1950&#x5E74;&#x4EE5;&#x540E;&#x7684;&#x5934;&#x4E09;&#x5E74;&#x4E4B;&#x4E2D;&#xFF0C;&#x53D1;&#x8868;&#x7684;&#x8BBA;&#x6587;&#x8D85;&#x8FC7;&#x4E00;&#x5343;&#x7BC7;&#xFF0C;&#x6D89;&#x53CA;&#x667A;&#x80FD;&#x548C;&#x673A;&#x5668;&#x95F4;&#x7684;&#x6C9F;&#x901A;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x5F53;&#x56FE;&#x7075;&#x53D1;&#x8868;&#x4ED6;&#x7684;&#x6587;&#x7AE0;&#x65F6;&#xFF0C;&#x4E16;&#x754C;&#x4E0A;&#x6570;&#x5B57;&#x8BA1;&#x7B97;&#x673A;&#x4E0D;&#x8D85;&#x8FC7;&#x56DB;&#x53F0;&#xFF08;&#x82F1;&#x683C;&#x5170;&#x7684;Mark I&#x548C;EDSAC&#xFF0C;&#x7F8E;&#x56FD;&#x7684;ENIAC&#x548C;BINAC&#xFF09;&#x3002; [13]&#x867D;&#x7136;&#x56FE;&#x7075;&#x5B9A;&#x7406; - &#x4EBA;&#x7C7B;&#x5927;&#x8111;&#x80FD;&#x591F;&#x4EE5;&#x7B97;&#x6CD5;&#x7684;&#x5F62;&#x5F0F;&#x505A;&#x7684;&#x6240;&#x6709;&#x4E8B;&#x60C5;&#x4E5F;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x901A;&#x7528;&#x56FE;&#x7075;&#x673A;&#x6765;&#x5B9E;&#x73B0; - &#x57FA;&#x4E8E;&#x8FC4;&#x4ECA;&#x4E3A;&#x6B62;&#x53EA;&#x4F5C;&#x4E3A;&#x5047;&#x8BBE;&#x5B9E;&#x9A8C;&#x8FDB;&#x884C;&#x8FC7;&#x8C03;&#x67E5;&#x7684;&#x6A21;&#x578B;&#xFF0C;&#x4F46;&#x51E0;&#x4F4D;&#x7814;&#x7A76;&#x4EBA;&#x5458;&#x53D7;&#x5230;&#x542F;&#x53D1;&#x4EE5;&#x51ED;&#x7ECF;&#x9A8C;&#x8BC1;&#x5B9E;&#x6216;&#x8005;&#x901A;&#x8FC7;&#x5EFA;&#x9020;&#x673A;&#x5668;&#x6765;&#x8FDB;&#x884C;&#x53CD;&#x9A73;&#x3002;</p>
</li>
</ol>
<p>:::info</p>
<h4 id="&#x51AF;&#x6D69;&#x796F;11-13"><a href="#&#x51AF;&#x6D69;&#x796F;11-13" class="headerlink" title="&#x51AF;&#x6D69;&#x796F;11 ~ 13"></a>&#x51AF;&#x6D69;&#x796F;11 ~ 13</h4><p>:::</p>
<h3 id="Communication"><a href="#Communication" class="headerlink" title="Communication"></a>Communication</h3><ol start="14">
<li>The approach of cybernetics&#x2014;a name derived from the Greek term &#x2039;kybernetes&#x203A; (steersman)&#x2014;consists in transferring the theory of control and message transmission, whether in the machine or in a living being, to the fields of communication and machine control. The objective is to investigate the relationships between animal and machine, and in the case of the machine the specific mode of its behavior, as a characteristic of the performance to be expected. [14]<br>&#x63A7;&#x5236;&#x8BBA;&#x7684;&#x65B9;&#x6CD5; &#x2014;&#x2014; &#x4E00;&#x4E2A;&#x6E90;&#x4E8E;&#x5E0C;&#x814A;&#x8BED;<kybernetes>&#xFF08;&#x8235;&#x624B;&#xFF09;&#x7684;&#x540D;&#x79F0; &#x2014;&#x2014; &#x5C06;&#x65E0;&#x8BBA;&#x662F;&#x5728;&#x673A;&#x5668;&#x8FD8;&#x662F;&#x5728;&#x751F;&#x7269;&#x4F53;&#x4E2D;&#x7684;&#x63A7;&#x5236;&#x548C;&#x4FE1;&#x606F;&#x4F20;&#x8F93;&#x7406;&#x8BBA;&#xFF0C;&#x90FD;&#x8F6C;&#x79FB;&#x5230;&#x4E86;&#x4FE1;&#x606F;&#x4EA4;&#x6D41;&#x4E0E;&#x673A;&#x5668;&#x63A7;&#x5236;&#x9886;&#x57DF;&#x3002;&#x5176;&#x76EE;&#x7684;&#x662F;&#x8C03;&#x67E5;&#x5206;&#x6790;&#x52A8;&#x7269;&#x548C;&#x673A;&#x5668;&#x4E4B;&#x95F4;&#x7684;&#x5173;&#x7CFB;&#xFF0C;&#x4EE5;&#x53CA;&#x4EE5;&#x673A;&#x5668;&#x7684;&#x7279;&#x5B9A;&#x884C;&#x4E3A;&#x6A21;&#x5F0F;&#xFF0C;&#x4F5C;&#x4E3A;&#x9884;&#x671F;&#x6027;&#x80FD;&#x7684;&#x4E00;&#x4E2A;&#x7279;&#x5F81;&#x3002;[14]</kybernetes></li>
</ol>
<ol start="15">
<li>On the basis of the observation of certain analogies between machines and living organisms, the mathematician asserts that no reason actually exists not to make a machine resemble a human being, since one and the other develop tendencies toward decreasing entropy, meaning that both are examples of local anti-entropic phenomena.<br>&#x5728;&#x89C2;&#x5BDF;&#x673A;&#x5668;&#x548C;&#x751F;&#x7269;&#x4F53;&#x4E4B;&#x95F4;&#x7684;&#x67D0;&#x4E9B;&#x76F8;&#x4F3C;&#x6027;&#x7684;&#x57FA;&#x7840;&#x4E0A;&#xFF0C;&#x6570;&#x5B66;&#x5BB6;&#x65AD;&#x8A00;&#xFF0C;&#x5B9E;&#x9645;&#x4E0A;&#x673A;&#x5668;&#x4E0E;&#x4EBA;&#x7C7B;&#x662F;&#x6709;&#x7406;&#x7531;&#x76F8;&#x4F3C;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x4ED6;&#x4EEC;&#x90FD;&#x503E;&#x5411;&#x4E8E;&#x71B5;&#x51CF;&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x4E24;&#x8005;&#x90FD;&#x6709;&#x5C40;&#x90E8;anti-entropic&#xFF08;&#x53CD;&#x71B5;&#xFF09;&#x7684;&#x73B0;&#x8C61;&#x3002;</li>
</ol>
<ol start="16">
<li>Turing likewise conceded priority to the subject of communication. His famous experiment&#x2014;the imitationgame, as he called it, also known as the Church-Turing thesis or Turing Theorem&#x2014;for verifying the intelligence of a computer was concerned less with the actual construction of such a machine than with simulating with machines the human capability of communication. Turing was here acting in line with a tradition of measuring the faculty of thought by the ability to use human language. Descartes had already presented the logically semantic usage of language as a criterion for identifying thinking beings. For a long time, the mastery of semantics would remain a basic problem of Artificial Intelligence.<br>&#x56FE;&#x7075;&#x540C;&#x6837;&#x5C06;&#x91CD;&#x70B9;&#x653E;&#x5728;&#x4EA4;&#x6D41;&#x4E0A;&#x3002; &#x4ED6;&#x8457;&#x540D;&#x7684;&#x5B9E;&#x9A8C; &#x2014;&#x2014; &#x4ED6;&#x79F0;&#x4E4B;&#x4E3A;&#x201C;&#x6A21;&#x4EFF;&#x6E38;&#x620F;&#x201D;&#xFF0C;&#x4E5F;&#x88AB;&#x79F0;&#x4E3A;Church-Turing thesis&#xFF08;&#x4E18;&#x5947;-&#x56FE;&#x7075;&#x8BBA;&#x9898;&#xFF09;&#x6216;Turing Theorem&#xFF08;&#x56FE;&#x7075;&#x5B9A;&#x7406;&#xFF09; &#x2014;&#x2014; &#x8BC1;&#x660E;&#x8BA1;&#x7B97;&#x673A;&#x7684;&#x667A;&#x80FD;&#x4E0E;&#x673A;&#x5668;&#x6A21;&#x62DF;&#x4EBA;&#x6C9F;&#x901A;&#x7684;&#x80FD;&#x529B;&#x76F8;&#x5173;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x4E0E;&#x8FD9;&#x79CD;&#x673A;&#x5668;&#x7684;&#x5B9E;&#x9645;&#x6784;&#x9020;&#x76F8;&#x5173;&#x3002;&#x7B1B;&#x5361;&#x5C14;&#x5DF2;&#x7ECF;&#x5C06;&#x8BED;&#x8A00;&#x7684;&#x903B;&#x8F91;&#x8BED;&#x4E49;&#x7528;&#x6CD5;&#x4F5C;&#x4E3A;&#x8BC6;&#x522B;&#x601D;&#x7EF4;&#x5B58;&#x5728;&#x7684;&#x6807;&#x51C6;&#x3002; &#x5728;&#x5F88;&#x957F;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x91CC;&#xFF0C;&#x8BED;&#x4E49;&#x7684;&#x638C;&#x63E1;&#x4ECD;&#x7136;&#x662F;&#x4EBA;&#x5DE5;&#x667A;&#x80FD;&#x7684;&#x4E00;&#x4E2A;&#x57FA;&#x672C;&#x95EE;&#x9898;&#x3002;<blockquote>
</blockquote>
</li>
</ol>
<h3 id="Information"><a href="#Information" class="headerlink" title="Information"></a>Information</h3><ol start="17">
<li>In contrast to that tradition Wiener&#x2019;s cybernetics sought operational ways of developing a specific language that would enable communication between dissimilar systems, and aimed to adapt semantics to specific goals in the process. Viewed from this perspective, Wiener&#x2019;s theory replaced the notion of energy with that of information as the elementary parameter of communication, and thus postulated the definition of this new invariant for cybernetic science as a whole, which is a basic prerequisite for understanding the range of the cybernetic approach.<br>&#x4E0E;&#x4F20;&#x7EDF;&#x76F8;&#x53CD;&#xFF0C;Wiener&#x2019;s&#xFF08;&#x7EF4;&#x7EB3;&#x7684;&#xFF09;&#x63A7;&#x5236;&#x8BBA;&#x5BFB;&#x6C42;&#x5F00;&#x53D1;&#x4E00;&#x79CD;&#x80FD;&#x591F;&#x5728;&#x4E0D;&#x540C;&#x7CFB;&#x7EDF;&#x4E4B;&#x95F4;&#x8FDB;&#x884C;&#x901A;&#x4FE1;&#x7684;&#x7279;&#x5B9A;&#x8BED;&#x8A00;&#x7684;&#x64CD;&#x4F5C;&#x65B9;&#x5F0F;&#xFF0C;&#x5E76;&#x4E14;&#x65E8;&#x5728;&#x8FC7;&#x7A0B;&#x4E2D;&#x4F7F;&#x8BED;&#x4E49;&#x9002;&#x5E94;&#x7684;&#x7279;&#x5B9A;&#x7684;&#x76EE;&#x6807;&#x3002;&#x4ECE;&#x8FD9;&#x4E2A;&#x89D2;&#x5EA6;&#x6765;&#x770B;&#xFF0C;Wiener&#x2019;s&#xFF08;&#x7EF4;&#x7EB3;&#x7684;&#xFF09;&#x7406;&#x8BBA;&#x7528;&#x4F5C;&#x4E3A;&#x4EA4;&#x6D41;&#x7684;&#x57FA;&#x672C;&#x53C2;&#x6570;&#x7684;&#x4FE1;&#x606F;&#x53D6;&#x4EE3;&#x4E86;&#x80FD;&#x91CF;&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x5E76;&#x56E0;&#x6B64;&#x5047;&#x5B9A;&#x8FD9;&#x4E2A;&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x6574;&#x4F53;&#x7684;&#x65B0;&#x7684;&#x63A7;&#x5236;&#x8BBA;&#x79D1;&#x5B66;&#x4E0D;&#x53D8;&#x91CF;&#x7684;&#x5B9A;&#x4E49;&#xFF0C;&#x8FD9;&#x662F;&#x7406;&#x89E3;&#x63A7;&#x5236;&#x8BBA;&#x65B9;&#x6CD5;&#x5DE5;&#x4F5C;&#x8303;&#x56F4;&#x7684;&#x4E00;&#x4E2A;&#x57FA;&#x672C;&#x5148;&#x51B3;&#x6761;&#x4EF6;&#x3002;</li>
</ol>
<ol start="18">
<li><p>Unlike Newton&#x2019;s mechanics, which operates with closed systems, information is applied to open systems. In this way it must be seen as a key enabling linkage and communication between dissimilar systems, and between the latter and the external world. &#x2039;Mass&#x203A; and &#x2039;energy&#x203A; are directly related to matter in the natural sciences, whereas &#x2039;information&#x203A; is not conveyed by any substance, but is based on variable properties: Information can be reproduced (duplicated or copied), destroyed (erased), or reiterated (repeated). &#xAB;Information is a name for the content of what is exchanged with the outer world as we adjust to it, and make our adjustment felt upon it. The process of receiving and of using information is the process of our adjusting to the contingencies of the outer environment, and of our living effectively within that environment.&#xBB; [^15] To this extent, not the possible quantity of circulating information is crucial to the effectiveness of communication, but the degree to which this information is integrated into communication. Along the lines of cybernetics, then,significant information is not the entirety of all information transmitted, but that information which passes through the &#x2039;filters.&#x203A;<br>&#x4E0E;&#x725B;&#x987F;&#x7684;&#x673A;&#x68B0;&#x7CFB;&#x7EDF;&#x4E0D;&#x540C;&#xFF0C;&#x8BE5;&#x7CFB;&#x7EDF;&#x91C7;&#x7528;&#x5C01;&#x95ED;&#x7CFB;&#x7EDF;&#x8FD0;&#x884C;&#xFF0C;&#x4FE1;&#x606F;&#x5E94;&#x7528;&#x4E8E;&#x5F00;&#x653E;&#x7CFB;&#x7EDF;&#x3002; &#x901A;&#x8FC7;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#xFF0C;&#x5B83;&#x5FC5;&#x987B;&#x88AB;&#x770B;&#x4F5C;&#x662F;&#x4E0D;&#x540C;&#x7CFB;&#x7EDF;&#x4E4B;&#x95F4;&#x4EE5;&#x53CA;&#x540E;&#x8005;&#x4E0E;&#x5916;&#x90E8;&#x4E16;&#x754C;&#x4E4B;&#x95F4;&#x7684;&#x5173;&#x952E;&#x8FDE;&#x63A5;&#x548C;&#x4EA4;&#x6D41;&#x3002; &lt;&#x8D28;&#x91CF;&gt;&#x548C;&lt;&#x80FD;&#x91CF;&gt;&#x4E0E;&#x81EA;&#x7136;&#x79D1;&#x5B66;&#x4E2D;&#x7684;&#x7269;&#x8D28;&#x76F4;&#x63A5;&#x76F8;&#x5173;&#xFF0C;&lt;&#x4FE1;&#x606F;&gt;&#x4E0D;&#x662F;&#x7531;&#x4EFB;&#x4F55;&#x7269;&#x8D28;&#x4F20;&#x9012;&#x7684;&#xFF0C;&#x800C;&#x662F;&#x57FA;&#x4E8E;&#x4E0D;&#x540C;&#x7684;&#x5C5E;&#x6027;&#xFF1A;&#x4FE1;&#x606F;&#x53EF;&#x4EE5;&#x88AB;&#x590D;&#x5236;&#xFF08;&#x590D;&#x5236;&#x6216;&#x62F7;&#x8D1D;&#xFF09;&#xFF0C;&#x9500;&#x6BC1;&#xFF08;&#x64E6;&#x9664;&#xFF09; &#x6216;&#x91CD;&#x7533;&#xFF08;&#x91CD;&#x590D;&#xFF09;&#x3002;&#x201C;&#x4FE1;&#x606F;&#x662F;&#x6211;&#x4EEC;&#x5728;&#x9002;&#x5E94;&#x5B83;&#x65F6;&#x4E0E;&#x5916;&#x90E8;&#x4E16;&#x754C;&#x4EA4;&#x6362;&#x5185;&#x5BB9;&#x7684;&#x540D;&#x79F0;&#xFF0C;&#x5E76;&#x4F7F;&#x6211;&#x4EEC;&#x7684;&#x53EF;&#x4EE5;&#x8C03;&#x6574;&#x611F;&#x53D7;&#x5230;&#x5B83;&#x3002; &#x63A5;&#x6536;&#x548C;&#x4F7F;&#x7528;&#x4FE1;&#x606F;&#x7684;&#x8FC7;&#x7A0B;&#x662F;&#x6211;&#x4EEC;&#x9002;&#x5E94;&#x5916;&#x90E8;&#x73AF;&#x5883;&#x7684;&#x7A81;&#x53D1;&#x4E8B;&#x4EF6;&#x548C;&#x8C03;&#x6574;&#x6211;&#x4EEC;&#x5728;&#x8BE5;&#x73AF;&#x5883;&#x4E2D;&#x53EF;&#x4EE5;&#x6709;&#x6548;&#x5730;&#x751F;&#x6D3B;&#x7684;&#x8FC7;&#x7A0B;&#x3002;&#x201C;[14]&#x5728;&#x8FD9;&#x79CD;&#x5C42;&#x9762;&#x4E0A;&#xFF0C;&#x91CD;&#x8981;&#x7684;&#x4E0D;&#x662F;&#x5927;&#x91CF;&#x4F20;&#x64AD;&#x4FE1;&#x606F;&#x5BF9;&#x4E8E;&#x4EA4;&#x6D41;&#x7684;&#x6709;&#x6548;&#x6027;&#xFF0C;&#x800C;&#x662F;&#x8FD9;&#x79CD;&#x4FE1;&#x606F;&#x878D;&#x5165;&#x4EA4;&#x6D41;&#x7684;&#x7A0B;&#x5EA6;&#x3002;&#x7136;&#x540E;&#xFF0C;&#x6839;&#x636E;&#x63A7;&#x5236;&#x8BBA;&#x7684;&#x89C2;&#x70B9;&#xFF0C;&#x91CD;&#x8981;&#x4FE1;&#x606F;&#x5E76;&#x4E0D;&#x662F;&#x6240;&#x6709;&#x4FE1;&#x606F;&#x7684;&#x5B8C;&#x6574;&#x4F20;&#x9012;&#xFF0C;&#x800C;&#x662F;&#x901A;&#x8FC7;&lt;&#x8FC7;&#x6EE4;&#x5668;&gt;&#x7684;&#x4FE1;&#x606F;&#x3002;<br>:::success</p>
<h4 id="&#x5434;&#x884D;&#x5F6C;14-18"><a href="#&#x5434;&#x884D;&#x5F6C;14-18" class="headerlink" title="&#x5434;&#x884D;&#x5F6C;14-18"></a>&#x5434;&#x884D;&#x5F6C;14-18</h4><p>:::</p>
<h3 id="Feedback"><a href="#Feedback" class="headerlink" title="Feedback"></a>Feedback</h3><h2 id="&#x53CD;&#x9988;"><a href="#&#x53CD;&#x9988;" class="headerlink" title="&#x53CD;&#x9988;"></a>&#x53CD;&#x9988;</h2></li>
<li><p>In the field of information and communication Wiener devoted particular attention to the question of automatons and the development of feedback models. His core interest lay in investigating machines capable of evaluating input and of integrating the stored experience into the further feedback loops. In this respect, feedback is a method of making systems self-regulating, by which the results of preceding activities are re-integrated in the procedural sequence and thus enable runtime corrections to be made permanently. To this end, machines must be capable of learning processes.<br>&#x5728;&#x4FE1;&#x606F;&#x548C;&#x901A;&#x4FE1;&#x9886;&#x57DF;&#xFF0C;&#x7EF4;&#x7EB3;&#x7279;&#x522B;&#x5173;&#x6CE8;&#x81EA;&#x52A8;&#x673A;&#x95EE;&#x9898;&#x548C;&#x53CD;&#x9988;&#x6A21;&#x578B;&#x7684;&#x53D1;&#x5C55;&#x3002;&#x4ED6;&#x7684;&#x6838;&#x5FC3;&#x5174;&#x8DA3;&#x5728;&#x4E8E;&#x7814;&#x7A76;&#x80FD;&#x591F;&#x8BC4;&#x4F30;&#x8F93;&#x5165;&#x5E76;&#x5C06;&#x5B58;&#x50A8;&#x7684;&#x4F53;&#x9A8C;&#x6574;&#x5408;&#x5230;&#x66F4;&#x591A;&#x53CD;&#x9988;&#x73AF;&#x8DEF;&#x7684;&#x673A;&#x5668;&#x3002;&#x5728;&#x8FD9;&#x65B9;&#x9762;&#xFF0C;&#x53CD;&#x9988;&#x662F;&#x4E00;&#x79CD;&#x4F7F;&#x7CFB;&#x7EDF;&#x81EA;&#x6211;&#x8C03;&#x8282;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x901A;&#x8FC7;&#x8BE5;&#x65B9;&#x6CD5;&#x5C06;&#x524D;&#x9762;&#x6D3B;&#x52A8;&#x7684;&#x7ED3;&#x679C;&#x91CD;&#x65B0;&#x96C6;&#x6210;&#x5728;&#x8FC7;&#x7A0B;&#x5E8F;&#x5217;&#x5F53;&#x4E2D;&#xFF0C;&#x4ECE;&#x800C;&#x4F7F;&#x5728;&#x8FD0;&#x884C;&#x7684;&#x540C;&#x65F6;&#x4FEE;&#x6B63;&#x53EF;&#x4EE5;&#x591F;&#x6C38;&#x4E45;&#x5730;&#x6301;&#x7EED;&#x4E0B;&#x53BB;&#x3002;&#x4E3A;&#x6B64;&#xFF0C;&#x673A;&#x5668;&#x5FC5;&#x987B;&#x80FD;&#x591F;&#x5B66;&#x4E60;&#x8FC7;&#x7A0B;&#x3002;</p>
</li>
<li><p>Although his approaches and conclusions are very different from those of Wiener, Turing in his essay likewise clearly indicated the necessity of developing systems capable of learning. Devoted to the subject of learning machines, the essay takes as its starting point the principle that &#xAB;education can take place provided that communication in both directions between teacher and pupil can take place by some means or other.&#xBB; [^16] Turing&#x2019;s theory already aims at the need to create systems that guarantee for bi-directional communication of this kind. Necessary for this purpose are &#xAB;unemotional channels of communication&#xBB; over which it is possible to &#xAB;teach a machine by punishments and rewards to obey orders given in some language, e.g., a symbolic language.&#xBB; [^17]<br>&#x867D;&#x7136;&#x4ED6;&#x7684;&#x65B9;&#x6CD5;&#x548C;&#x7ED3;&#x8BBA;&#x4E0E;&#x7EF4;&#x7EB3;&#x7684;&#x65B9;&#x6CD5;&#x548C;&#x7ED3;&#x8BBA;&#x6709;&#x5F88;&#x5927;&#x4E0D;&#x540C;&#xFF0C;&#x4F46;&#x56FE;&#x7075;&#x5728;&#x4ED6;&#x7684;&#x8BBA;&#x6587;&#x4E2D;&#x4E5F;&#x6E05;&#x695A;&#x5730;&#x8868;&#x660E;&#x4E86;&#x5F00;&#x53D1;&#x80FD;&#x591F;&#x5B66;&#x4E60;&#x7684;&#x7CFB;&#x7EDF;&#x7684;&#x5FC5;&#x8981;&#x6027;&#x3002;&#x81F4;&#x529B;&#x4E8E;&#x5B66;&#x4E60;&#x673A;&#x5668;&#x7684;&#x4E3B;&#x9898;&#xFF0C;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x7684;&#x51FA;&#x53D1;&#x70B9;&#x662F;&#x201C;&#x6559;&#x80B2;&#x7684;&#x524D;&#x63D0;&#x662F;&#x5F53;&#x6559;&#x5E08;&#x548C;&#x5B66;&#x751F;&#x4E4B;&#x95F4;&#x7684;&#x53CC;&#x5411;&#x6C9F;&#x901A;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x67D0;&#x79CD;&#x65B9;&#x5F0F;&#x8FDB;&#x884C;&#x3002;&#x201D;[15]&#x3002;&#x56FE;&#x7075;&#x7684;&#x7406;&#x8BBA;&#x7784;&#x51C6;&#x7684;&#x662F;&#x9700;&#x8981;&#x521B;&#x5EFA;&#x4FDD;&#x8BC1;&#x8FD9;&#x79CD;&#x53CC;&#x5411;&#x901A;&#x4FE1;&#x673A;&#x5236;&#x7684;&#x7CFB;&#x7EDF;&#x3002;&#x4E3A;&#x6B64;&#xFF0C;&#x975E;&#x5E38;&#x5FC5;&#x987B;&#x7684;&#x662F;&#x201C;&#x975E;&#x60C5;&#x611F;&#x7684;&#x6C9F;&#x901A;&#x6E20;&#x9053;&#x201D;&#xFF0C;&#x901A;&#x8FC7;&#x8FD9;&#x79CD;&#x6C9F;&#x901A;&#x6E20;&#x9053;&#xFF0C;&#x53EF;&#x4EE5;&#x5B9E;&#x73B0;&#x201C;&#x901A;&#x8FC7;&#x60E9;&#x7F5A;&#x548C;&#x5956;&#x52B1;&#x6559;&#x5BFC;&#x673A;&#x5668;&#x9075;&#x5B88;&#x67D0;&#x4E9B;&#x8BED;&#x8A00;&#x7ED9;&#x51FA;&#x7684;&#x547D;&#x4EE4;&#xFF0C;&#x4F8B;&#x5982;&#x8C61;&#x5F81;&#x6027;&#x7684;&#x8BED;&#x8A00;&#x201D;&#x3002;[16]</p>
</li>
</ol>
<h3 id="Human-machine-communication"><a href="#Human-machine-communication" class="headerlink" title="Human-machine communication"></a>Human-machine communication</h3><ol start="21">
<li><p>Turing&#x2019;s idea was directed at the concept today known as &#x2039;interface&#x203A; or &#x2039;humanmachine interface.&#x203A; This intermediary element is a kind of &#x2039;translator&#x203A; who transforms the information conveyed in symbolic language into binary code, the language of the computer. To this extent, the interface opens up a communication channel between the two systems, between the human and the electronic.<br>&#x56FE;&#x7075;&#x7684;&#x601D;&#x60F3;&#x88AB;&#x7528;&#x4E8E;&#x5F53;&#x4ECA;&#x77E5;&#x540D;&#x7684;&lt;&#x63A5;&#x53E3;&gt;&#x6216;&#x8005;&#x662F;&lt;&#x4EBA;&#x673A;&#x63A5;&#x53E3;&gt;&#x7684;&#x6982;&#x5FF5;&#x3002;&#x8FD9;&#x4E2A;&#x5A92;&#x4ECB;&#x7684;&#x5143;&#x7D20;&#x662F;&lt;&#x7FFB;&#x8BD1;&#x5668;&gt;&#x7684;&#x4E00;&#x79CD;&#x7C7B;&#x578B;&#xFF1A;&#x8F6C;&#x6362;&#x7B26;&#x53F7;&#x8BED;&#x8A00;&#x7684;&#x8868;&#x8FBE;&#x901A;&#x8FC7;&#x8BA1;&#x7B97;&#x673A;&#x4E8C;&#x8FDB;&#x5236;&#x4EE3;&#x7801;&#x7684;&#x8BED;&#x8A00;&#x6765;&#x4F20;&#x8FBE;&#x4FE1;&#x606F;&#x3002;&#x901A;&#x8FC7;&#x8FD9;&#x6837;&#x7684;&#x6269;&#x5C55;&#xFF0C;&#x8FD9;&#x4E2A;&#x63A5;&#x53E3;&#x4FBF;&#x5F00;&#x542F;&#x4E86;&#x4EBA;&#x548C;&#x7535;&#x5B50;&#x8BBE;&#x5907;&#x4E24;&#x4E2A;&#x7CFB;&#x7EDF;&#x4E4B;&#x95F4;&#x901A;&#x4FE1;&#x7684;&#x901A;&#x9053;&#x3002;<br>:::success</p>
<h4 id="&#x502A;&#x534E;&#x590F;-21"><a href="#&#x502A;&#x534E;&#x590F;-21" class="headerlink" title="&#x502A;&#x534E;&#x590F; 21"></a>&#x502A;&#x534E;&#x590F; 21</h4><p>:::</p>
</li>
<li><p>Turing here went one step further than the feedback theory of Wiener, whose concept was confined to recursive processes within single systems. Turing, by contrast, conceived of a system capable oflearning and based on the exchange of information between human and machine. The approaches of the two mathematicians differ above all in the possibility of comparing systems. Norbert Wiener took as his point of departure the principle that a resemblance exists between living beings and machines, with the learning process being restricted to the acquisition of information and the ability to memorize the results of past operations for future usage. Alan Turing insisted that there was a difference between the behavior of the human nervous system, in which &#xAB;chemical phenomena are at least as important as electrical&#xBB; [^18] and the capabilities of a discrete machine. [^19] Machines &#xAB;which move by sudden jumps or clicks from one quite definite state to another&#xBB; [^20] do not, strictly speaking, exist, since in reality everything is a constant process. This difference therefore makes impossible a direct connection between human beings and machines, and at the same time demands the development of a &#x2039;channel&#x203A; (interface) that initiates this communication. [^21] Turing&#x2019;s proposal was thus a decisive step towards the development of electronic interfaces for human-machine communication, and beyond that for the development of interactive, digital systems. This communication channel permits bi-directional information exchange, and therefore also learning processes. On the basis of this method, Turing repudiated the thesis set up by Ada Lovelace in 1842. [^22] Using investigations made with the &#x2039;analytic machine&#x203A; of Charles Babbage, Lady Lovelace had claimed that a machine can do only that which it is instructed to do, and therefore is never capable of producing anything truly new. [^23] Turing contradicted this thesis with the question &#xAB;who can be certain that &#x2039;original work&#x203A; that he has done was not simply the growth of the seed planted in him by teaching, or the effect of following well-known general principles?&#xBB; [^24] He further pointed out that the machine must be to a certain degree<br>&#x2039;undisciplined&#x203A; or random-controlled in order that its behavior can be considered intelligent. [^25]Precisely this element of chance was what lent the machine &#x2039;creative&#x203A; ability, namely the ability to solve problems.<br>&#x56FE;&#x7075;&#x5728;&#x8FD9;&#x91CC;&#x6BD4;&#x7EF4;&#x7EB3;&#x7684;&#x53CD;&#x9988;&#x7406;&#x8BBA;&#x66F4;&#x8FDB;&#x4E00;&#x6B65;&#xFF0C;&#x5B83;&#x7684;&#x6982;&#x5FF5;&#x4EC5;&#x9650;&#x4E8E;&#x5355;&#x4E2A;&#x7CFB;&#x7EDF;&#x5185;&#x7684;&#x9012;&#x5F52;&#x8FC7;&#x7A0B;&#x3002;&#x76F8;&#x53CD;&#xFF0C;&#x56FE;&#x7075;&#x6784;&#x60F3;&#x4E86;&#x4E00;&#x4E2A;&#x80FD;&#x591F;&#x5B66;&#x4E60;&#x7684;&#x7CFB;&#x7EDF;&#xFF0C;&#x5E76;&#x57FA;&#x4E8E;&#x4EBA;&#x673A;&#x4EA4;&#x4E92;&#x4FE1;&#x606F;&#x3002;&#x4E24;&#x4F4D;&#x6570;&#x5B66;&#x5BB6;&#x7684;&#x65B9;&#x6CD5;&#x5728;&#x6BD4;&#x8F83;&#x7CFB;&#x7EDF;&#x7684;&#x53EF;&#x80FD;&#x6027;&#x4E0A;&#x6709;&#x6240;&#x4E0D;&#x540C;&#x3002;&#x8BFA;&#x4F2F;&#x7279;&#xB7;&#x7EF4;&#x7EB3;&#x4EE5;&#x4ED6;&#x7684;&#x51FA;&#x53D1;&#x70B9;&#x4E3A;&#x57FA;&#x7840;&#xFF0C;&#x8BA4;&#x4E3A;&#x751F;&#x7269;&#x4E0E;&#x673A;&#x5668;&#x4E4B;&#x95F4;&#x5B58;&#x5728;&#x76F8;&#x4F3C;&#x4E4B;&#x5904;&#xFF0C;&#x5B66;&#x4E60;&#x8FC7;&#x7A0B;&#x4EC5;&#x9650;&#x4E8E;&#x83B7;&#x53D6;&#x4FE1;&#x606F;&#xFF0C;&#x5E76;&#x80FD;&#x591F;&#x8BB0;&#x5FC6;&#x8FC7;&#x53BB;&#x64CD;&#x4F5C;&#x7684;&#x7ED3;&#x679C;&#x4EE5;&#x5907;&#x5C06;&#x6765;&#x4F7F;&#x7528;&#x3002;&#x827E;&#x4F26;&#x56FE;&#x7075;&#x575A;&#x6301;&#x8BA4;&#x4E3A;&#x4EBA;&#x7C7B;&#x795E;&#x7ECF;&#x7CFB;&#x7EDF;&#x7684;&#x884C;&#x4E3A;&#x4E0E;&#x201C;&#x79BB;&#x6563;&#x673A;&#x5668;&#x7684;&#x80FD;&#x529B;&#x201D;&#x4E4B;&#x95F4;&#x5B58;&#x5728;&#x7740;&#x5DEE;&#x5F02;&#xFF0C;&#x5176;&#x4E2D;&#x201C;&#x5316;&#x5B66;&#x73B0;&#x8C61;&#x81F3;&#x5C11;&#x4E0E;&#x7535;&#x529B;&#x4E00;&#x6837;&#x91CD;&#x8981;&#x201D;[18]&#x3002; [^ 19]&#x4ECE;&#x4E25;&#x683C;&#x610F;&#x4E49;&#x4E0A;&#x8BF4;&#xFF0C;&#x673A;&#x5668;&#x201C;&#x7A81;&#x7136;&#x8DF3;&#x8DC3;&#x6216;&#x70B9;&#x51FB;&#x4ECE;&#x4E00;&#x4E2A;&#x76F8;&#x5F53;&#x786E;&#x5B9A;&#x7684;&#x72B6;&#x6001;&#x79FB;&#x52A8;&#x5230;&#x53E6;&#x4E00;&#x4E2A;&#x72B6;&#x6001;&#x201D;[^ 20]&#x5E76;&#x4E0D;&#x5B58;&#x5728;&#xFF0C;&#x56E0;&#x4E3A;&#x5B9E;&#x9645;&#x4E0A;&#x4E00;&#x5207;&#x90FD;&#x662F;&#x4E00;&#x4E2A;&#x8FDE;&#x7EED;&#x7684;&#x8FC7;&#x7A0B;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x8FD9;&#x79CD;&#x5DEE;&#x5F02;&#x4F7F;&#x5F97;&#x4EBA;&#x4E0E;&#x673A;&#x5668;&#x4E4B;&#x95F4;&#x4E0D;&#x53EF;&#x80FD;&#x76F4;&#x63A5;&#x8FDE;&#x63A5;&#xFF0C;&#x5E76;&#x4E14;&#x540C;&#x65F6;&#x8981;&#x6C42;&#x5F00;&#x53D1;&#x542F;&#x52A8;&#x8BE5;&#x901A;&#x4FE1;&#x7684;&lt;&#x901A;&#x9053;&gt;&#xFF08;&#x63A5;&#x53E3;&#xFF09;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x56FE;&#x7075;&#x7684;&#x63D0;&#x6848;&#x662F;&#x5F00;&#x53D1;&#x7528;&#x4E8E;&#x4EBA;&#x673A;&#x901A;&#x4FE1;&#x7684;&#x7535;&#x5B50;&#x63A5;&#x53E3;&#x7684;&#x51B3;&#x5B9A;&#x6027;&#x6B65;&#x9AA4;&#xFF0C;&#x5E76;&#x8D85;&#x8D8A;&#x4E86;&#x5F00;&#x53D1;&#x4EA4;&#x4E92;&#x5F0F;&#x6570;&#x5B57;&#x7CFB;&#x7EDF;&#x7684;&#x51B3;&#x5FC3;&#x3002;&#x8BE5;&#x901A;&#x4FE1;&#x6E20;&#x9053;&#x5141;&#x8BB8;&#x53CC;&#x5411;&#x4FE1;&#x606F;&#x4EA4;&#x6362;&#xFF0C;&#x56E0;&#x6B64;&#x4E5F;&#x5141;&#x8BB8;&#x5B66;&#x4E60;&#x8FC7;&#x7A0B;&#x3002;&#x5728;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x7684;&#x57FA;&#x7840;&#x4E0A;&#xFF0C;&#x56FE;&#x7075;&#x9A73;&#x65A5;&#x4E86;Ada Lovelace&#x5728;1842&#x5E74;&#x8BBE;&#x7ACB;&#x7684;&#x8BBA;&#x6587;&#x3002;[^ 22]&#x5229;&#x7528;Charles Babbage&#x7684;<analytic machine="">&#x6240;&#x505A;&#x7684;&#x8C03;&#x67E5;&#xFF0C;Lady Lovelace&#x58F0;&#x79F0;&#x673A;&#x5668;&#x53EA;&#x80FD;&#x505A;&#x5230;&#x88AB;&#x6307;&#x793A;&#x53BB;&#x505A;&#xFF0C;&#x56E0;&#x6B64;&#x6C38;&#x8FDC;&#x4E0D;&#x4F1A;&#x4EA7;&#x751F;&#x4EFB;&#x4F55;&#x771F;&#x6B63;&#x65B0;&#x7684;&#x4E1C;&#x897F;&#x3002;&#x56FE;&#x7075;&#x63D0;&#x51FA;&#x95EE;&#x9898;&#x6765;&#x53CD;&#x9A73;&#xFF0C;&#x201C;&#x8C01;&#x80FD;&#x591F;&#x786E;&#x4FE1;&#x4ED6;&#x6240;&#x505A;&#x7684;&#x5DE5;&#x4F5C;&#x5E76;&#x4E0D;&#x4EC5;&#x4EC5;&#x662F;&#x6559;&#x4ED6;&#x79CD;&#x5728;&#x4ED6;&#x8EAB;&#x4E0A;&#x7684;&#x79CD;&#x5B50;&#x7684;&#x6210;&#x957F;&#xFF0C;&#x8FD8;&#x662F;&#x9075;&#x5FAA;&#x4F17;&#x6240;&#x5468;&#x77E5;&#x7684;&#x4E00;&#x822C;&#x539F;&#x5219;&#x7684;&#x5F71;&#x54CD;&#xFF1F; &#xBB;[^ 24]&#x4ED6;&#x8FDB;&#x4E00;&#x6B65;&#x6307;&#x51FA;&#xFF0C;&#x673A;&#x5668;&#x5FC5;&#x987B;&#x8FBE;&#x5230;&#x67D0;&#x79CD;&#x201C;&#x65E0;&#x89C4;&#x5F8B;&#x7684;&#x201D;&#x6216;&#x8005;&#x968F;&#x673A;&#x63A7;&#x5236;&#x7684;&#x7A0B;&#x5EA6;&#xFF0C;&#x624D;&#x53EF;&#x4EE5;&#x88AB;&#x8BA4;&#x4E3A;&#x662F;&#x667A;&#x80FD;&#x7684;&#x3002; [^ 25]&#x6B63;&#x662F;&#x8FD9;&#x79CD;&#x968F;&#x673A;&#x6027;&#x662F;&#x673A;&#x5668;&#x4EA7;&#x751F;&#x521B;&#x9020;&#x6027;&#x7684;&#x80FD;&#x529B;&#xFF0C;&#x5373;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#x7684;&#x80FD;&#x529B;&#x3002;</analytic></p>
</li>
<li><p>Although discrete machines that could pass the Turing Test are feasible, they would succeed notbecause they were replicas of the human brain but because they would have been programmed accordingly. As Turing himself realized, the basic problem lies in the area of programming. In fact, it was not necessary to wait the fifty years assumed by Turing in order to program &#xAB;computers, with a storage capacity of about 109, to make them play the imitation game so well that an average interrogator will not have more than a 70 per cent chance of making the right identification after five minutes of questioning.&#xBB; [^26] The programs have been written, and have passed the Turing Test with a high degree of interactivity. One might therefore conclude that the problem is not solely confined to investigating the possibilities of Artificial Intelligence. [^27]<br>&#x5C3D;&#x7BA1;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x56FE;&#x7075;&#x6D4B;&#x8BD5;&#x7684;&#x5206;&#x7ACB;&#x673A;&#x5668;&#x662F;&#x53EF;&#x884C;&#x7684;&#xFF0C;&#x4F46;&#x5B83;&#x4EEC;&#x4F1A;&#x6210;&#x529F;&#xFF0C;&#x4E0D;&#x662F;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x662F;&#x4EBA;&#x8111;&#x7684;&#x590D;&#x5236;&#x54C1;&#xFF0C;&#x800C;&#x662F;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x4F1A;&#x88AB;&#x76F8;&#x5E94;&#x5730;&#x7F16;&#x7A0B;&#x3002; &#x6B63;&#x5982;&#x56FE;&#x7075;&#x81EA;&#x5DF1;&#x610F;&#x8BC6;&#x5230;&#x7684;&#x90A3;&#x6837;&#xFF0C;&#x57FA;&#x672C;&#x95EE;&#x9898;&#x5728;&#x4E8E;&#x7F16;&#x7A0B;&#x9886;&#x57DF;&#x3002; &#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x6CA1;&#x6709;&#x5FC5;&#x8981;&#x7B49;&#x5F85;&#x56FE;&#x7075;&#x5047;&#x5B9A;&#x7684;50&#x5E74;&#x6765;&#x7F16;&#x7A0B;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x8BA1;&#x7B97;&#x673A;&#x201C;&#x6709;109&#x4E2A;&#x50A8;&#x5B58;&#x5668;&#xFF0C;&#x80FD;&#x591F;&#x5F88;&#x597D;&#x7684;&#x8FD0;&#x884C;&#x5192;&#x5145;(&#x4EBA;&#x7C7B;)&#x7684;&#x6E38;&#x620F;&#xFF0C;&#x5E76;&#x4F7F;&#x666E;&#x901A;&#x7684;&#x8BE2;&#x95EE;&#x7740;&#x4E0D;&#x4F1A;&#x8D85;&#x8FC7;70%&#x6982;&#x7387;&#x505A;&#x51FA;&#x6B63;&#x786E;&#x7684;&#x5224;&#x65AD;&#x201D;&#x8FD9;&#x4E9B;&#x7A0B;&#x5E8F;&#x5DF2;&#x7ECF;&#x7F16;&#x5199;&#x5B8C;&#x6210;&#xFF0C;&#x5E76;&#x4E14;&#x5DF2;&#x7ECF;&#x901A;&#x8FC7;&#x4E86;&#x9AD8;&#x4E92;&#x52A8;&#x6027;&#x7684;&#x7684;&#x56FE;&#x7075;&#x6D4B;&#x8BD5;&#x3002; &#x6709;&#x4EBA;&#x53EF;&#x80FD;&#x56E0;&#x6B64;&#x5F97;&#x51FA;&#x7ED3;&#x8BBA;&#xFF1A;&#x95EE;&#x9898;&#x4E0D;&#x4EC5;&#x4EC5;&#x5C40;&#x9650;&#x4E8E;&#x8C03;&#x67E5;&#x4EBA;&#x5DE5;&#x667A;&#x80FD;&#x7684;&#x53EF;&#x80FD;&#x6027;&#x3002;</p>
</li>
<li><p>Viewed from the contemporary perspective, cybernetics and AI cannot be reduced to solely scientific, economic, or technical interest. Since these theories belong to a socio-technical field in which communication structures, world-views and people-views are formed and transformed, they are concerned with philosophic issues of perception, cognition, language, ethics, and aesthetics. If information technology is basically working towards the automation of mental processes, then it directly or indirectly reaches into disciplines concerned with human cognition or creativity.<br>&#x4ECE;&#x5F53;&#x4EE3;&#x89D2;&#x5EA6;&#x6765;&#x770B;&#xFF0C;&#x63A7;&#x5236;&#x8BBA;&#x548C;&#x4EBA;&#x5DE5;&#x667A;&#x80FD;&#x4E0D;&#x80FD;&#x4EC5;&#x4EC5;&#x5F52;&#x7ED3;&#x4E3A;&#x79D1;&#x5B66;&#xFF0C;&#x7ECF;&#x6D4E;&#x6216;&#x6280;&#x672F;&#x7684;&#x5174;&#x8DA3;&#x3002; &#x7531;&#x4E8E;&#x8FD9;&#x4E9B;&#x7406;&#x8BBA;&#x5C5E;&#x4E8E;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x793E;&#x4F1A;&#x6280;&#x672F;&#x9886;&#x57DF;&#xFF1A;&#x5728;&#x8FD9;&#x4E2A;&#x9886;&#x57DF;&#x4EA4;&#x6D41;&#x6A21;&#x5F0F;&#x4E2D;&#xFF0C;&#x4E16;&#x754C;&#x89C2;&#x548C;&#x4EBA;&#x4EEC;&#x7684;&#x89C2;&#x70B9;&#x88AB;&#x5F62;&#x6210;&#x548C;&#x8F6C;&#x5316;&#xFF0C;&#x4ED6;&#x4EEC;&#x5173;&#x5FC3;&#x7684;&#x662F;&#x611F;&#x77E5;&#xFF0C;&#x8BA4;&#x77E5;&#xFF0C;&#x8BED;&#x8A00;&#xFF0C;&#x4F26;&#x7406;&#x548C;&#x7F8E;&#x5B66;&#x7B49;&#x54F2;&#x5B66;&#x95EE;&#x9898;&#x3002; &#x5982;&#x679C;&#x4FE1;&#x606F;&#x6280;&#x672F;&#x57FA;&#x672C;&#x4E0A;&#x81F4;&#x529B;&#x4E8E;&#x5FC3;&#x7406;&#x8FC7;&#x7A0B;&#x7684;&#x81EA;&#x52A8;&#x5316;&#xFF0C;&#x90A3;&#x4E48;&#x5B83;&#x76F4;&#x63A5;&#x6216;&#x95F4;&#x63A5;&#x5730;&#x6D89;&#x53CA;&#x4E0E;&#x4EBA;&#x7C7B;&#x8BA4;&#x77E5;&#x6216;&#x521B;&#x9020;&#x6709;&#x5173;&#x7684;&#x5B66;&#x79D1;&#x3002;</p>
</li>
</ol>
<p>Translation by Tom Morrison</p>
<p>&#x7FFB;&#x8BD1;&#xFF1A;Tom Morrison</p>
<p>[^1]: See Werner Heisenberg, Physik und Erkenntnis, Gesammelte Werke, vol. 3, Munich, 1985.<br>&#x89C1;Werner Heisenberg&#xFF0C;Physik und Erkenntnis&#xFF0C;Gesammelte Werke&#xFF0C;vol. 3&#xFF0C;&#x6155;&#x5C3C;&#x9ED1;&#xFF0C;1985<br>[^2]:Peter Weibel, &#xAB;The Unreasonable Effectiveness of the Methodological Convergence of Art and Science,&#xBB; in Art @ Science, Christa Sommerer/Laurent Mignonneau (eds), Vienna/New York, 1998, p. 170.<br>Peter Weibel&#xFF0C;&#x201C;&#x827A;&#x672F;&#x4E0E;&#x79D1;&#x5B66;&#x7684;&#x65B9;&#x6CD5;&#x8BBA;&#x878D;&#x5408;&#x7684;&#x4E0D;&#x5408;&#x7406;&#x6709;&#x6548;&#x6027;&#x201D;&#xFF0C;Art @ Science&#xFF0C;Christa Sommerer / Laurent Mignonneau&#xFF08;&#x7F16;&#x8F91;&#xFF09;&#xFF0C;&#x7EF4;&#x4E5F;&#x7EB3;/&#x7EBD;&#x7EA6;&#xFF0C;1998&#x5E74;&#xFF0C;170&#x3002;</p>
<p>[^3]: Peter Weibel, &#xAB;The Unreasonable Effectiveness of the Methodological Convergence of Art and Science,&#xBB; in Art @ Science, Christa Sommerer/Laurent Mignonneau (eds), Vienna/New York, 1998, p. 173.</p>
<p>[^4]: Peter Weibel, &#xAB;The Unreasonable Effectiveness of the Methodological Convergence of Art and Science,&#xBB; in Art @ Science, Christa Sommerer/Laurent Mignonneau (eds), Vienna/New York, 1998, p. 174.<br>[^5]: See Paul K. Feyerabend, Against Method, London, 1975.<br>[^6]: Jorge Wagensberg, &#xAB;Las reglas del juego,&#xBB; in Proceso al Azar, Jorge Wagensberg (ed.), Barcelona, 1986, p. 13.<br>[^7]: Ilya Prigogine, &#xAB;Enfrent&#xE1;ndose con lo irracional,&#xBB; in Proceso al Azar, Jorge Wagensberg (ed.), Barcelona, 1986, p. 158.<br>[^8]: See James Beniger, The Control Revolution. Technological and Economic Origins of the Information Society, Cambridge, 1986.<br>[^9]: See Jochen Schulte-Sasse, &#xAB;Von der schriftlichen zur elektronischen Kultur: &#xDC;ber neuere Wechselbeziehungen zwischen Mediengeschichte und Kulturgeschichte,&#xBB; in Materialit&#xE4;t der Kommunikation, Hans Ulrich Gumbrecht/Ludwig Pfeiffer (eds), Frankfurt/Main, 1988, pp. 429&#x2013;453.<br>[^10]: Jochen Schulte-Sasse, &#xAB;Von der schriftlichen zur elektronischen Kultur: &#xDC;ber neuere Wechselbeziehungen zwischen Mediengeschichte und Kulturgeschichte,&#xBB; in Materialit&#xE4;t der Kommunikation, Hans Ulrich Gumbrecht/Ludwig Pfeiffer (eds), Frankfurt/Main, 1988, p. 433.<br>[^11]: Norbert Wiener, The Human Use of Human Beings. Cybernetics and Society, Boston, 1950/1954, p. 16.<br>[^12]: Abbreviated as AI.<br>[^13]: The first computer running on a program was developed in 1941 by Konrad Zuse in Germany.<br>[^14]&#xFF1A; Norbert Wiener, The Human Use of Human Beings. Cybernetics and Society, Boston, 1950/1954.<br>[^15]: Norbert Wiener, The Human Use of Human Beings. Cybernetics and Society, Boston, 1950/1954, pp. 17&#x2013;18.<br>[^16]: Alan M. Turing, &#xAB;Computing Machinery and Intelligence&#xBB; (1950), in Mind, 59, pp. 433&#x2013;460.<br>[^17]: Alan M. Turing, &#xAB;Computing Machinery and Intelligence,&#xBB; in Mind, 59, pp. 433&#x2013; 460.<br>[^18]: Alan M. Turing, &#xAB;Computing Machinery and Intelligence,&#xBB; in Mind, 59, pp. 433&#x2013; 460.<br>[^19]: &#xAB;Discrete&#xBB; signifies numerical values that are separated by finite intervals and, breaking down into individual points, are countable. A discrete quantity has a defined number of possible values.<br>[^20]: Alan M. Turing, &#xAB;Computing Machinery and Intelligence,&#xBB; in Mind, 59, pp. 433&#x2013; 460.<br>[^21]: See Wulf R. Halbach, Interfaces: Medien- und kommunikationstheoretische Elemente einer Interface- Theorie, Munich, 1994, p. 143.<br>[^22]: Daughter of Lord Byron and assistant of Charles Babbage.<br>[^23]: See Ada A. Lovelace, &#xAB;Sketch of the Analytical Engine Invented by Charles Babbage,&#xBB; Geneva, 1842, reprinted in Philip and Emily Morrison, Charles Babbage and His Calculating Engines, New York, 1962, pp. 248&#x2013;249 and 284.<br>[^24]: See Alan M. Turing, &#xAB;Rechenmaschinen und Intelligenz&#xBB; in Intelligence Service &#x2014; Schriften, Berlin. 1987, p. 153. Alan M. Turing, &#xAB;Computing Machinery and Intelligence,&#xBB; in Mind, 59, pp. 433&#x2013; 460.<br>[^25]: Alan M. Turing, &#xAB;Computing Machinery and Intelligence,&#xBB; in Mind, 59, pp. 433&#x2013; 460.<br>[^26]: Alan M. Turing, &#xAB;Computing Machinery and Intelligence,&#xBB; in Mind, 59, pp. 433&#x2013; 460.<br>[^27]: See Margaret A. Boden (ed.), The Philosophy of Artificial Intelligence, Oxford, 1989/1990.<br>&#xA9; Media Art Net 2004</p>

    
    </div>
    
    
</article>




    
        <article class="article content gallery" itemscope="" itemprop="blogPost">
    <h1 class="article-title is-size-3 is-size-4-mobile" itemprop="name">
        
            <a href="/2018/11/08/MarkHansen/" itemprop="url">MarkHansen</a>
        
    </h1>
    <div class="article-meta columns is-variable is-1 is-multiline is-mobile is-size-7-mobile">
        <span class="column is-narrow">
            <time datetime="2018-11-07T17:43:45.000Z" itemprop="datePublished">11月 8 2018</time>
        </span>
        
        
        <span class="column is-narrow">
            
            
            12 分钟 lire (À propos 1752 mots)
        </span>
        
    </div>
    <div class="article-entry is-size-6-mobile" itemprop="articleBody">
    
        <h1 id="Markhansen"><a href="#Markhansen" class="headerlink" title="Markhansen"></a>Markhansen</h1><h1 id="Day-1"><a href="#Day-1" class="headerlink" title="Day 1"></a>Day 1</h1><p>comesfrom Germany<br>
Poststructuralism, America name for a movement in France from 1960-1970-80<br>A critical developments from structuralism</p>
<p>Claude Levi-Strauss</p>
<p><strong>structural linguistics</strong><br>&#x8BED;&#x8A00;&#x7ED3;&#x6784;&#x5B66;</p>
<p>Sign -&gt;signifer&#x80FD;&#x6307; -&gt;signify&#x6240;&#x6307;</p>
<h5 id="&#x540E;&#x7ED3;&#x6784;&#x4E3B;&#x4E49;"><a href="#&#x540E;&#x7ED3;&#x6784;&#x4E3B;&#x4E49;" class="headerlink" title="&#x540E;&#x7ED3;&#x6784;&#x4E3B;&#x4E49;"></a><strong>&#x540E;&#x7ED3;&#x6784;&#x4E3B;&#x4E49;</strong></h5><p>&#x8BED;&#x8A00;&#x7ED3;&#x6784;&#x5B66;-&#x5FB7;&#x91CC;&#x8FBE;Jacques Derrida<br>&#x7ED3;&#x6784;&#x5FC3;&#x7406;&#x5B66;-&#x62C9;&#x5EB7;Jacques Lacan<br>&#x540E;&#x7ED3;&#x6784;&#x4E3B;&#x4E49;-&#x798F;&#x67EF;Michel Foucault</p>
<pre><code>order of discource&#x8BDD;&#x8BED;&#x79E9;&#x5E8F;  </code></pre><p>&#x7F57;&#x5170;&#x5DF4;&#x7279;</p>
<p><strong>Hermeneutic</strong> -hermes &#x89E3;&#x91CA;&#x5B66;</p>
<p>&#x80FD;&#x6307;&#x4E0E;&#x6240;&#x6307;  &#x4E92;&#x76F8;&#x4F5C;&#x7528;<br>&#x80FD;&#x6307;&#x662F;&#x6240;&#x6307;&#x7684;&#x7269;&#x8D28;&#x652F;&#x6301;-&#x7ED3;&#x6784;&#x4E3B;&#x4E49;<br>meterial suport &#x662F;&#x4E0D;&#x5B58;&#x5728;&#x7684;  &#x2013;&#x5A92;&#x4ECB;&#x5B66;&#x5BB6;&#x7684;&#x8BBA;&#x8C03;</p>
<pre><code>&#x865A;&#x6784;&#x5C0F;&#x8BF4;&#x6240;&#x6784;&#x5EFA;&#x7684;&#x4E16;&#x754C;</code></pre><h5 id="M-H"><a href="#M-H" class="headerlink" title="M.H"></a>M.H</h5><p><strong><em>understanding Media</em></strong><br>Mcluhan &#x7684;&#x80A4;&#x6D45;-&#x7406;&#x8BBA;&#x4E4B;&#x4E0B;&#x6CA1;&#x6709;&#x5185;&#x5BB9;</p>
<blockquote>
<p>&#x8D21;&#x732E;&#xFF1A;&#x7535;&#x5B50;&#x5A92;&#x4ECB;&#x4E0E;&#x6A21;&#x62DF;&#x5A92;&#x4ECB;&#x7684;&#x8F6C;&#x53D8;&#x662F;&#x611F;&#x77E5;&#x7684;&#x8F6C;&#x53D8;</p>
<ol>
<li>&#x5BF9;&#x5A92;&#x4ECB;&#x7406;&#x8BBA;&#x7684;&#x603B;&#x7ED3;</li>
<li>&#x5177;&#x4F53;&#x4F8B;&#x5B50;-&#x70ED;&#x5A92;&#x4F53;&#x3001;&#x51B7;&#x5A92;&#x4F53;&#x7B49;&#x7B49;</li>
</ol>
</blockquote>
<p><strong><em>Guttenburg Galaxy</em></strong><br>&#x201C;&#x5370;&#x5237;&#x6280;&#x672F;&#x3001;&#x4E66;&#x5199;&#x5BF9;&#x4EBA;&#x6210;&#x4E3A;&#x5355;&#x4E00;&#x7684;&#x4E2A;&#x4F53;&#x7684;&#x8D21;&#x732E;&#x201D;</p>
<blockquote>
<p>&#x5171;&#x540C;&#x611F;&#x5B98;&#x4F53;&#x9A8C;&#x4E0E;&#x4E2A;&#x4EBA;&#x611F;&#x5B98;&#x4F60;&#x4F53;&#x9A8C;&#x2014;&#x2014;&#x5FAE;&#x4FE1;</p>
</blockquote>
<h5 id="M-H&#x7684;&#x8001;&#x5E08;"><a href="#M-H&#x7684;&#x8001;&#x5E08;" class="headerlink" title="M.H&#x7684;&#x8001;&#x5E08;"></a>M.H&#x7684;&#x8001;&#x5E08;</h5><p><strong><em>Bias of Communication</em></strong></p>
<ul>
<li>argued that different kinds of writing surfaces worked within and produced different kinds of empires.</li>
<li>&#x4E24;&#x79CD;&#x504F;&#x89C1;<ul>
<li><strong>Time bias</strong> &#x65F6;&#x95F4;&#x504F;&#x89C1;: -heavy, monumental &#x77F3;&#x7891;&#x7B49;&#x4E66;&#x5199;&#x754C;&#x9762;&#x2013;&#x4E2D;&#x592E;&#x96C6;&#x6743;&#x653F;&#x5E9C;</li>
<li><strong>Space bias</strong> : &#x8349;&#x7EB8;&#x7684;&#x4E66;&#x5199;&#x754C;&#x9762;  &#x975E;&#x4E2D;&#x592E;&#x96C6;&#x6743;</li>
</ul>
</li>
</ul>
<h5 id="Fridrich-Kittler"><a href="#Fridrich-Kittler" class="headerlink" title="Fridrich Kittler"></a>Fridrich Kittler</h5><p>background in Hermeneutic analyse of literature</p>
<ul>
<li><em>Discourse Network</em> 1800/1900 - analysis of literature in relation to technical system</li>
<li>1800Romantic poetry</li>
<li>1900 literature in ralation to..</li>
<li><em>Film, Gramophone,Typewriter</em> three kinds of analog mediatisation<ul>
<li>&#x5C06;&#x58F0;&#x97F3;&#x4E0E;&#x89C6;&#x89C9;&#x7684;&#x4F53;&#x9A8C;&#x8054;&#x7CFB;&#x8D77;&#x6765;</li>
<li>systematize  literature  <strong>Alphabetic Monopoly</strong><br>
<br>
#### Kittler&apos;s sources</li>
</ul>
</li>
<li>Foucault -Archoeology of Knowledge<ul>
<li>what&#x2019;s is said&#x2014;&#x2014;-&gt;enouciated</li>
<li>what&#x2019;s sayble? &#x2014;&#x2014;&gt;enouciation</li>
<li>&#x5728;&#x7279;&#x5B9A;&#x7684;&#x65F6;&#x7A7A;&#x4E2D;&#x90A3;&#x4E9B;&#x662F;&#x5DF2;&#x8BF4;&#x7684;&#xFF0C;&#x90A3;&#x4E9B;&#x662F;&#x80FD;&#x8BF4;&#x7684;  &#x4EA7;&#x51FA;&#x7684;&#x8BDD;&#x8BED;&#x6743;&#xFF1F;</li>
<li>&#x89C4;&#x5B9A;&#x7740;&#x6211;&#x4EEC;&#x8BF4;&#x8BDD;&#x7684;&#x6587;&#x5316;&#x6863;&#x6848;</li>
</ul>
</li>
<li>What&#x2019;s lacking here is a<ul>
<li>lacking&#xFF1A;&#x5A92;&#x4F53;&#x6280;&#x672F;&#x5BF9;&#x6587;&#x5316;&#x6863;&#x6848;&#x7684;&#x652F;&#x6301; meidia technology of suport</li>
<li>&#x5A92;&#x4ECB;&#x6280;&#x672F;&#x7684;&#x89C4;&#x5B9A;&#x6027;&#x4E0E;&#x754C;&#x5B9A;&#x6027;&#xFF1A;&#x5BF9;&#x4E8E;&#x2019;sayble&#x2019;  </li>
<li>technogical and meterial the suport of <strong>said</strong> or <strong>sayble</strong><h4 id="Key-theoretical-issues-in-media"><a href="#Key-theoretical-issues-in-media" class="headerlink" title="Key theoretical issues in media"></a>Key theoretical issues in media</h4></li>
</ul>
</li>
<li><strong>N.KatherineHayles</strong></li>
<li>Conflict between attention to material of the medium and to the meaning</li>
<li>Claude Shannon, methematical of Information Communications</li>
<li><img src="/2018/11/08/MarkHansen/WechatIMG355_k0lm9n4gl.jpeg">
<h4 id="Other-key-figures-in-history-of-media-study"><a href="#Other-key-figures-in-history-of-media-study" class="headerlink" title="Other key figures in history of media study"></a>Other key figures in history of media study</h4></li>
<li><em>&#x6211;&#x4EEC;&#x4F55;&#x4EE5;&#x6210;&#x4E3A;&#x540E;&#x4EBA;&#x7C7B;</em> &#x4FE1;&#x606F;&#x4E0D;&#x662F;material</li>
</ul>
<h4 id="German-versus-American-media-theroy"><a href="#German-versus-American-media-theroy" class="headerlink" title="German versus American media theroy"></a>German versus American media theroy</h4><ul>
<li>&#x5FB7;&#x56FD;&#x5728;&#x62E5;&#x62B1;&#x4E00;&#x79CD;&#x540E;&#x89E3;&#x91CA;&#x5B66;&#x7684;&#x7814;&#x7A76;&#x65B9;&#x6CD5; ex&#xFF1A;&#x57FA;&#x6797;&#x65AF;&#x57FA; &#x5A92;&#x4F53;&#x8003;&#x53E4;&#x5B66;<br>
<br>
#### Bernard Stigler</li>
<li>&#x6280;&#x672F;&#x7684;&#x8D77;&#x6E90;&#xFF1A;<img src="/2018/11/08/MarkHansen/IMG_20180604_121606_e7lh2vznm.jpg"></li>
<li>&#x4EBA;&#x4E0E;&#x6280;&#x672F;&#x7684;&#x5171;&#x5B58;&#x5173;&#x7CFB;</li>
<li><strong>Derrida</strong>  <strong>&#x4E66;&#x5199;</strong> &#x2013; <strong>&#x6280;&#x672F;</strong></li>
<li>&#x6BCF;&#x4E00;&#x79CD;&#x5A92;&#x4F53;&#x90FD;&#x662F;&#x6BD2;&#x836F;&#x540C;&#x65F6;&#x53C8;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x79CD;&#x89E3;&#x836F;<br>
<br>

</li>
</ul>
<h4 id="Mark-hansne&#x2019;s-work-within-meida-studies"><a href="#Mark-hansne&#x2019;s-work-within-meida-studies" class="headerlink" title="Mark hansne&#x2019;s work within meida studies"></a>Mark hansne&#x2019;s work within meida studies</h4><ul>
<li><p>Embodying technesis:Technology Beyond Writinig-focus on postcnostructural(Derrida, Lacan, Deleuze-Guattari)</p>
</li>
<li><p><em>New philosophy for New Media 2004</em></p>
<ul>
<li><p><strong>Borgson</strong></p>
<ul>
<li><p>perception as subception</p>
</li>
<li><p>indeterminism</p>
<p>  determinism&#x51B3;&#x5B9A;&#x8BBA;<a href="**&#x51B3;&#x5B9A;&#x8BBA;**&#xFF08;&#x53C8;&#x79F0;&#x62C9;&#x666E;&#x62C9;&#x65AF;&#x4FE1;&#x6761;&#xFF09;&#x662F;&#x4E00;&#x79CD;&#x8BA4;&#x4E3A;&#x81EA;&#x7136;&#x754C;&#x548C;&#x4EBA;&#x7C7B;&#x793E;&#x4F1A;&#x666E;&#x904D;&#x5B58;&#x5728;&#x5BA2;&#x89C2;&#x89C4;&#x5F8B;&#x548C;&#x56E0;&#x679C;&#x8054;&#x7CFB;&#x7684;&#x7406;&#x8BBA;&#x548C;&#x5B66;&#x8BF4;&#xFF0C;&#x5176;&#x4E0E;&#x975E;&#x51B3;&#x5B9A;&#x8BBA;&#x76F8;&#x5BF9;&#x3002;&#x5FC3;&#x7406;&#x5B66;&#x4E2D;&#x7684;&#x51B3;&#x5B9A;&#x8BBA;&#x8BA4;&#x4E3A;&#xFF0C;&#x4EBA;&#x7684;&#x4E00;&#x5207;&#x6D3B;&#x52A8;&#xFF0C;&#x90FD;&#x662F;&#x5148;&#x524D;&#x67D0;&#x79CD;&#x539F;&#x56E0;&#x548C;&#x51E0;&#x79CD;&#x539F;&#x56E0;&#x5BFC;&#x81F4;&#x7684;&#x7ED3;&#x679C;&#xFF0C;&#x4EBA;&#x7684;&#x884C;&#x4E3A;&#x662F;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x5148;&#x524D;&#x7684;&#x6761;&#x4EF6;&#x3001;&#x7ECF;&#x5386;&#x6765;&#x9884;&#x6D4B;&#x7684;&#x3002;">^1</a></p>
</li>
</ul>
</li>
</ul>
</li>
<li><p><em>Bodies in Code</em> 2006</p>
<ul>
<li>Fouces on Maurice</li>
</ul>
</li>
<li><p>argument</p>
</li>
<li><p><em>Feed forward</em> &#x63D0;&#x524D;&#x83B7;&#x53D6;</p>
<ul>
<li>&#x8BA1;&#x7B97;&#x673A;&#x79D1;&#x6280;&#x7684;&#x8BA1;&#x7B97;&#x901F;&#x5EA6;&#x8D8A;&#x6765;&#x8D8A;&#x5FEB;&#x4EE5;&#x81F3;&#x4E8E;&#x8D85;&#x8D8A;&#x4E86;&#x6211;&#x4EEC;&#x611F;&#x77E5;&#x8303;&#x56F4;&#x4EE5;&#x5916;</li>
<li><strong>data capitalism</strong> :&#x7531;&#x6211;&#x4EEC;&#x4EA7;&#x751F;&#x7684;&#x6570;&#x636E;&#x4E0D;&#x5C5E;&#x4E8E;&#x6211;&#x4EEC;</li>
</ul>
</li>
</ul>
<hr>
<ul>
<li><a href="https://read.douban.com/ebook/15846014/" rel="external nofollow noopener noreferrer" target="_blank"><em>&#x4F20;&#x64AD;&#x7684;&#x504F;&#x5411;</em> </a></li>
<li><a href="https://book.douban.com/subject/20492452/" rel="external nofollow noopener noreferrer" target="_blank"><em>&#x5E1D;&#x56FD;&#x4E0E;&#x4F20;&#x64AD;</em></a></li>
<li><a href="https://en.wikipedia.org/wiki/Macy_conferences" rel="external nofollow noopener noreferrer" target="_blank">&#x6885;&#x897F;&#x4F1A;&#x8BAE;</a></li>
<li>&#x63A7;&#x5236;&#x8BBA;</li>
</ul>
<hr>
<p>#Day3</p>
<ul>
<li><strong><em>Image</em></strong> (article)<ul>
<li>something about  Lev Manovich&#x2019; <strong><em>The Language of New Media</em></strong></li>
</ul>
</li>
<li>DN Rodowick <a href="http://www.hup.harvard.edu/catalog.php?isbn=9780674026988" rel="external nofollow noopener noreferrer" target="_blank"><em>Virtual life of Film</em></a></li>
</ul>
<h2 id="Kittler"><a href="#Kittler" class="headerlink" title="Kittler"></a>Kittler</h2><ul>
<li><strong><em>Grammophon Filme typewrite</em></strong></li>
<li>Kittler bold claim about digital media  <ul>
<li>michell:kittle is wrong</li>
<li>hansem:Kittler is right but not for the reason he think</li>
</ul>
</li>
</ul>
<p>alphabetic monopoly(no concept of medium)1800-1839&#x2014;&#x2014;-&gt;technical media diferentiation(1839&#x76F8;&#x673A;&#x2013;1850 &#x7559;&#x58F0;&#x673A;&#x2013;1890&#x7535;&#x5F71;)&#x2014;&#x2013;&gt;digital</p>
<pre class="mermaid">graph LR;
    a(alphabetic,<br>1800-1839)--&gt;e(&quot;technical <br>media&quot;);
    e--&gt;d(digital);</pre>


<ol>
<li>Key role of time/teaporrality</li>
<li>role of Foucault</li>
<li>shift from poetry to literature</li>
<li>Typewriter</li>
</ol>
<hr>
<h1 id="DAY4"><a href="#DAY4" class="headerlink" title="DAY4"></a>DAY4</h1><img src="/2018/11/08/MarkHansen/IMG_20180607_095323_i546zjkfa.jpg">

<p><strong>Jaffrey Shaw</strong></p>
<p><a href="https://vimeo.com/137858219" rel="external nofollow noopener noreferrer" target="_blank">vimeo&#x89C6;&#x9891;</a><br>1995&#x5E74;&#x5965;&#x5730;&#x5229;&#x6797;&#x8328;<br>&#x4F5C;&#x8005;&#xFF1A;Jeffrey Shaw<br>&#x8F6F;&#x4EF6;&#xFF1A;Adolf Matthias<br>&#x8BBE;&#x5907;&#xFF1A;Huib Nelissen<br>&#x5236;&#x4F5C;&#xFF1A;ZKM&#x827A;&#x672F;&#x4E0E;&#x5A92;&#x4F53;&#x4E2D;&#x5FC3;&#xFF0C;&#x5361;&#x5C14;&#x65AF;&#x9C81;&#x5384;[^2]</p>
<p>Primery retention<br>Secendery retention<br>terthery retention</p>
<ul>
<li>EVE expended virtual environment  </li>
</ul>
<hr>
<h1 id="Day5"><a href="#Day5" class="headerlink" title="Day5"></a>Day5</h1><p>##&#x897F;&#x8499;&#x4E1C;</p>
<p>####Induiduation &#x4E2A;&#x4F53;&#x5316;</p>
<ul>
<li><p>&#x5723;&#x8BDE;&#x8282;&#x54C8;&#x8428;&#x514B;<br>  &#x4FE1;&#x606F;&#x5B58;&#x5728;&#x4E0E;&#x4E2A;&#x4F53;&#x5316;&#x4E4B;&#x524D;</p>
</li>
<li><pre class="mermaid">graph LR

   a(information)--&gt;b(Processing--efect by media)
   b--&gt;c(human)</pre></li>
<li><p>media as mediation of human experience</p>
</li>
<li><p>media as a sort of the operationaty of the world</p>
</li>
</ul>
<p>&#x91CF;&#x5B50;&#x529B;&#x5B66;&#x5E76;&#x6CA1;&#x6709;&#x652F;&#x6301;&#x81EA;&#x7531;&#x610F;&#x5FD7;&#xFF0C;&#x53EA;&#x662F;&#x4E8E;&#x5FAE;&#x89C2;&#x4E16;&#x754C;&#x7269;&#x8D28;&#x5177;&#x6709;&#x6982;&#x7387;&#x6CE2;&#x7B49;&#x5B58;&#x5728;&#x4E0D;&#x786E;&#x5B9A;&#x6027;&#xFF0C;&#x4E0D;&#x8FC7;&#x5176;&#x4F9D;&#x7136;&#x5177;&#x6709;&#x7A33;&#x5B9A;&#x7684;&#x5BA2;&#x89C2;&#x89C4;&#x5F8B;&#xFF0C;&#x4E0D;&#x4EE5;&#x4EBA;&#x7684;&#x610F;&#x5FD7;&#x4E3A;&#x8F6C;&#x79FB;&#x3002;<br>[^2]:&#x8BE5;&#x88C5;&#x7F6E;&#x6709;&#x4E00;&#x4E2A;&#x76F4;&#x5F84;9&#x7C73;&#x7684;&#x5706;&#x67F1;&#x5F62;&#x6295;&#x5F71;&#x5C4F;&#x5E55;&#xFF0C;&#x4E2D;&#x592E;&#x6709;&#x4E00;&#x4E2A;&#x5706;&#x5F62;&#x7684;&#x673A;&#x52A8;&#x5E73;&#x53F0;&#xFF0C;&#x4E09;&#x53F0;&#x89C6;&#x9891;&#x6295;&#x5F71;&#x4EEA;&#x5C06;&#x56FE;&#x50CF;&#x4F20;&#x8F93;&#x5230;&#x5C4F;&#x5E55;&#x7684;120&#x5EA6;&#x90E8;&#x5206;&#x3002;&#x5728;&#x5C4F;&#x5E55;&#x5468;&#x56F4;&#x8FDE;&#x7EED;&#x65CB;&#x8F6C;&#x8FD9;&#x4E2A;&#x89C2;&#x5BDF;&#x7A97;&#x53E3;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x5B8C;&#x6574;&#x7684;360&#x5EA6;&#x8BA1;&#x7B97;&#x673A;&#x751F;&#x6210;&#x7684;&#x573A;&#x666F;&#x3002;&#x867D;&#x7136;&#x5DE5;&#x4F5C;&#x53D7;&#x5230;&#x63A7;&#x5236;&#xFF0C;&#x5E76;&#x4E14;&#x901A;&#x5E38;&#x4ECE;&#x5C4F;&#x5E55;&#x7684;&#x5706;&#x5468;&#x5185;&#x89C2;&#x770B;&#xFF0C;&#x8DEF;&#x4EBA;&#x4E5F;&#x53EF;&#x4EE5;&#x5728;&#x5176;&#x5916;&#x8868;&#x9762;&#x4E0A;&#x89C2;&#x770B;&#x6295;&#x5F71;&#x56FE;&#x50CF;&#x3002;<br><br>&#x8FD9;&#x9879;&#x5DE5;&#x4F5C;&#x4E2D;&#x7684;&#x7528;&#x6237;&#x754C;&#x9762;&#x662F;&#x4E00;&#x4E2A;&#x4FEE;&#x6539;&#x540E;&#x7684;&#x6444;&#x50CF;&#x673A;&#x3002;&#x901A;&#x8FC7;&#x65CB;&#x8F6C;&#x6B64;&#x76F8;&#x673A;&#x5E76;&#x4F7F;&#x7528;&#x5176;&#x7F29;&#x653E;&#x548C;&#x64AD;&#x653E;&#x6309;&#x94AE;&#xFF0C;&#x89C2;&#x770B;&#x8005;&#x53EF;&#x63A7;&#x5236;&#x5176;&#x5728;&#x865A;&#x62DF;&#x573A;&#x666F;&#x4E2D;&#x7684;&#x524D;&#x8FDB;&#xFF0C;&#x540E;&#x9000;&#x548C;&#x65CB;&#x8F6C;&#x8FD0;&#x52A8;&#xFF0C;&#x4EE5;&#x53CA;&#x5E73;&#x53F0;&#x548C;&#x6295;&#x5F71;&#x56FE;&#x50CF;&#x5728;&#x5706;&#x5F62;&#x5C4F;&#x5E55;&#x5468;&#x56F4;&#x7684;&#x65CB;&#x8F6C;&#x3002;&#x6295;&#x5F71;&#x7684;&#x666F;&#x89C2;&#x663E;&#x793A;&#x4E86;&#x4E00;&#x4E2A;&#x7535;&#x8111;&#x73AF;&#x5883;&#xFF0C;&#x6709;11&#x4E2A;&#x5706;&#x67F1;&#x4F53;&#xFF0C;&#x53EF;&#x4EE5;&#x5728;&#x4E0D;&#x540C;&#x5730;&#x70B9;&#x62CD;&#x6444;&#x5168;&#x666F;&#x98CE;&#x666F;&#x7167;&#x7247;&#xFF0C;&#x5305;&#x62EC;&#x6FB3;&#x5927;&#x5229;&#x4E9A;&#xFF0C;&#x65E5;&#x672C;&#xFF0C;&#x62C9;&#x5E15;&#x5C14;&#x9A6C;&#xFF0C;&#x5DF4;&#x5398;&#x5C9B;&#xFF0C;&#x6CD5;&#x56FD;&#x548C;&#x5FB7;&#x56FD;&#x3002;<br><br>&#x6BCF;&#x4E2A;&#x865A;&#x62DF;&#x5706;&#x67F1;&#x5177;&#x6709;&#x4E0E;&#x5B9E;&#x9645;&#x6295;&#x5F71;&#x5C4F;&#x5E55;&#x76F8;&#x540C;&#x7684;&#x9AD8;&#x5EA6;&#x548C;&#x76F4;&#x5F84;&#xFF0C;&#x4EE5;&#x4FBF;&#x5F53;&#x89C2;&#x770B;&#x8005;&#x4F4D;&#x4E8E;&#x5168;&#x666F;&#x56FE;&#x50CF;&#x7684;&#x4E2D;&#x5FC3;&#x65F6;&#xFF0C;&#x5B83;&#x586B;&#x5145;&#x5C4F;&#x5E55;&#x5E76;&#x7CBE;&#x786E;&#x91CD;&#x6784;&#x539F;&#x59CB;&#x7684;360&#x5EA6;&#x76F8;&#x673A;&#x89C6;&#x56FE;&#x3002;&#x901A;&#x8FC7;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#xFF0C;&#x827A;&#x672F;&#x54C1;&#x5C06;&#x5176;&#x5168;&#x666F;&#x56FE;&#x50CF;&#x653E;&#x7F6E;&#x5728;&#x4E00;&#x4E2A;&#x5EFA;&#x7B51;&#x6846;&#x67B6;&#x4E2D;&#xFF0C;&#x8BE5;&#x6846;&#x67B6;&#x5C06;&#x865A;&#x62DF;&#x666F;&#x89C2;&#x7684;&#x8BBE;&#x8BA1;&#x4E0E;&#x5B89;&#x88C5;&#x672C;&#x8EAB;&#x7684;&#x8BBE;&#x8BA1;&#x76F8;&#x5173;&#x8054;&#xFF0C;&#x4ECE;&#x800C;&#x4F7F;&#x865A;&#x62DF;&#x7A7A;&#x95F4;&#x548C;&#x5B9E;&#x9645;&#x7A7A;&#x95F4;&#x5728;&#x591A;&#x5C42;&#x6B21;&#x610F;&#x4E49;&#x4E0A;&#x5171;&#x540C;&#x6D3B;&#x52A8;&#x3002;<br><br>&#x8FD9;&#x4E9B;&#x5168;&#x666F;&#x5706;&#x67F1;&#x4F53;&#x653E;&#x7F6E;&#x5728;&#x5730;&#x9762;&#x4E0A;&#xFF0C;&#x6807;&#x6709;&#x5E0C;&#x4F2F;&#x5229;&#x2019;&#x751F;&#x547D;&#x4E4B;&#x6811;&#x2019;&#x56FE;&#x3002;&#x6BCF;&#x5E45;&#x5168;&#x666F;&#x7684;&#x4F4D;&#x7F6E;&#x5C06;&#x5176;&#x666F;&#x89C2;&#x7684;&#x89C6;&#x89C9;&#x7279;&#x5F81;&#x4E0E;&#x5176;&#x5728;&#x56FE;&#x4E2D;&#x7684;&#x7B26;&#x53F7;&#x4F4D;&#x7F6E;&#x7684;&#x5185;&#x6DB5;&#x8054;&#x7CFB;&#x8D77;&#x6765;&#x3002;&#x76F8;&#x673A;&#x754C;&#x9762;&#x4E0A;&#x7684;&#x53D6;&#x666F;&#x5668;&#x663E;&#x793A;&#x4E86;&#x8BE5;&#x56FE;&#x7684;&#x4E00;&#x5E45;&#x9E1F;&#x77B0;&#x56FE;&#xFF0C;&#x8BE5;&#x56FE;&#x4EE5;&#x89C2;&#x770B;&#x8005;&#x5728;&#x666F;&#x89C2;&#x4E2D;&#x7684;&#x5B9E;&#x9645;&#x4F4D;&#x7F6E;&#x52A8;&#x6001;&#x5C45;&#x4E2D;&#x3002;<br><br>&#x76F8;&#x673A;&#x63A5;&#x53E3;&#x9876;&#x90E8;&#x7684;&#x9EA6;&#x514B;&#x98CE;&#x53EF;&#x62FE;&#x53D6;&#x89C2;&#x770B;&#x8005;&#x5236;&#x4F5C;&#x7684;&#x4EFB;&#x4F55;&#x58F0;&#x97F3;&#xFF0C;&#x5E76;&#x63A7;&#x5236;&#x6295;&#x5F71;&#x573A;&#x666F;&#x4E2D;&#x6EDA;&#x52A8;&#x7684;&#x4E09;&#x7EF4;&#x6587;&#x5B57;&#x7684;&#x91CA;&#x653E;&#x3002;&#x4ECE;&#x5404;&#x79CD;&#x6765;&#x6E90;&#x5F15;&#x7528;&#xFF0C;&#x8FD9;&#x4E9B;&#x6587;&#x672C;&#x63D0;&#x4F9B;&#x4E86;&#x5173;&#x4E8E;&#x5730;&#x70B9;&#x548C;&#x8BED;&#x8A00;&#x95EE;&#x9898;&#x7684;&#x8BA8;&#x8BBA;&#x3002;&#x867D;&#x7136;&#x5B57;&#x6BCD;&#x8D77;&#x6E90;&#x4E8E;&#x5C4F;&#x5E55;&#x4E2D;&#x5FC3;&#xFF0C;&#x4F46;&#x662F;&#x89C2;&#x770B;&#x8005;&#x7684;&#x8FD0;&#x52A8;&#x5728;&#x7EC4;&#x6210;&#x4E0A;&#x51B3;&#x5B9A;&#x4E86;&#x4ED6;&#x4EEC;&#x5728;&#x865A;&#x62DF;&#x7A7A;&#x95F4;&#x4E2D;&#x7684;&#x7269;&#x7406;&#x6392;&#x5217;&#x3002;&#x5F62;&#x6210;&#x6BCF;&#x4E2A;&#x89C2;&#x4F17;&#x5728;&#x8FD9;&#x90E8;&#x4F5C;&#x54C1;&#x4E2D;&#x51FA;&#x73B0;&#x7684;&#x53D9;&#x8FF0;&#x548C;&#x7A7A;&#x95F4;&#x75D5;&#x8FF9;&#xFF0C;&#x4ED6;&#x4EEC;&#x751F;&#x6210;&#x7684;&#x5B57;&#x6BCD;&#x5728;&#x51E0;&#x5206;&#x949F;&#x540E;&#x53D8;&#x5F97;&#x8D8A;&#x6765;&#x8D8A;&#x900F;&#x660E;&#xFF0C;&#x76F4;&#x5230;&#x5B83;&#x4EEC;&#x6D88;&#x5931;&#x3002;</p>

    
    </div>
    
    
</article>




    
        <article class="article content gallery" itemscope="" itemprop="blogPost">
    <h1 class="article-title is-size-3 is-size-4-mobile" itemprop="name">
        
            <a href="/2018/11/02/landscape/" itemprop="url">银灰色的风景</a>
        
    </h1>
    <div class="article-meta columns is-variable is-1 is-multiline is-mobile is-size-7-mobile">
        <span class="column is-narrow">
            <time datetime="2018-11-01T16:02:37.000Z" itemprop="datePublished">11月 2 2018</time>
        </span>
        
        <span class="column is-narrow article-category">
            <i class="far fa-folder"></i>
            <a class="article-category-link" href="/categories/未分类/">未分类</a>
        </span>
        
        
        <span class="column is-narrow">
            
            
            几秒 lire (À propos 12 mots)
        </span>
        
    </div>
    <div class="article-entry is-size-6-mobile" itemprop="articleBody">
    
        <p><img src="https://upload-images.jianshu.io/upload_images/11111607-f2b16883283bc61c.jpg" alt=""></p>

    
    </div>
    
    
</article>




    
        <article class="article content gallery" itemscope="" itemprop="blogPost">
    <h1 class="article-title is-size-3 is-size-4-mobile" itemprop="name">
        
            <a href="/2018/11/02/cotom/" itemprop="url">Mt&amp;t 年终分享</a>
        
    </h1>
    <div class="article-meta columns is-variable is-1 is-multiline is-mobile is-size-7-mobile">
        <span class="column is-narrow">
            <time datetime="2018-11-01T16:02:22.000Z" itemprop="datePublished">11月 2 2018</time>
        </span>
        
        <span class="column is-narrow article-category">
            <i class="far fa-folder"></i>
            <a class="article-category-link" href="/categories/未分类/">未分类</a>
        </span>
        
        
        <span class="column is-narrow">
            
            
            2 分钟 lire (À propos 335 mots)
        </span>
        
    </div>
    <div class="article-entry is-size-6-mobile" itemprop="articleBody">
    
        <h1 id="2018-&#x5E74;&#x7EC8;"><a href="#2018-&#x5E74;&#x7EC8;" class="headerlink" title="2018 &#x5E74;&#x7EC8;"></a>2018 &#x5E74;&#x7EC8;</h1><h3 id="&#x4F1A;&#x8BAE;&#x65E5;&#x7A0B;-&#x2013;-Adamy"><a href="#&#x4F1A;&#x8BAE;&#x65E5;&#x7A0B;-&#x2013;-Adamy" class="headerlink" title="&#x4F1A;&#x8BAE;&#x65E5;&#x7A0B; &#x2013; Adamy"></a>&#x4F1A;&#x8BAE;&#x65E5;&#x7A0B; &#x2013; Adamy</h3><p>12.23 &#x6D3B;&#x52A8;&#x65E5;&#x7A0B; 19&#xFF1A;00 - 21&#xFF1A;00<br>&#x6D3B;&#x52A8;&#x89C4;&#x5219;&#xFF1A;<br>19&#xFF1A;00 &#x8BFB;&#x4E66;&#x4F1A;+&#x5171;&#x4EAB;&#x8D44;&#x6E90;&#x5E93;&#x65B0;&#x7B56;&#x5212;<br>19&#xFF1A;15 &#x8BFB;&#x4E66;&#x4F1A;&#x4E66;&#x5355;&#x5546;&#x8BAE;<br>19&#xFF1A;30 &#x5171;&#x4EAB;&#x8D44;&#x6E90;&#x5E93;&#x64CD;&#x4F5C;&#x8BB2;&#x89E3;&#x4E0E;&#x7EC3;&#x4E60;<br>20&#xFF1A;00 &#x5218;&#x8FEA;&#x5148;&#x5206;&#x4EAB;<br>20&#xFF1A;20 &#x7F57;&#x723D;&#x5206;&#x4EAB;<br>20&#xFF1A;40 &#x6768;&#x4F1F;&#x5149;&#x5206;&#x4EAB;</p>
<hr>
<h3 id="CATwiki-&#x7ED3;&#x6784;"><a href="#CATwiki-&#x7ED3;&#x6784;" class="headerlink" title="CATwiki &#x7ED3;&#x6784;"></a>CATwiki &#x7ED3;&#x6784;</h3><p>&#x5206;&#x7C7B;&#xFF1A;</p>
<ul>
<li>&#x5A92;&#x4F53;&#x827A;&#x672F;&#x7406;&#x8BBA;</li>
<li>&#x827A;&#x672F;&#x5BB6;</li>
<li>&#x5C55;&#x89C8;</li>
<li>&#x6280;&#x672F;&#x5A92;&#x4ECB;</li>
</ul>
<p>&#x6839;&#x6807;&#x7B7E;&#xFF1A;</p>
<hr>
<h3 id="&#x8BFB;&#x4E66;&#x5C0F;&#x7EC4;&#x8BA1;&#x5212;"><a href="#&#x8BFB;&#x4E66;&#x5C0F;&#x7EC4;&#x8BA1;&#x5212;" class="headerlink" title="&#x8BFB;&#x4E66;&#x5C0F;&#x7EC4;&#x8BA1;&#x5212;"></a>&#x8BFB;&#x4E66;&#x5C0F;&#x7EC4;&#x8BA1;&#x5212;</h3><ol>
<li><p>&#x8BB8;&#x715C;&#x300A;&#x9012;&#x5F52;&#x4E0E;&#x5076;&#x7136;&#x300B;(Recursivity and Contingency)&#xFF08;Howard Caygill&#x5E8F;, Rowman and Littlefield International, Spring 2019&#xFF09;</p>
</li>
<li><p>&#x5343;&#x9AD8;&#x539F; &#x5FB7;&#x52D2;&#x5179;</p>
</li>
<li><p>Lyotard_Jean-Francois_The_Postmodern_Condition_A_Report_on_Knowledge</p>
</li>
<li><p>Donna J. Haraway-Simians, Cyborgs, and Women_ The Reinvention of Nature-Routledge (1991)</p>
</li>
<li><p>Bruno Latour-We Have Never Been Modern-Harvard University Press (1993)</p>
</li>
<li><p>(Clarendon Lectures in Management Studies) Bruno Latour-Reassembling the Social_ An Introduction to Actor-Network-Theory-Oxford University Press, USA (2005)</p>
</li>
<li><p>Bruno LaTour-Laboratory Life_ The Construction of Scientific Facts-Princeton University Press (1986)</p>
</li>
<li><p>The Stack: On Software and Sovereignty. By Benjamin H. Bratton</p>
</li>
<li><p>Michel Serres and Bruno Latour-Conversations on Science, Culture, and Time_ Michel Serres with Bruno Latour (Studies in Literature and Science)-University of Michigan Press (1995)</p>
</li>
<li><p>Critical Terms for Media Studies|eds. W.J.T  Mitchell and Mark B.N Hansen|University of Chicago Press</p>
</li>
</ol>
<ul>
<li>&#x5218;&#x8FEA;&#x5148;<ol>
<li>&#x5A92;&#x4F53;&#x827A;&#x672F;&#x7F51;&#x7EDC;</li>
<li>&#x6280;&#x672F;&#x4E0E;&#x65F6;&#x95F4;I</li>
<li>&#x601D;&#x8003;&#x5FEB;&#x4E0E;&#x6162;</li>
<li>&#x589E;&#x957F;&#x7684;&#x6781;&#x9650;</li>
<li>&#x6211;&#x4EEC;&#x4ECE;&#x672A;&#x73B0;&#x4EE3;&#x8FC7;</li>
<li>The stack</li>
<li>GEB</li>
<li>George Zarkadakis-In Our Own Image_ Savior or Destroyer_-Pegasus Books (2016)</li>
<li>James Bridle-New Dark Age - Technology and the End of the Future</li>
<li>Network undersea</li>
<li>A prehistory of cloud</li>
</ol>
</li>
</ul>
<h3 id="&#x4E3B;&#x9898;&#x5206;&#x4EAB;"><a href="#&#x4E3B;&#x9898;&#x5206;&#x4EAB;" class="headerlink" title="&#x4E3B;&#x9898;&#x5206;&#x4EAB;"></a>&#x4E3B;&#x9898;&#x5206;&#x4EAB;</h3><ul>
<li>&#x5206;&#x4EAB;&#x4F60;&#x89C9;&#x5F97;&#x6709;&#x4EF7;&#x503C;&#x7684;&#x4E1C;&#x897F; 20&#x2019;</li>
</ul>
<hr>
<p>&#x65E7;&#x4E66;&#x5355; <a href="https://hackmd.io/jT3qgP4qQgeOQF2IXKpj8Q" rel="external nofollow noopener noreferrer" target="_blank">https://hackmd.io/jT3qgP4qQgeOQF2IXKpj8Q</a></p>

    
    </div>
    
    
</article>




    
        <article class="article content gallery" itemscope="" itemprop="blogPost">
    <h1 class="article-title is-size-3 is-size-4-mobile" itemprop="name">
        
            <a href="/2018/11/01/listenning/" itemprop="url">Listenning</a>
        
    </h1>
    <div class="article-meta columns is-variable is-1 is-multiline is-mobile is-size-7-mobile">
        <span class="column is-narrow">
            <time datetime="2018-11-01T04:42:51.000Z" itemprop="datePublished">11月 1 2018</time>
        </span>
        
        <span class="column is-narrow article-category">
            <i class="far fa-folder"></i>
            <a class="article-category-link" href="/categories/Interactive-Art/">Interactive Art</a>
        </span>
        
        
        <span class="column is-narrow">
            
            
            几秒 lire (À propos 108 mots)
        </span>
        
    </div>
    <div class="article-entry is-size-6-mobile" itemprop="articleBody">
    
        <h4 id="&#x542C;"><a href="#&#x542C;" class="headerlink" title="&#x542C;"></a><em>&#x542C;</em></h4><p><strong>2018 &#x6C89;&#x6D78;&#x5F0F;&#x4EA4;&#x4E92;&#x73B0;&#x573A;&#x4F53;&#x9A8C;&#x7A7A;&#x95F4; V2_ &#x4E0D;&#x7A33;&#x5B9A;&#x5A92;&#x4F53;&#x5B9E;&#x9A8C;&#x5BA4; &#x8377;&#x5170; &#x9E7F;&#x7279;&#x4E39;</strong> <img src="http://47.106.34.239/wp-content/uploads/2018/11/Listenning-pic_%E7%94%BB%E6%9D%BF-1-212x300.png" alt=""><img src="http://47.106.34.239/wp-content/uploads/2018/11/Listenning-pic_%E7%94%BB%E6%9D%BF-1-%E5%89%AF%E6%9C%AC-212x300.png" alt=""> <img src="http://47.106.34.239/wp-content/uploads/2018/11/Listenning-pic_%E7%94%BB%E6%9D%BF-1-%E5%89%AF%E6%9C%AC-2-212x300.png" alt=""> <img src="http://47.106.34.239/wp-content/uploads/2018/11/Listenning-pic_%E7%94%BB%E6%9D%BF-1-%E5%89%AF%E6%9C%AC-3-212x300.png" alt=""> <img src="http://47.106.34.239/wp-content/uploads/2018/11/Listenning-pic_%E7%94%BB%E6%9D%BF-1-%E5%89%AF%E6%9C%AC-4-212x300.png" alt=""> <img src="http://47.106.34.239/wp-content/uploads/2018/11/Listenning-pic_%E7%94%BB%E6%9D%BF-1-%E5%89%AF%E6%9C%AC-5-212x300.png" alt=""> <img src="http://47.106.34.239/wp-content/uploads/2018/11/Listenning-pic_%E7%94%BB%E6%9D%BF-1-%E5%89%AF%E6%9C%AC-6-212x300.png" alt=""></p>

    
    </div>
    
    
</article>




    
        <article class="article content gallery" itemscope="" itemprop="blogPost">
    <h1 class="article-title is-size-3 is-size-4-mobile" itemprop="name">
        
            <a href="/2018/05/10/Zielinski/" itemprop="url">Zielinski</a>
        
    </h1>
    <div class="article-meta columns is-variable is-1 is-multiline is-mobile is-size-7-mobile">
        <span class="column is-narrow">
            <time datetime="2018-05-09T16:25:33.000Z" itemprop="datePublished">5月 10 2018</time>
        </span>
        
        
        <span class="column is-narrow">
            
            
            14 分钟 lire (À propos 2060 mots)
        </span>
        
    </div>
    <div class="article-entry is-size-6-mobile" itemprop="articleBody">
    
        <h1 id="2018-5-15-&#x4E0A;&#x5348;-prospective-archeology&#x5C55;&#x671B;&#x5F0F;&#x8003;&#x53E4;&#x5B66;"><a href="#2018-5-15-&#x4E0A;&#x5348;-prospective-archeology&#x5C55;&#x671B;&#x5F0F;&#x8003;&#x53E4;&#x5B66;" class="headerlink" title="2018/5/15 &#x4E0A;&#x5348;-prospective archeology&#x5C55;&#x671B;&#x5F0F;&#x8003;&#x53E4;&#x5B66;"></a>2018/5/15 &#x4E0A;&#x5348;-prospective archeology&#x5C55;&#x671B;&#x5F0F;&#x8003;&#x53E4;&#x5B66;</h1><h3 id="I"><a href="#I" class="headerlink" title="I"></a>I</h3><p>Prospective archology &#x2013; respective archology&#xFF08;&#x56DE;&#x6EAF;&#x7684;&#xFF0C;&#x8003;&#x53E4;&#x5B66;&#xFF0C;&#x662F;&#x4F20;&#x7EDF;&#x7684;&#x8003;&#x53E4;&#x5B66;&#xFF09;</p>
<p>organ projection&#x5668;&#x5B98;&#x6295;&#x5C04;<br><strong>massage</strong> &#x6309;&#x6469; &#x63A8;&#x62FF;</p>
<ul>
<li>the medium is the massage</li>
</ul>
<p><em>ernst kapp</em>&#x6280;&#x672F;&#x54F2;&#x5B66;&#x5148;&#x9A71; 18**
<a href="https://en.wikipedia.org/wiki/Ernst_Kapp" rel="external nofollow noopener noreferrer" target="_blank">ERnst kapp</a><br>&#x5361;&#x666E;&#x7684;&#x300A;&#x6280;&#x672F;&#x54F2;&#x5B66;&#x7EB2;&#x8981;&#x300B;[^1]</p>
<p>&lt;organ projection: Bonelike crane Kapp 1877&gt;<br>Extelligence</p>
<p>Q&amp;A<br>&#x8868;&#x6F14;&#x827A;&#x672F;&#xFF1F;&#x8868;&#x6F14;&#x827A;&#x672F;&#x662F;&#x5BF9;&#x7535;&#x5B50;&#x9769;&#x547D;&#x7684;&#x6279;&#x8BC4;&#x2026;&#x8868;&#x6F14;&#x827A;&#x672F;&#x662F;&#x4E0E;&#x5973;&#x6027;&#x6709;&#x975E;&#x5E38;&#x5F3A;&#x7684;&#x5173;&#x8054;&#x6027;&#x5BF9;&#x4E8E;&#x7537;&#x6027;&#x4E3B;&#x5BFC;&#x7684;&#x7535;&#x5B50;&#x6587;&#x5316;/&#x827A;&#x672F;&#x7684;&#x76F8;&#x5BF9;&#x7684;&#x9762;&#x7684;&#x76F8;&#x5E94;&#x53CD;&#x5E94;</p>
<p>&#x5EF6;&#x5C55;&#x7535;&#x5F71;  &#x2013; &#x770B;&#x7535;&#x5F71;&#x662F;&#x8981;&#x6EE1;&#x8DB3;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#x6B32;&#x671B;&#xFF1F;</p>
<h3 id="II"><a href="#II" class="headerlink" title="II"></a>II</h3><p>&#x611F;&#x5B98;&#x7684;&#x7B49;&#x7EA7;&#x4E0E;&#x5E73;&#x7B49;</p>
<p>&#x5149;&#x2013;&#x79EF;&#x6781;&#x4E0E;&#x6D88;&#x6781;<br>&#x79EF;&#x6781;&#x2013;&#x5FB7;&#x56FD;&#xFF0C;&#x5317;&#x6B27;<br>&#x6D88;&#x6781;&#x2013;&#x58A8;&#x5BB6;[^2](&#x3001;&#x4E2D;&#x56FD;&#x7684;&#x5973;&#x6027;</p>
<p>&#x900F;&#x955C;<br>&#x58A8;&#x5BB6;<br>&#x6C88;&#x62EC;[^3]</p>
<h3 id="III-Deep-Time-and-its-consequencess"><a href="#III-Deep-Time-and-its-consequencess" class="headerlink" title="III Deep Time(and its consequencess)"></a>III Deep Time(and its consequencess)</h3><ul>
<li>deep time <em>&#x6DF1;&#x6C89;&#x65F6;&#x95F4;</em></li>
<li>Archaeology <em>&#x8003;&#x53E4;&#x5B66;</em></li>
<li>Genealogy <em>&#x8C31;&#x7CFB;&#x5B66;</em></li>
<li>Variantology <em>&#x53D8;&#x4F53;&#x5B66;</em></li>
</ul>
<p>deep time conceptine&#x7684;&#x6295;&#x5C04;&#x2014;<em>James Hutton:Theory of earth1795</em>[^4]</p>
<p>THE MACHINE WITH 2 TIME ARROWS DEEP TIME <a href=""><em>PICTURE</em></a></p>
<ul>
<li>the / Option / Version <em>Bunuel/Dali, Andalousian Dog 1929</em> [^5]<ul>
<li>&#x5E73;&#x884C;&#x8499;&#x592A;&#x5947;</li>
</ul>
</li>
<li>Abu Zayd iba lshaq al-lbadi (808-873) &#x2013;&#x963F;&#x62C9;&#x4F2F;&#x7684;&#x773C;&#x7403;&#x89E3;&#x5256;<ul>
<li>&#x773C;&#x775B;&#x4E0E;&#x8111;()&#x7684;&#x8054;&#x7CFB; <em>&#x89C6;&#x89C9;&#x4E0E;&#x8BA4;&#x8BC6;&#x7684;&#x8054;&#x7CFB;&#xFF1F;</em><blockquote>
<p>music/Sound/Noise<br>Cassetta mathematica<br>Athanasius Kircher 1630s<br>object: Florence<br><strong>&#x6570;&#x5B66;-&#x97F3;&#x4E50;</strong><br>kischer<br><img src="https://upload.wikimedia.org/wikipedia/commons/thumb/a/a5/Athanasius_Kircher.jpg/1024px-Athanasius_Kircher.jpg" alt=""><br><img src="https://upload.wikimedia.org/wikipedia/commons/thumb/a/ae/Organum_Mathematicum.jpg/1024px-Organum_Mathematicum.jpg" alt=""></p>
</blockquote>
</li>
</ul>
</li>
</ul>
<p>&#x201C;&#x201C;&#x5408;&#x4F17;&#x4E3A;&#x4E00;&#x201D;&#xFF08;&#x62C9;&#x4E01;&#x8BED;&#xFF1A;E pluribus unum&#xFF0C;&#x82F1;&#x8BED;&#xFF1A;Out of Many, One&#xFF09;&#x662F;&#x7F8E;&#x56FD;&#x56FD;&#x5FBD;&#x4E0A;&#x7684;&#x683C;&#x8A00;&#x4E4B;&#x4E00;&#xFF0C;&#x51FA;&#x73B0;&#x5728;&#x56FD;&#x5FBD;&#x7684;&#x6B63;&#x9762;&#x3002;&#x201D; <img src="/2018/05/10/Zielinski/" alt="PICTURE">&#x2014;-&#x827A;&#x672F;&#x5BB6;&#x7684;&#x4EFB;&#x52A1;&#xFF08;&#x3002;&#x3002;&#x3002;&#xFF09;</p>
<h1 id="III-Generator-of-Surprise-1"><a href="#III-Generator-of-Surprise-1" class="headerlink" title="III Generator of Surprise 1:"></a>III Generator of Surprise 1:</h1><pre><code># Expanded Animation &#x5EF6;&#x5C55;&#x52A8;&#x753B;
glass projection
&#x4E66;&#x7C4D;-&#x7FFB;&#x9875;&#x52A8;&#x753B;

...
...
...</code></pre><p>&#x516D;&#x79CD;&#x6A21;&#x5F0F;</p>
<ol>
<li>to bring liefe to the hard and dry material</li>
<li>death as &#x3002;&#x3002;&#x3002;</li>
<li>&#x2026;</li>
<li>&#x2026;</li>
<li>Animations of dead bodies</li>
<li>Computing the physical</li>
</ol>
<p><img src="/2018/05/10/Zielinski/WechatIMG151.png" alt="WechatIMG151"></p>
<h1 id="IIII-&#x58F0;&#x97F3;&#x827A;&#x672F;&#x8C31;&#x7CFB;"><a href="#IIII-&#x58F0;&#x97F3;&#x827A;&#x672F;&#x8C31;&#x7CFB;" class="headerlink" title="IIII &#x58F0;&#x97F3;&#x827A;&#x672F;&#x8C31;&#x7CFB;"></a>IIII &#x58F0;&#x97F3;&#x827A;&#x672F;&#x8C31;&#x7CFB;</h1><p>&#x7B26;&#x53F7;&#x5B66;&#x7406;&#x8BBA;&#x89E3;&#x91CA;<br>
&#x65E0;&#x7AEF;&#x8003;&#x53E4;&#x5B66;&#x4E2D;&#x7684;&#x58F0;&#x97F3;</p>
<h3 id="&#x4E3A;&#x8C01;&#x8C03;&#x97F3;&#x3001;&#x8C03;&#x97F3;&#x7684;&#x673A;&#x5236;-&#x6280;&#x672F;"><a href="#&#x4E3A;&#x8C01;&#x8C03;&#x97F3;&#x3001;&#x8C03;&#x97F3;&#x7684;&#x673A;&#x5236;-&#x6280;&#x672F;" class="headerlink" title="&#x4E3A;&#x8C01;&#x8C03;&#x97F3;&#x3001;&#x8C03;&#x97F3;&#x7684;&#x673A;&#x5236;(&#x6280;&#x672F;)"></a>&#x4E3A;&#x8C01;&#x8C03;&#x97F3;&#x3001;&#x8C03;&#x97F3;&#x7684;&#x673A;&#x5236;(&#x6280;&#x672F;)</h3><p>&#x4F5C;&#x4E3A;&#x793E;&#x4F1A;&#x6D3B;&#x52A8;&#x7684;&#x6F14;&#x594F;&#x4E2D;&#xFF0C;&#x8C03;&#x97F3;&#x53D8;&#x6210;&#x975E;&#x5E38;&#x91CD;&#x8981;&#x7684;&#x56E0;&#x7D20;</p>
<h5 id="&#x8C03;&#x97F3;&#x5728;&#x4E0D;&#x540C;&#x5730;&#x57DF;&#x4E0E;&#x6587;&#x5316;&#x7684;deep-time&#x5206;&#x6790;"><a href="#&#x8C03;&#x97F3;&#x5728;&#x4E0D;&#x540C;&#x5730;&#x57DF;&#x4E0E;&#x6587;&#x5316;&#x7684;deep-time&#x5206;&#x6790;" class="headerlink" title="&#x8C03;&#x97F3;&#x5728;&#x4E0D;&#x540C;&#x5730;&#x57DF;&#x4E0E;&#x6587;&#x5316;&#x7684;deep time&#x5206;&#x6790;"></a><strong>&#x8C03;&#x97F3;&#x5728;&#x4E0D;&#x540C;&#x5730;&#x57DF;&#x4E0E;&#x6587;&#x5316;&#x7684;deep time&#x5206;&#x6790;</strong></h5><p>&#x6BD5;&#x8FBE;&#x54E5;&#x62C9;&#x65AF;&#x7684;&#x6570;&#x5B66;&#x7406;&#x8BBA;&#x4E0E;&#x8C03;&#x97F3;<br>&#x901A;&#x8FC7;&#x6570;&#x5B66;&#x5F62;&#x5F0F;&#x7684;&#x8C03;&#x97F3;&#x5F52;&#x6839;&#x7ED3;&#x5E95;&#x662F;&#x4E00;&#x4E2A;&#x6570;&#x5B66;&#x4E0E;&#x51E0;&#x4F55;&#x5B66;&#x7684;&#x8BA1;&#x7B97;&#x95EE;&#x9898;<br>&#x6BD4;&#x4F8B;&#x2014;&#x4E0A;&#x5E1D;&#x5B8C;&#x7F8E;&#x7684;&#x8C03;&#x97F3;<br>&#x5F26;&#x2013;&#x8FDE;&#x63A5;&#x4EBA;&#x4E0E;&#x4E0A;&#x5E1D;&#x7684;&#x5A92;&#x4ECB;&#x2026;angle<br><a href="https://en.wikipedia.org/wiki/Macrocosm_and_microcosm" rel="external nofollow noopener noreferrer" target="_blank">Macrocosm and microcosm</a><br><img src="/2018/05/10/Zielinski/WechatIMG168.jpeg" alt="WechatIMG168"></p>
<h1 id="5-17"><a href="#5-17" class="headerlink" title="5/17"></a>5/17</h1><p>&#x57FA;&#x7279;&#x5C14;&#x7684; &#x6765;&#x81EA;&#x62C9;&#x5EB7;&#x7684;&#x601D;&#x60F3;&#x7684;&#x53D1;&#x660E;&#x2014; &#x7535;&#x5F71;&#x3001;&#x6253;&#x5B57;&#x673A;&#x3001;&#x7559;&#x58F0;&#x673A;</p>
<p>&#x300A;&#x65F6;&#x95F4;/&#x65E0;&#x95F4;&#x300B; &#x2013;&#x674E;&#x632F;&#x534E;&#xFF01; &#x6DF1;&#x5733;&#x52A8;&#x753B;&#x53CC;&#x5E74;&#x5C55; catalog</p>
<p><a href="https://book.douban.com/subject/27614599/" rel="external nofollow noopener noreferrer" target="_blank">&#x300A;&#x6444;&#x5F71;&#x54F2;&#x5B66;&#x7684;&#x601D;&#x8003;&#x300B;</a></p>
<p><a href="https://sam.arts.unsw.edu.au/about-us/people/julian-murphet/" rel="external nofollow noopener noreferrer" target="_blank">julian murphet</a><br>&#x9AD8;&#x9891;&#x7B97;&#x6CD5;&#x8BD7;&#x6B4C;<br>&#x8BED;&#x4E49;&#xFF0C;&#x53E5;&#x6CD5;&#x6392;&#x5217;<br>david link      &#x2014;poetry mechine<br><a href="https://zh.wikipedia.org/zh-hans/%E9%A9%AC%E5%B0%94%E5%8F%AF%E5%A4%AB%E9%93%BE" rel="external nofollow noopener noreferrer" target="_blank">&#x9A6C;&#x5C14;&#x79D1;&#x592B;&#x94FE;</a><br>&#x8F93;&#x5165;&#x6CD5;&#x7684;&#x81EA;&#x52A8;&#x7EA0;&#x9519;&#x529F;&#x80FD; <a href="https://www.zhihu.com/question/26665048" rel="external nofollow noopener noreferrer" target="_blank">zhihu</a><br><a href="https://zkm.de/en/event/2017/04/nanni-balestrini-for-anyone-reading-ths-there-is-nothing-left-to-fear/TAPE-MARK-1-by-Nanni-Balestrini" rel="external nofollow noopener noreferrer" target="_blank">TAPE-MARK-1-by-Nanni-Balestrini</a><br><img src="/2018/05/10/Zielinski/WechatIMG261.jpeg" alt="WechatIMG261"></p>
<p>Umberto Eco<a href="https://zh.wikipedia.org/wiki/%E7%BF%81%E8%B4%9D%E6%89%98%C2%B7%E5%9F%83%E5%8F%AF" rel="external nofollow noopener noreferrer" target="_blank">&#x7FC1;&#x8D1D;&#x6258;&#xB7;&#x827E;&#x67EF;</a>&#x7528;&#x81EA;&#x52A8;&#x7EA0;&#x9519;&#x7684;&#x7B97;&#x6CD5;&#x6765;&#x521B;&#x9020;&#x8BD7;&#x6B4C;&#xFF0C;&#x6539;&#x53D8;&#x673A;&#x5668;&#x672C;&#x6765;&#x7684;&#x7528;&#x9014;&#x2026;</p>
<pre><code># &#x8BA8;&#x8BBA;
&#x7B97;&#x6CD5;&#x672C;&#x6765;&#x5C31;&#x6CA1;&#x4EC0;&#x4E48;&#x56FA;&#x5B9A;&#x7684;&#x529F;&#x80FD;...</code></pre><p><a href="http://www.flusser-archive.org/" rel="external nofollow noopener noreferrer" target="_blank">flusser&#x6863;&#x6848;</a></p>
<p>&#x4EA4;&#x4E92;&#x754C;&#x9762;&#x8981;&#x8EB2;&#x5728;&#x4EC0;&#x4E48;&#x4E4B;&#x540E;&#xFF1F;<br>&#x76AE;&#x80A4;-&#x7EB9;&#x8EAB;-&#x754C;&#x9762;<br>&#x754C;&#x9762;-&#x5EFA;&#x7B51;&#x88C5;&#x6F62;<br>&#x754C;&#x9762;&#x2013;&#x70DF;&#x706B;&#x4E0E;&#x5929;&#x7A7A;</p>
<h1 id="5-18-&#x65E0;&#x7AEF;&#x8003;&#x53E4;&#x5B66;-an-archology"><a href="#5-18-&#x65E0;&#x7AEF;&#x8003;&#x53E4;&#x5B66;-an-archology" class="headerlink" title="5/18 &#x65E0;&#x7AEF;&#x8003;&#x53E4;&#x5B66;  an-archology"></a>5/18 &#x65E0;&#x7AEF;&#x8003;&#x53E4;&#x5B66;  an-archology</h1><p>&#x5BF9;&#x6D77;&#x5FB7;&#x683C;&#x5C14;&#x7684;&#x6279;&#x5224;<br>&#x53D1;&#x660E;&#x65B0;&#x7684;&#x6863;&#x6848;&#x7BA1;&#x7406;&#x65B9;&#x5F0F;<br>&#x201C;Surprise Generator&#x201D;&#x6765;&#x81EA;&#x5206;&#x5B50;&#x751F;&#x7269;&#x5B66;</p>
<ol>
<li>&#x6863;&#x6848;&#x2013;</li>
<li>&#x6863;&#x6848;&#x7684;&#x610F;&#x4E49;&#x53D1;&#x751F;&#x53D8;&#x5316;</li>
<li></li>
</ol>
<p><strong>archive</strong></p>
<ul>
<li>supervison</li>
<li>subvision</li>
</ul>
<p>&#x65E0;&#x7AEF;&#x8003;&#x53E4;&#x5B66;&#x6863;&#x6848;&#x9986;</p>
<ol>
<li>&#x65E0;&#x76F4;&#x89D2;&#x7684;&#x3001;&#x52A8;&#x6001;&#x7684;&#xFF0C;&#x6709;&#x7740;&#x7535;&#x5B50;&#x76AE;&#x80A4;&#x7684;-&#x754C;&#x9762;<img src="/2018/05/10/Zielinski/WechatIMG334.jpeg" alt="WechatIMG334"></li>
<li>&#x6F02;&#x6D6E;&#x5728;&#x7A7A;&#x4E2D;&#x7684;&#xFF0C;&#x4E0D;&#x7A33;&#x5B9A;&#x7684;&#x4E09;&#x4E2A;&#x7403;&#x72B6;&#x7269;</li>
</ol>
<p>&#x74E6;&#x5C14;&#x5821;&#x7684;&#x89C6;&#x89C9;&#x5316;&#x8D44;&#x6E90;&#x5899;</p>
<p><img src="/2018/05/10/Zielinski/IMG_20180518_110232_fajp0caef.jpg" alt="&#x74E6;&#x5C14;&#x5821;&#x7684;&#x89C6;&#x89C9;&#x5316;&#x8D44;&#x6E90;&#x5899;"></p>
<p>&#x827A;&#x672F;&#x4F5C;&#x54C1;&#x7684;&#x6863;&#x6848;&#x7BA1;&#x7406;</p>
<p>&#x6208;&#x8FBE;&#x5C14;&#x7684;&#x7535;&#x5F71;&#x53F2;&#x7535;&#x5F71;</p>
<p>&#x62C9;&#x5EB7; &#x4E09;&#x754C;</p>
<p>[^1]:(Ctundlinien einer Philosophie der Technik&#xFF0C;1877)&#xFF0C;&#x88AB;&#x8BA4;&#x4E3A;&#x662F;&#x6280;&#x672F;&#x54F2;&#x5B66;&#x7684;&#x5960;&#x57FA;&#x6027;&#x8457;&#x4F5C;&#x3002;&#x8BE5;&#x4E66;&#x7528;&#x4E86;&#x4E00;&#x4E2A;&#x526F;&#x6807;&#x9898;&#x201C;&#x4ECE;&#x65B0;&#x89C2;&#x70B9;&#x770B;&#x6587;&#x5316;&#x53D1;&#x751F;&#x53F2;&#x201D;&#xFF0C;&#x5E76;&#x63D0;&#x51FA;&#x4E86;&#x5DE5;&#x5177;&#x548C;&#x5668;&#x7269;&#x662F;&#x4EBA;&#x4F53;&#x5668;&#x5B98;&#x6295;&#x5F71;&#x7684;&#x6838;&#x5FC3;&#x6982;&#x5FF5;&#x4E0E;&#x7406;&#x8BBA;&#x3002;&#x8FD9;&#x8868;&#x660E;&#xFF0C;&#x5361;&#x666E;&#x8BD5;&#x56FE;&#x7528;&#x5668;&#x5B98;&#x6295;&#x5F71;&#x8BBA;&#x7684;&#x65B0;&#x89C2;&#x70B9;&#xFF0C;&#x901A;&#x8FC7;&#x4F5C;&#x4E3A;&#x6280;&#x672F;&#x6587;&#x5316;&#x7684;&#x5DE5;&#x5177;&#x53D1;&#x751F;&#x5386;&#x7A0B;&#x6765;&#x89E3;&#x91CA;&#x4EBA;&#x7C7B;&#x6587;&#x5316;&#x7684;&#x6F14;&#x8FDB;&#x5386;&#x53F2;&#x3002;&#x5361;&#x666E;&#x8BA4;&#x4E3A;&#xFF0C;&#x4EBA;&#x4F53;&#x7684;&#x5916;&#x5F62;&#x548C;&#x529F;&#x80FD;&#x603B;&#x662F;&#x4F5C;&#x4E3A;&#x4EBA;&#x7C7B;&#x6700;&#x7406;&#x89E3;&#x7684;&#x5BA2;&#x89C2;&#x5B58;&#x5728;&#xFF0C;&#x5F53;&#x6210;&#x521B;&#x9020;&#x6280;&#x672F;&#x7684;&#x5916;&#x5F62;&#x548C;&#x529F;&#x80FD;&#x7684;&#x5C3A;&#x5EA6;&#xFF0C;&#x6295;&#x5F71;&#x5230;&#x5916;&#x90E8;&#x73AF;&#x5883;&#xFF1A;&#x6240;&#x6709;&#x5DE5;&#x5177;&#x7684;&#x6E90;&#x6CC9;&#x548C;&#x672C;&#x539F;&#x7684;&#x6280;&#x672F;&#xFF0C;&#x90FD;&#x662F;&#x5EFA;&#x7ACB;&#x5728;&#x4EBA;&#x7684;&#x5668;&#x5B98;&#x7279;&#x522B;&#x662F;&#x624B;&#x7684;&#x57FA;&#x7840;&#x4E4B;&#x4E0A;&#x7684;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x4EBA;&#x662F;&#x5236;&#x9020;&#x5668;&#x7269;&#x7684;&#x5C3A;&#x5EA6;&#x3002;&#x4ED6;&#x6307;&#x51FA;&#xFF1A;&#x201C;&#x5728;&#x5DE5;&#x5177;&#x548C;&#x5668;&#x5B98;&#x4E4B;&#x95F4;&#x6240;&#x5448;&#x73B0;&#x7684;&#x90A3;&#x79CD;&#x5185;&#x5728;&#x7684;&#x5173;&#x7CFB;&#xFF0C;&#x4EE5;&#x53CA;&#x4E00;&#x79CD;&#x5C06;&#x8981;&#x88AB;&#x63ED;&#x793A;&#x548C;&#x5F3A;&#x8C03;&#x7684;&#x5173;&#x7CFB;&#x2014;&#x2014;&#x5C3D;&#x7BA1;&#x8F83;&#x4E4B;&#x4E8E;&#x6709;&#x610F;&#x8BC6;&#x7684;&#x53D1;&#x660E;&#x800C;&#x8A00;&#xFF0C;&#x4ED6;&#x66F4;&#x591A;&#x5730;&#x662F;&#x4E00;&#x79CD;&#x65E0;&#x610F;&#x8BC6;&#x7684;&#x53D1;&#x73B0;&#x2014;&#x2014;&#x5C31;&#x662F;&#x4EBA;&#x901A;&#x8FC7;&#x5DE5;&#x5177;&#x4E0D;&#x65AD;&#x5730;&#x521B;&#x9020;&#x81EA;&#x5DF1;&#x3002;&#x56E0;&#x4E3A;&#x5176;&#x6548;&#x7528;&#x548C;&#x529B;&#x91CF;&#x65E5;&#x76CA;&#x589E;&#x957F;&#x7684;&#x5668;&#x5B98;&#x662F;&#x63A7;&#x5236;&#x7684;&#x56E0;&#x7D20;&#xFF0C;&#x6240;&#x4EE5;&#x4E00;&#x79CD;&#x5DE5;&#x5177;&#x7684;&#x4F55;&#x65F6;&#x5F62;&#x5F0F;&#x53EA;&#x80FD;&#x8D77;&#x6E90;&#x4E8E;&#x90A3;&#x79CD;&#x5668;&#x5B98;&#x3002;&#x201D;[2]&#x57FA;&#x4E8E;&#x8FD9;&#x4E00;&#x7406;&#x8BBA;&#xFF0C;&#x5361;&#x666E;&#x5BF9;&#x8BB8;&#x591A;&#x5668;&#x7269;&#x548C;&#x5DE5;&#x5177;&#x505A;&#x4E86;&#x8BE6;&#x5C3D;&#x7684;&#x89E3;&#x91CA;&#xFF1A;&#x201C;&#x8FD9;&#x6837;&#x5927;&#x91CF;&#x7684;&#x7CBE;&#x795E;&#x521B;&#x9020;&#x7269;&#x7A81;&#x7136;&#x4ECE;&#x624B;&#x3001;&#x81C2;&#x548C;&#x7259;&#x9F7F;&#x4E2D;&#x6D8C;&#x73B0;&#x51FA;&#x6765;&#x3002;&#x5F2F;&#x66F2;&#x7684;&#x624B;&#x6307;&#x53D8;&#x6210;&#x4E86;&#x4E00;&#x53EA;&#x94A9;&#x5B50;&#xFF0C;&#x624B;&#x7684;&#x51F9;&#x9677;&#x6210;&#x4E3A;&#x4E00;&#x53EA;&#x7897;&#xFF1B;&#x4EBA;&#x4EEC;&#x4ECE;&#x5200;&#x3001;&#x77DB;&#x3001;&#x6868;&#x3001;&#x94F2;&#x3001;&#x8019;&#x3001;&#x7281;&#x548C;&#x9539;&#x7B49;&#xFF0C;&#x770B;&#x5230;&#x4E86;&#x81C2;&#x3001;&#x624B;&#x548C;&#x624B;&#x6307;&#x7684;&#x5404;&#x79CD;&#x5404;&#x6837;&#x7684;&#x59FF;&#x52BF;&#xFF0C;&#x5F88;&#x663E;&#x7136;&#xFF0C;&#x5B83;&#x4EEC;&#x9002;&#x5408;&#x4E8E;&#x6253;&#x730E;&#x3001;&#x6355;&#x9C7C;&#xFF0C;&#x4ECE;&#x56ED;&#x827A;&#xFF0C;&#x4EE5;&#x53CA;&#x8015;&#x4F5C;&#x3002;&#x201D;[3]&#x5361;&#x666E;&#x8FD8;&#x5F3A;&#x8C03;&#x4E86;&#x5668;&#x5B98;&#x6295;&#x5F71;&#x8BBA;&#x5BF9;&#x5DE5;&#x5177;&#x53D1;&#x5C55;&#x7684;&#x6DF1;&#x8FDC;&#x610F;&#x4E49;&#xFF1A;&#x4F5C;&#x4E3A;&#x5668;&#x5B98;&#x6295;&#x5F71;&#xFF0C;&#x4E0D;&#x4EC5;&#x5DE5;&#x5177;&#x7684;&#x5F62;&#x72B6;&#x3001;&#x7ED3;&#x6784;&#x548C;&#x529F;&#x80FD;&#x8DDF;&#x4EBA;&#x4F53;&#x7684;&#x5668;&#x5B98;&#x4E00;&#x6837;&#xFF0C;&#x800C;&#x4E14;&#x5C3A;&#x5BF8;&#x548C;&#x6570;&#x91CF;&#x5173;&#x7CFB;&#x4E5F;&#x53EF;&#x4EE5;&#x4ECE;&#x4EBA;&#x4F53;&#x63A8;&#x7B97;&#x51FA;&#x6765;&#x3002;&#x4ED6;&#x5DF2;&#x7ECF;&#x9884;&#x89C1;&#x5230;&#x4EBA;&#x5DE5;&#x667A;&#x80FD;&#x6280;&#x672F;&#x4E86;&#xFF0C;&#x8FD8;&#x6697;&#x793A;&#x51FA;&#x628A;&#x5668;&#x5B98;&#x6295;&#x5F71;&#x8BBA;&#x4ECE;&#x81EA;&#x7136;&#x73AF;&#x5883;&#x7684;&#x5916;&#x90E8;&#x8F6C;&#x5411;&#x793E;&#x4F1A;&#x73AF;&#x5883;&#x7684;&#x5185;&#x90E8;&#x5F00;&#x62D3;&#x3002;&#x5361;&#x666E;&#x53EF;&#x8C13;&#x628A;&#x6280;&#x672F;&#x4E0E;&#x4EBA;&#x4F53;&#x5668;&#x5B98;&#x5173;&#x8054;&#x8D77;&#x6765;&#x7684;&#x7B2C;&#x4E00;&#x4EBA;&#x3002;<br>[^2]:<a href="https://baike.baidu.com/item/%E3%80%8A%E5%A2%A8%E7%BB%8F%E3%80%8B%E5%85%89%E5%AD%A6%E5%85%AB%E6%9D%A1/4527310" rel="external nofollow noopener noreferrer" target="_blank">&#x5149;&#x5B66;&#x516B;&#x6761;</a>)
[^3]:<strong>&#x5149;&#x5B66;</strong>: &#x6C88;&#x62EC;&#x901A;&#x8FC7;&#x89C2;&#x5BDF;&#x5B9E;&#x9A8C;&#xFF0C;&#x5BF9;&#x5C0F;&#x5B54;&#x6210;&#x50CF;&#x3001;&#x51F9;&#x9762;&#x955C;&#x6210;&#x50CF;&#x7B49;&#x539F;&#x7406;&#x4F5C;&#x4E86;&#x51C6;&#x786E;&#x800C;&#x751F;&#x52A8;&#x7684;&#x63CF;&#x8FF0;&#xFF0C;<br>&#x900F;&#x5149;&#x955C;&#x7ED3;&#x6784;&#x793A;&#x610F;&#x56FE;<br>&#x900F;&#x5149;&#x955C;&#x7ED3;&#x6784;&#x793A;&#x610F;&#x56FE;<br>&#x4ED6;&#x7528;&#x201C;&#x788D;&#x201D;&#xFF08;&#x7126;&#x70B9;&#xFF09;&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x6307;&#x51FA;&#x4E86;&#x5149;&#x7684;&#x76F4;&#x7EBF;&#x4F20;&#x64AD;&#x3001;&#x51F9;&#x9762;&#x955C;&#x6210;&#x50CF;&#x7684;&#x89C4;&#x5F8B;&#xFF0C;&#x5E76;&#x628A;&#x5149;&#x901A;&#x8FC7;&#x201C;&#x788D;&#x201D;&#x6210;&#x50CF;&#x79F0;&#x4E4B;&#x4E3A;&#x683C;&#x672F;&#xFF0C;&#x5373;&#x73B0;&#x4EE3;&#x5149;&#x5B66;&#x4E2D;&#x7684;&#x7B49;&#x89D2;&#x7A7A;&#x95F4;&#x53D8;&#x6362;&#x5173;&#x7CFB;&#x3002;<br>&#x6C88;&#x62EC;&#x8FD8;&#x5BF9;&#x5E73;&#x9762;&#x3001;&#x51F9;&#x51F8;&#x9762;&#x7B49;&#x955C;&#x9762;&#x6210;&#x50CF;&#x7684;&#x4E0D;&#x540C;&#x8FDB;&#x884C;&#x7814;&#x7A76;&#xFF0C;&#x6CE8;&#x610F;&#x5230;&#x8868;&#x9762;&#x66F2;&#x7387;&#x4E0D;&#x540C;&#x4E0E;&#x6210;&#x50CF;&#x4E4B;&#x95F4;&#x7684;&#x5173;&#x7CFB;&#xFF0C;&#x5E76;&#x4EE5;&#x6B64;&#x5BF9;&#x201C;&#x53E4;&#x4EBA;&#x94F8;&#x9274;&#x201D;&#x65F6;&#x6B63;&#x786E;&#x5904;&#x7406;&#x955C;&#x9762;&#x51F9;&#x51F8;&#x4E0E;&#x6210;&#x50CF;&#x5927;&#x5C0F;&#x7684;&#x5173;&#x7CFB;&#x8FDB;&#x884C;&#x4E86;&#x7814;&#x7A76;&#x4E0E;&#x5206;&#x6790;&#xFF0C;&#x63D0;&#x51FA;&#x82E5;&#x5C06;&#x5C0F;&#x5E73;&#x9762;&#x955C;&#x78E8;&#x51F8;&#xFF0C;&#x5C31;&#x53EF;&#x201C;&#x5168;&#x7EB3;&#x4EBA;&#x9762;&#x201D;&#x3002; [77]<br>&#x6C88;&#x62EC;&#x8FD8;&#x5BF9;&#x900F;&#x5149;&#x94DC;&#x955C;&#x7684;&#x539F;&#x7406;&#x4F5C;&#x51FA;&#x4E86;&#x6B63;&#x786E;&#x63A8;&#x8BBA;&#xFF0C;&#x63A8;&#x52A8;&#x4E86;&#x540E;&#x4E16;&#x5BF9;&#x201C;&#x900F;&#x5149;&#x955C;&#x201D;&#x7684;&#x7814;&#x7A76;&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x6C88;&#x62EC;&#x8FD8;&#x7B2C;&#x4E00;&#x6B21;&#x8BB0;&#x5F55;&#x4E86;&#x201C;&#x7EA2;&#x5149;&#x9A8C;&#x5C38;&#x201D;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x662F;&#x4E2D;&#x56FD;&#x5173;&#x4E8E;&#x6EE4;&#x5149;&#x5E94;&#x7528;&#x7684;&#x6700;&#x65E9;&#x8BB0;&#x8F7D;&#xFF0C;&#x81F3;&#x4ECA;&#x8FD8;&#x6709;&#x73B0;&#x5B9E;&#x610F;&#x4E49;&#x3002; [78]<br>[^4]:<a href="https://en.wikipedia.org/wiki/Theory_of_the_Earth" rel="external nofollow noopener noreferrer" target="_blank">https://en.wikipedia.org/wiki/Theory_of_the_Earth</a> &#x2014; <a href="http://www.gutenberg.org/files/12861/12861-h/12861-h.htm" rel="external nofollow noopener noreferrer" target="_blank">html book</a><br>[^5]:&#x300A;&#x5B89;&#x8FBE;&#x9C81;&#x4E4B;&#x72AC;&#x300B;&#xFF0C;&#x662F;&#x4E00;&#x90E8;&#x6CD5;&#x56FD;16&#x5206;&#x949F;&#x7684;&#x65E0;&#x58F0;&#x8D85;&#x73B0;&#x5B9E;&#x4E3B;&#x4E49;&#x77ED;&#x7247;&#xFF0C;&#x7531;&#x897F;&#x73ED;&#x7259;&#x5BFC;&#x6F14;&#x8DEF;&#x6613;&#x65AF;&#xB7;&#x5E03;&#x52AA;&#x57C3;&#x5C14;&#x6267;&#x5BFC;&#xFF0C;&#x8DEF;&#x6613;&#x65AF;&#xB7;&#x5E03;&#x52AA;&#x57C3;&#x5C14;&#x4E0E;&#x8457;&#x540D;&#x827A;&#x672F;&#x5BB6;&#x8428;&#x5C14;&#x74E6;&#x591A;&#xB7;&#x8FBE;&#x5229;&#x5171;&#x540C;&#x521B;&#x4F5C;&#x3002;&#x8BE5;&#x7247;&#x4E8E;1928&#x5E74;&#x62CD;&#x6444;&#xFF0C;&#x662F;&#x5BFC;&#x6F14;&#x8DEF;&#x6613;&#x65AF;&#xB7;&#x5E03;&#x52AA;&#x57C3;&#x5C14;&#x7684;&#x5904;&#x5973;&#x4F5C;&#x3002;&#x6700;&#x521D;&#x5F71;&#x7247;&#x4E8E;1929&#x5E74;&#x5728;&#x5DF4;&#x9ECE;&#x6709;&#x9650;&#x4E0A;&#x6620;&#xFF0C;&#x4F46;&#x662F;&#x4E0D;&#x4E45;&#x5C31;&#x5E7F;&#x4E3A;&#x6D41;&#x4F20;&#xFF0C;&#x8FDE;&#x7EED;&#x653E;&#x6620;&#x4E86;8&#x4E2A;&#x6708;&#x3002; &#x2014;youtube <a href="https://www.youtube.com/watch?v=79h05vqezJ0" rel="external nofollow noopener noreferrer" target="_blank">link</a></p>

    
    </div>
    
    
</article>




    
    
        
<nav class="pagination is-centered is-rounded" role="navigation" aria-label="pagination">
    <div class="pagination-previous">
        <a href="/page/2/">Précédent</a>
    </div>
    <div class="pagination-next is-invisible is-hidden-mobile">
        <a href="/page/4/">Suivant</a>
    </div>
    <ul class="pagination-list is-hidden-mobile">
        
        <li><a class="pagination-link" href="/">1</a></li>
        
        <li><a class="pagination-link" href="/page/2/">2</a></li>
        
        <li><a class="pagination-link is-current" href="/page/3/">3</a></li>
        
    </ul>
</nav>
    
    </div>
</section>
    <footer class="footer">
    <div class="container">
        <div class="columns content">
            <div class="column is-narrow has-text-centered">
                &copy; 2019 liudixian&nbsp;
                Powered by <a href="http://hexo.io/" target="_blank" rel="external nofollow noopener noreferrer">Hexo</a> & <a href="http://github.com/ppoffice/hexo-theme-minos" rel="external nofollow noopener noreferrer" target="_blank">Minos</a>
            </div>
            <div class="column is-hidden-mobile"></div>

            
            <div class="column is-narrow">
                <div class="columns is-mobile is-multiline is-centered">
                
                    
                <a class="column is-narrow has-text-black" title="GitHub" href="https://github.com/ppoffice/hexo-theme-minos" rel="external nofollow noopener noreferrer" target="_blank">
                    
                    GitHub
                    
                </a>
                
                </div>
            </div>
            
            
        </div>
    </div>
</footer>
    <script src="//cdnjs.cloudflare.com/ajax/libs/jquery/3.3.1/jquery.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/moment.js/2.22.2/moment-with-locales.min.js"></script>

<!-- test if the browser is outdated -->
<div id="outdated">
    <h6>Your browser is out-of-date!</h6>
    <p>Update your browser to view this website correctly. <a id="btnUpdateBrowser" href="http://outdatedbrowser.com/" rel="external nofollow noopener noreferrer" target="_blank">Update my browser now </a></p>
    <p class="last"><a href="#" id="btnCloseUpdateBrowser" title="Close">&times;</a></p>
</div>
<script src="//cdnjs.cloudflare.com/ajax/libs/outdated-browser/1.1.5/outdatedbrowser.min.js"></script>
<script>
    $(document).ready(function () {
        // plugin function, place inside DOM ready function
        outdatedBrowser({
            bgColor: '#f25648',
            color: '#ffffff',
            lowerThan: 'flex'
        })
    });
</script>

<script>
    window.FontAwesomeConfig = {
        searchPseudoElements: true
    }
    moment.locale("zh-CN");
</script>


    
    
<script src="https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.4/MathJax.js?config=TeX-MML-AM_CHTML"></script>
<script>
    MathJax.Hub.Config({
        "HTML-CSS": {
            matchFontHeight: false
        },
        SVG: {
            matchFontHeight: false
        },
        CommonHTML: {
            matchFontHeight: false
        },
        tex2jax: {
            inlineMath: [
                ['$','$'],
                ['\\(','\\)']
            ]
        }
    });
</script>

    
    
    
    
<script src="//cdnjs.cloudflare.com/ajax/libs/lightgallery/1.6.8/js/lightgallery-all.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/justifiedGallery/3.6.5/js/jquery.justifiedGallery.min.js"></script>
<script>
    (function ($) {
        $(document).ready(function () {
            if (typeof($.fn.lightGallery) === 'function') {
                $('.article.gallery').lightGallery({ selector: '.gallery-item' });
            }
            if (typeof($.fn.justifiedGallery) === 'function') {
                $('.justified-gallery').justifiedGallery();
            }
        });
    })(jQuery);
</script>

    
    
    <script src="https://cdnjs.cloudflare.com/ajax/libs/clipboard.js/2.0.0/clipboard.min.js"></script>
    <style>
        .hljs {
            position: relative;
        }

        .hljs .clipboard-btn {
            float: right;
            color: #9a9a9a;
            background: none;
            border: none;
            cursor: pointer;
        }

        .hljs .clipboard-btn:hover {
          color: #8a8a8a;
        }

        .hljs > .clipboard-btn {
            display: none;
            position: absolute;
            right: 4px;
            top: 4px;
        }

        .hljs:hover > .clipboard-btn {
            display: inline;
        }

        .hljs > figcaption > .clipboard-btn {
            margin-right: 4px;
        }
    </style>
    <script>
      $(document).ready(function () {
        $('figure.hljs').each(function(i, figure) {
          var codeId = 'code-' + i;
          var code = figure.querySelector('.code');
          var copyButton = $('<button>Copy <i class="far fa-clipboard"></i></button>');
          code.id = codeId;
          copyButton.addClass('clipboard-btn');
          copyButton.attr('data-clipboard-target-id', codeId);

          var figcaption = figure.querySelector('figcaption');

          if (figcaption) {
            figcaption.append(copyButton[0]);
          } else {
            figure.prepend(copyButton[0]);
          }
        })

        var clipboard = new ClipboardJS('.clipboard-btn', {
          target: function(trigger) {
            return document.getElementById(trigger.getAttribute('data-clipboard-target-id'));
          }
        });
        clipboard.on('success', function(e) {
          e.clearSelection();
        })
      })
    </script>

    
    

    


<script src="/js/script.js"></script>

    
    <div class="searchbox ins-search">
    <div class="searchbox-mask"></div>
    <div class="searchbox-container ins-search-container">
        <div class="searchbox-input-wrapper">
            <input type="text" class="searchbox-input ins-search-input" placeholder="Que voulez-vous chercher ?">
            <span class="searchbox-close ins-close ins-selectable"><i class="fa fa-times-circle"></i></span>
        </div>
        <div class="searchbox-result-wrapper ins-section-wrapper">
            <div class="ins-section-container"></div>
        </div>
    </div>
</div>
<script>
    (function (window) {
        var INSIGHT_CONFIG = {
            TRANSLATION: {
                POSTS: 'Posts',
                PAGES: 'Pages',
                CATEGORIES: 'Catégories',
                TAGS: 'Tags',
                UNTITLED: '(Sans Titre)',
            },
            CONTENT_URL: '/content.json',
        };
        window.INSIGHT_CONFIG = INSIGHT_CONFIG;
    })(window);
</script>
<script src="/js/insight.js"></script>
    
</body>
</html>