<!DOCTYPE html>
<html class="has-navbar-fixed-top">
<head><meta name="generator" content="Hexo 3.8.0">
    <meta charset="utf-8">
<title>刘迪先</title>
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">

<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/outdated-browser/1.1.5/outdatedbrowser.min.css">


<link href="/en/page/3/index.html" rel="alternate" hreflang="en">
    




<meta name="keywords" content="media art and theory">



    <meta name="keywords" content="media art and theory">
<meta property="og:type" content="website">
<meta property="og:title" content="刘迪先">
<meta property="og:url" content="http://liudixian.github.io/page/3/index.html">
<meta property="og:site_name" content="刘迪先">
<meta property="og:locale" content="zh-cn">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="刘迪先">





<link rel="icon" href="/favicon.png">


<link rel="stylesheet" href="//fonts.googleapis.com/css?family=Ovo|Source+Code+Pro">
<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/bulma/0.6.2/css/bulma.min.css">


<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/lightgallery/1.6.8/css/lightgallery.min.css">
<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/justifiedGallery/3.6.5/css/justifiedGallery.min.css">


<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/highlight.js/9.12.0/styles/atom-one-light.min.css">

<link rel="stylesheet" href="/css/style.css">

<script defer src="//use.fontawesome.com/releases/v5.0.8/js/all.js"></script>


    
    
    
    
    
    
    
    
    
    

    


</head>
<body>
    
<nav class="navbar is-transparent is-fixed-top navbar-main" role="navigation" aria-label="main navigation">
    <div class="container">
        <div class="navbar-brand">
            <a class="navbar-item navbar-logo" href="/">
                
                <img src="/images/logo.png" alt="" height="28">
                
            </a>
            <div class="navbar-burger">
                <span></span>
                <span></span>
                <span></span>
            </div>
        </div>
        
        <div class="navbar-menu navbar-start">
            
            <a class="navbar-item " href="/archives">Archives</a>
            
            <a class="navbar-item " href="/categories/媒介理论">Media Theory</a>
            
            <a class="navbar-item " href="/categories/works">Works</a>
            
            <a class="navbar-item " href="/categories/技术">Technology</a>
            
            <a class="navbar-item " href="/about">About</a>
            
        </div>
        
        <div class="navbar-menu navbar-end">
            
            <a class="navbar-item search" title="搜索" href="javascript:;">
                <i class="fas fa-search"></i>
            </a>
            
            
            
            <a class="navbar-item" title="GitHub" href="https://github.com/ppoffice/hexo-theme-minos" rel="external nofollow noopener noreferrer" target="_blank">
                
                <i class="fab fa-github"></i>
                
            </a>
               
            
        </div>
    </div>
</nav>

    <section class="section">
    <div class="container">
    
        <article class="article content gallery" itemscope="" itemprop="blogPost">
    <h1 class="article-title is-size-3 is-size-4-mobile" itemprop="name">
        
            <a href="/2018/11/10/艺术，科学和技术/" itemprop="url">艺术，科学与技术</a>
        
    </h1>
    <div class="article-meta columns is-variable is-1 is-multiline is-mobile is-size-7-mobile">
        <span class="column is-narrow">
            <time datetime="2018-11-10T12:15:41.000Z" itemprop="datePublished">11月 10 2018</time>
        </span>
        
        
        <span class="column is-narrow">
            
            
            1 小时 读完 (约 8079 字)
        </span>
        
    </div>
    <div class="article-entry is-size-6-mobile" itemprop="articleBody">
    
        <h1 id="ART-SCIENCE-AND-TECHNOLOGY&#x827A;&#x672F;&#xFF0C;&#x79D1;&#x5B66;&#xFF0C;&#x548C;&#x6280;&#x672F;"><a href="#ART-SCIENCE-AND-TECHNOLOGY&#x827A;&#x672F;&#xFF0C;&#x79D1;&#x5B66;&#xFF0C;&#x548C;&#x6280;&#x672F;" class="headerlink" title="ART, SCIENCE, AND TECHNOLOGY&#x827A;&#x672F;&#xFF0C;&#x79D1;&#x5B66;&#xFF0C;&#x548C;&#x6280;&#x672F;"></a>ART, SCIENCE, AND TECHNOLOGY&#x827A;&#x672F;&#xFF0C;&#x79D1;&#x5B66;&#xFF0C;&#x548C;&#x6280;&#x672F;</h1><p><strong>Claudia Giannetti</strong> &#x514B;&#x52B3;&#x8FEA;&#x5A05;&#xB7;&#x8A79;&#x5185;&#x8482;<br><a href="http://mediaartnet.org/themes/aesthetics_of_the_digital/art_science_technology/" rel="external nofollow noopener noreferrer" target="_blank"><em>link</em></a><br><a href="https://hackmd.io/6gpqSVlJR1WHtBUh-6s2JA" rel="external nofollow noopener noreferrer" target="_blank">&#x6570;&#x5B57;&#x7F8E;&#x5B66;&#x76EE;&#x5F55;</a></p>
<h6 id="tags-&#x7FFB;&#x8BD1;-MT-amp-T"><a href="#tags-&#x7FFB;&#x8BD1;-MT-amp-T" class="headerlink" title="tags: &#x7FFB;&#x8BD1; MT&amp;T"></a>tags: <code>&#x7FFB;&#x8BD1;</code> <code>MT&amp;T</code></h6><h3 id="Art-science-art"><a href="#Art-science-art" class="headerlink" title="Art - science - art"></a>Art - science - art</h3><h3 id="&#x827A;&#x672F;-&#x79D1;&#x5B66;-&#x827A;&#x672F;"><a href="#&#x827A;&#x672F;-&#x79D1;&#x5B66;-&#x827A;&#x672F;" class="headerlink" title="&#x827A;&#x672F;-&#x79D1;&#x5B66;-&#x827A;&#x672F;"></a>&#x827A;&#x672F;-&#x79D1;&#x5B66;-&#x827A;&#x672F;</h3><ol>
<li><p>Deliberations on the connection between art and science have various points of departure. The most general considerations are limited to the assumption of a parallel development. In his writings published in 1970, Werner Heisenberg, who along with Max Planck counts as a founding father of quantum theory, stated that the tendencies towards abstraction in the sciences were comparable with those in the field of art. According to Heisenberg, new artistic and scientific forms can result only from new content, but the converse does not apply. To renew art or to revolutionize science, he wrote, meant to create new content and concepts, and not just new forms. [^1]<br>&#x5BF9;&#x827A;&#x672F;&#x4E0E;&#x79D1;&#x5B66;&#x4E4B;&#x95F4;&#x5173;&#x7CFB;&#x7684;&#x8BA8;&#x8BBA;&#x6709;&#x4E0D;&#x540C;&#x7684;&#x51FA;&#x53D1;&#x70B9;&#x3002; &#x6700;&#x666E;&#x904D;&#x7684;&#x8003;&#x8651;&#x4EC5;&#x9650;&#x4E8E;&#x5E76;&#x884C;&#x5F00;&#x53D1;&#x7684;&#x5047;&#x8BBE;&#x3002; &#x5728;1970&#x5E74;&#x51FA;&#x7248;&#x7684;&#x7740;&#x4F5C;&#x4E2D;&#xFF0C;&#x4E0E;&#x9A6C;&#x514B;&#x65AF;&#xB7;&#x666E;&#x6717;&#x514B;&#x4E00;&#x8D77;&#x6210;&#x4E3A;&#x91CF;&#x5B50;&#x7406;&#x8BBA;&#x7684;&#x521B;&#x59CB;&#x4EBA;&#x4E4B;&#x4E00;&#x7684;&#x7EF4;&#x5C14;&#x7EB3;&#x6D77;&#x68EE;&#x4F2F;&#x683C;&#x6307;&#x51FA;&#xFF0C;&#x79D1;&#x5B66;&#x4E2D;&#x62BD;&#x8C61;&#x7684;&#x503E;&#x5411;&#x4E0E;&#x827A;&#x672F;&#x9886;&#x57DF;&#x7684;&#x503E;&#x5411;&#x76F8;&#x5F53;&#x3002; &#x6839;&#x636E;&#x6D77;&#x68EE;&#x5821;&#x7684;&#x8BF4;&#x6CD5;&#xFF0C;&#x65B0;&#x7684;&#x827A;&#x672F;&#x548C;&#x79D1;&#x5B66;&#x5F62;&#x5F0F;&#x53EA;&#x80FD;&#x7531;&#x65B0;&#x5185;&#x5BB9;&#x4EA7;&#x751F;&#xFF0C;&#x4F46;&#x76F8;&#x53CD;&#x5E76;&#x4E0D;&#x9002;&#x7528;&#x3002; &#x4ED6;&#x5199;&#x9053;&#xFF0C;&#x91CD;&#x5EFA;&#x827A;&#x672F;&#x6216;&#x9769;&#x547D;&#x5316;&#x79D1;&#x5B66;&#x610F;&#x5473;&#x7740;&#x521B;&#x9020;&#x65B0;&#x7684;&#x5185;&#x5BB9;&#x548C;&#x6982;&#x5FF5;&#xFF0C;&#x800C;&#x4E0D;&#x4EC5;&#x4EC5;&#x662F;&#x65B0;&#x7684;&#x5F62;&#x5F0F;&#x3002;</p>
</li>
<li><p>A question more complex than that of parallels between art and science is the extent to which art influences the sciences. According to Peter Weibel, this question can be answered only methodologically, that is by applying a comparison which views art and science as methods. While science, says Weibel, is distinctly methodological in character, art is generally not regarded as a method: &#xAB;This is our first claim: art and science can only reasonably be compared if weaccept that both are methods. This does not mean that we declare that both have the same methods. We only want to declare that both have a methodological approach, even if their methods are or can be different.&#xBB; [^2]<br>&#x6BD4;&#x827A;&#x672F;&#x4E0E;&#x79D1;&#x5B66;&#x4E4B;&#x95F4;&#x7684;&#x76F8;&#x4F3C;&#x4E4B;&#x5904;&#x66F4;&#x590D;&#x6742;&#x7684;&#x95EE;&#x9898;&#x662F;&#x827A;&#x672F;&#x5BF9;&#x79D1;&#x5B66;&#x7684;&#x5F71;&#x54CD;&#x7A0B;&#x5EA6;&#x3002; &#x6839;&#x636E;Peter Weibel&#x7684;&#x8BF4;&#x6CD5;&#xFF0C;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x53EA;&#x80FD;&#x901A;&#x8FC7;&#x65B9;&#x6CD5;&#x8BBA;&#x6765;&#x56DE;&#x7B54;&#xFF0C;&#x5373;&#x901A;&#x8FC7;&#x6BD4;&#x8F83;&#xFF0C;&#x5C06;&#x827A;&#x672F;&#x548C;&#x79D1;&#x5B66;&#x89C6;&#x4E3A;&#x65B9;&#x6CD5;&#x3002; Weibel&#x8BF4;&#xFF0C;&#x5C3D;&#x7BA1;Weibel&#x5728;&#x79D1;&#x5B66;&#x4E0A;&#x5177;&#x6709;&#x660E;&#x663E;&#x7684;&#x65B9;&#x6CD5;&#x8BBA;&#x6027;&#x8D28;&#xFF0C;&#x4F46;&#x827A;&#x672F;&#x901A;&#x5E38;&#x4E0D;&#x88AB;&#x89C6;&#x4E3A;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#xFF1A;&#x201C;&#x8FD9;&#x662F;&#x6211;&#x4EEC;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x4E3B;&#x5F20;&#xFF1A;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x8BA4;&#x4E3A;&#x4E24;&#x8005;&#x90FD;&#x662F;&#x65B9;&#x6CD5;&#xFF0C;&#x827A;&#x672F;&#x548C;&#x79D1;&#x5B66;&#x53EA;&#x80FD;&#x5408;&#x7406;&#x5730;&#x8FDB;&#x884C;&#x6BD4;&#x8F83;&#x3002; &#x8FD9;&#x5E76;&#x4E0D;&#x610F;&#x5473;&#x7740;&#x6211;&#x4EEC;&#x5BA3;&#x79F0;&#x4E24;&#x8005;&#x90FD;&#x6709;&#x76F8;&#x540C;&#x7684;&#x65B9;&#x6CD5;&#x3002; &#x6211;&#x4EEC;&#x53EA;&#x60F3;&#x8868;&#x660E;&#x4E24;&#x8005;&#x90FD;&#x5177;&#x6709;&#x65B9;&#x6CD5;&#x8BBA;&#x7684;&#x9014;&#x5F84;&#xFF0C;&#x5373;&#x4F7F;&#x4ED6;&#x4EEC;&#x7684;&#x65B9;&#x6CD5;&#x662F;&#x6216;&#x53EF;&#x80FD;&#x4E0D;&#x540C;&#x3002;&#x201D;</p>
</li>
<li><p>Accordingly it would be permissible to view art and science as convergent in the methodological sense. As Weibel sees it, science is influenced by art in regard to its methods, but not by its products and references: &#xAB;Because any time science develops the tendency for its methods to become too authoritarian, too dogmatic, science turns to art and to the methodology of art which is plurality of methods.&#xBB; [^3] The objective nature exists neither in the framework of the sciences nor in culture regardless of social construction, &#xAB;art and science meet and converge in the method of social construction.&#xBB; [^4]<br>&#x56E0;&#x6B64;&#xFF0C;&#x53EF;&#x4EE5;&#x5C06;&#x827A;&#x672F;&#x548C;&#x79D1;&#x5B66;&#x89C6;&#x4E3A;&#x65B9;&#x6CD5;&#x8BBA;&#x610F;&#x4E49;&#x4E0A;&#x7684;&#x8D8B;&#x540C;&#x3002; &#x6B63;&#x5982;&#x9B4F;&#x8D1D;&#x5C14;&#x6240;&#x770B;&#x5230;&#x7684;&#x90A3;&#x6837;&#xFF0C;&#x79D1;&#x5B66;&#x53D7;&#x5176;&#x827A;&#x672F;&#x65B9;&#x6CD5;&#x7684;&#x5F71;&#x54CD;&#xFF0C;&#x4F46;&#x4E0D;&#x53D7;&#x5176;&#x4EA7;&#x54C1;&#x548C;&#x53C2;&#x8003;&#x6587;&#x732E;&#x7684;&#x5F71;&#x54CD;&#xFF1A;&#x201C;&#x56E0;&#x4E3A;&#x4EFB;&#x4F55;&#x65F6;&#x5019;&#x79D1;&#x5B66;&#x7684;&#x53D1;&#x5C55;&#x8D8B;&#x52BF;&#x90FD;&#x4F1A;&#x4F7F;&#x5176;&#x65B9;&#x6CD5;&#x53D8;&#x5F97;&#x8FC7;&#x4E8E;&#x4E13;&#x5236;&#xFF0C;&#x8FC7;&#x4E8E;&#x6559;&#x6761;&#x5316;&#xFF0C;&#x79D1;&#x5B66;&#x5C31;&#x8F6C;&#x5411;&#x827A;&#x672F;&#xFF0C;&#x8F6C;&#x5411;&#x672C;&#x8EAB;&#x5C31;&#x591A;&#x5143;&#x7684;&#x827A;&#x672F;&#x65B9;&#x6CD5;&#x3002;&#x201D;[^ 3]&#x5BA2;&#x89C2;&#x672C;&#x8D28;&#x65E2;&#x4E0D;&#x5B58;&#x5728;&#x4E8E;&#x79D1;&#x5B66;&#x7684;&#x6846;&#x67B6;&#x4E2D;&#xFF0C;&#x4E5F;&#x4E0D;&#x5B58;&#x5728;&#x4E8E;&#x6587;&#x5316;&#x4E2D;&#xFF0C;&#x4E0D;&#x8BBA;&#x793E;&#x4F1A;&#x5EFA;&#x6784;&#x5982;&#x4F55;&#xFF0C;&#x201C;&#x827A;&#x672F;&#x4E0E;&#x79D1;&#x5B66;&#x5728;&#x793E;&#x4F1A;&#x5EFA;&#x6784;&#x7684;&#x65B9;&#x6CD5;&#x4E2D;&#x76F8;&#x9047;&#x5E76;&#x878D;&#x5408;&#x201D;&#x3002;</p>
</li>
<li><p>This position finds its most radical expression in the science-theoretical contributions of Paul Feyerabend. As a critic of scientific rationalism, he develops new interpretations and connections among the arts and sciences. He is of the opinion that artists and scientists developing a style or theory frequently pursue a secondary intention, namely that of representing &#x2039;the&#x203A; truth or &#x2039;the&#x203A; reality. However, artistic styles are closely connected with styles of thought.<br>&#x8FD9;&#x4E00;&#x7ACB;&#x573A;&#x5728;Paul Feyerabend&#x7684;&#x79D1;&#x5B66;&#x7406;&#x8BBA;&#x8D21;&#x732E;&#x4E2D;&#x627E;&#x5230;&#x4E86;&#x6700;&#x6FC0;&#x8FDB;&#x7684;&#x8868;&#x8FBE;&#x3002; &#x4F5C;&#x4E3A;&#x79D1;&#x5B66;&#x7406;&#x6027;&#x4E3B;&#x4E49;&#x7684;&#x6279;&#x8BC4;&#x5BB6;&#xFF0C;&#x4ED6;&#x5728;&#x827A;&#x672F;&#x548C;&#x79D1;&#x5B66;&#x4E4B;&#x95F4;&#x53D1;&#x5C55;&#x4E86;&#x65B0;&#x7684;&#x89E3;&#x91CA;&#x548C;&#x8054;&#x7CFB;&#x3002; &#x4ED6;&#x8BA4;&#x4E3A;&#xFF0C;&#x53D1;&#x5C55;&#x4E00;&#x79CD;&#x98CE;&#x683C;&#x6216;&#x7406;&#x8BBA;&#x7684;&#x827A;&#x672F;&#x5BB6;&#x548C;&#x79D1;&#x5B66;&#x5BB6;&#x7ECF;&#x5E38;&#x8FFD;&#x6C42;&#x7B2C;&#x4E8C;&#x4E2A;&#x610F;&#x56FE;&#xFF0C;&#x5373;&#x8868;&#x73B0;&#x771F;&#x7406;&#x6216;&#x73B0;&#x5B9E;&#x3002; &#x7136;&#x800C;&#xFF0C;&#x827A;&#x672F;&#x98CE;&#x683C;&#x4E0E;&#x601D;&#x60F3;&#x98CE;&#x683C;&#x5BC6;&#x5207;&#x76F8;&#x5173;&#x3002;<br>:::success</p>
<h4 id="&#x5218;&#x8FEA;&#x5148;-1-4"><a href="#&#x5218;&#x8FEA;&#x5148;-1-4" class="headerlink" title="&#x5218;&#x8FEA;&#x5148; 1~4"></a>&#x5218;&#x8FEA;&#x5148; 1~4</h4><p>:::</p>
</li>
<li><p>That which a specific form of thought understands concepts such as truth or reality to mean is what this form of thought asserts as truth. When one decides in favor of a style, a reality, or a form of truth, then one always chooses a human-made construction. In other words, Feyerabend negates the possibility of absolute rationality and logic in regard to that which is created by the human mind. He asserts that this relativist, and in a certain sense irrational, factor inherent in every branch of science places science in the proximity of art. According to Feyerabend, the sciences are not an institution of objective truth, but are arts along the lines of a progressive understanding of art. [^5]<br>&#x7279;&#x5B9A;&#x5F62;&#x5F0F;&#x7684;&#x601D;&#x60F3;&#x7406;&#x89E3;&#x771F;&#x7406;&#x6216;&#x73B0;&#x5B9E;&#x8FD9;&#x4E9B;&#x6982;&#x5FF5;&#x7684;&#x542B;&#x4E49;&#x662F;&#x8FD9;&#x79CD;&#x601D;&#x60F3;&#x5F62;&#x5F0F;&#x6240;&#x8BF4;&#x7684;&#x771F;&#x7406;&#x3002; &#x5F53;&#x4EBA;&#x4EEC;&#x51B3;&#x5B9A;&#x652F;&#x6301;&#x4E00;&#x79CD;&#x98CE;&#x683C;&#xFF0C;&#x4E00;&#x79CD;&#x73B0;&#x5B9E;&#x6216;&#x4E00;&#x79CD;&#x771F;&#x7406;&#x65F6;&#xFF0C;&#x4EBA;&#x4EEC;&#x603B;&#x4F1A;&#x9009;&#x62E9;&#x4E00;&#x79CD;&#x4EBA;&#x9020;&#x7684;&#x5EFA;&#x7B51;&#x3002; &#x6362;&#x53E5;&#x8BDD;&#x8BF4;&#xFF0C;&#x8D39;&#x8036;&#x963F;&#x672C;&#x5FB7;(Feyerabend)&#x5426;&#x5B9A;&#x4E86;&#x5173;&#x4E8E;&#x4EBA;&#x7684;&#x601D;&#x60F3;&#x6240;&#x521B;&#x9020;&#x7684;&#x7EDD;&#x5BF9;&#x7406;&#x6027;&#x548C;&#x903B;&#x8F91;&#x7684;&#x53EF;&#x80FD;&#x6027;&#x3002; &#x4ED6;&#x65AD;&#x8A00;&#xFF0C;&#x8FD9;&#x4E2A;&#x76F8;&#x5BF9;&#x4E3B;&#x4E49;&#x8005;&#xFF0C;&#x4EE5;&#x53CA;&#x67D0;&#x79CD;&#x610F;&#x4E49;&#x4E0A;&#x975E;&#x7406;&#x6027;&#x56E0;&#x7D20;&#xFF0C;&#x79D1;&#x5B66;&#x7684;&#x6BCF;&#x4E00;&#x4E2A;&#x5206;&#x652F;&#x56FA;&#x6709;&#x7684;&#x56E0;&#x7D20;&#x90FD;&#x5C06;&#x79D1;&#x5B66;&#x7F6E;&#x4E8E;&#x827A;&#x672F;&#x7684;&#x9644;&#x8FD1;&#x3002; &#x6839;&#x636E;&#x8D39;&#x8036;&#x963F;&#x672C;&#x5FB7;&#x7684;&#x8BF4;&#x6CD5;&#xFF0C;&#x79D1;&#x5B66;&#x4E0D;&#x662F;&#x5BA2;&#x89C2;&#x771F;&#x7406;&#x7684;&#x5236;&#x5EA6;&#xFF0C;&#x800C;&#x662F;&#x827A;&#x672F;&#x9010;&#x6E10;&#x7406;&#x89E3;&#x7684;&#x827A;&#x672F;&#x3002;</p>
</li>
<li><p>Feyerabend&#x2019;s line of argument reflects the skepticism that deeply influenced occidental culture and science well into the twentieth century. The aforementioned questions of truth, reality and reason are central components of the contest between rationalism and relativism affecting art no less directlythan science. If the nature of science were to be considered a research method under the premises of reality, plausibility, and dialectics, then whoever attempted to identify these three principles by strictly observing the complexity of the objects would, according to the Spanish scientist Jorge Wagensberg, reach the conclusion that the object resisted the method. The only manner of proceeding would be to &#xAB;soften up&#xBB; the method, with the result that &#xAB;science is transformed into ideology.&#xBB; &#xAB;At its core ideology means not research, but faith. It follows from this consideration that one must stop with ideology all the holes which science has itself failed to stop. [&#x2026;] If the knowledge towards which we aspire is ruled not by laws but by world-views, then it would seem expedient to take our leave of scientific methods, and perhaps even adopt principles radically opposed to the latter. Precisely that is the case in art, in a kind of knowledge whose creators have not the least interest in distancing themselves from their creation.&#xBB; [^6]<br>&#x8D39;&#x8036;&#x963F;&#x672C;&#x5FB7;(Feyerabend)&#x7684;&#x8BBA;&#x636E;&#x53CD;&#x6620;&#x4E86;&#x5BF9;&#x897F;&#x65B9;&#x6587;&#x5316;&#x548C;&#x79D1;&#x5B66;&#x6DF1;&#x6DF1;&#x5F71;&#x54CD;&#x5230;&#x4E8C;&#x5341;&#x4E16;&#x7EAA;&#x7684;&#x6000;&#x7591;&#x8BBA;&#x3002;&#x4E0A;&#x8FF0;&#x5173;&#x4E8E;&#x771F;&#x7406;&#xFF0C;&#x73B0;&#x5B9E;&#x548C;&#x7406;&#x6027;&#x7684;&#x95EE;&#x9898;&#x662F;&#x7406;&#x6027;&#x4E3B;&#x4E49;&#x548C;&#x76F8;&#x5BF9;&#x4E3B;&#x4E49;&#x4E4B;&#x95F4;&#x5BF9;&#x827A;&#x672F;&#x7684;&#x4E89;&#x593A;&#x7684;&#x6838;&#x5FC3;&#x7EC4;&#x6210;&#x90E8;&#x5206;&#xFF0C;&#x8FD9;&#x4E9B;&#x5BF9;&#x827A;&#x672F;&#x7684;&#x5F71;&#x54CD;&#x4E0D;&#x4E9A;&#x4E8E;&#x79D1;&#x5B66;&#x3002;&#x6839;&#x636E;&#x897F;&#x73ED;&#x7259;&#x79D1;&#x5B66;&#x5BB6;Jorge Wagensberg&#x7684;&#x8BF4;&#x6CD5;&#xFF0C;&#x5982;&#x679C;&#x79D1;&#x5B66;&#x7684;&#x672C;&#x8D28;&#x5728;&#x73B0;&#x5B9E;&#xFF0C;&#x5408;&#x7406;&#x6027;&#x548C;&#x8FA9;&#x8BC1;&#x6CD5;&#x7684;&#x524D;&#x63D0;&#x4E0B;&#x88AB;&#x8BA4;&#x4E3A;&#x662F;&#x4E00;&#x79CD;&#x7814;&#x7A76;&#x65B9;&#x6CD5;&#xFF0C;&#x90A3;&#x4E48;&#x65E0;&#x8BBA;&#x8C01;&#x8BD5;&#x56FE;&#x901A;&#x8FC7;&#x4E25;&#x683C;&#x89C2;&#x5BDF;&#x8FD9;&#x4E9B;&#x7269;&#x4F53;&#x7684;&#x590D;&#x6742;&#x6027;&#x6765;&#x786E;&#x5B9A;&#x8FD9;&#x4E09;&#x4E2A;&#x539F;&#x5219;&#xFF0C;&#x8BE5;&#x5BF9;&#x8C61;&#x62B5;&#x5236;&#x8BE5;&#x65B9;&#x6CD5;&#x7684;&#x7ED3;&#x8BBA;&#x3002;&#x552F;&#x4E00;&#x7684;&#x5904;&#x7406;&#x65B9;&#x5F0F;&#x662F;&#x201C;&#x8F6F;&#x5316;&#x201D;&#x65B9;&#x6CD5;&#xFF0C;&#x7ED3;&#x679C;&#x662F;&#x201C;&#x79D1;&#x5B66;&#x8F6C;&#x5316;&#x4E3A;&#x610F;&#x8BC6;&#x5F62;&#x6001;&#x201D;&#x3002;&#x201C;&#x5176;&#x6838;&#x5FC3;&#x601D;&#x60F3;&#x610F;&#x5473;&#x7740;&#x4E0D;&#x662F;&#x7814;&#x7A76;&#xFF0C;&#x800C;&#x662F;&#x4FE1;&#x4EF0;&#x3002;&#x201D;&#x4ECE;&#x8FD9;&#x4E00;&#x70B9;&#x51FA;&#x53D1;&#xFF0C;&#x4EBA;&#x4EEC;&#x5FC5;&#x987B;&#x610F;&#x8BC6;&#x5230;&#x79D1;&#x5B66;&#x81EA;&#x8EAB;&#x672A;&#x80FD;&#x963B;&#x6B62;&#x7684;&#x6240;&#x6709;&#x6F0F;&#x6D1E;&#x2026;&#x201D;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x6240;&#x8FFD;&#x6C42;&#x7684;&#x77E5;&#x8BC6;&#x4E0D;&#x662F;&#x7531;&#x6CD5;&#x5F8B;&#x800C;&#x662F;&#x7531;&#x4E16;&#x754C;&#x89C2;&#x6765;&#x7EDF;&#x6CBB;&#x7684;&#x8BDD;&#xFF0C;&#x90A3;&#x4E48;&#x8BA9;&#x6211;&#x4EEC;&#x653E;&#x5F03;&#x79D1;&#x5B66;&#x65B9;&#x6CD5;&#x4F3C;&#x4E4E;&#x662F;&#x5408;&#x9002;&#x7684;&#xFF0C;&#x751A;&#x81F3;&#x53EF;&#x80FD;&#x91C7;&#x7528;&#x4E0E;&#x540E;&#x8005;&#x5B8C;&#x5168;&#x76F8;&#x53CD;&#x7684;&#x539F;&#x5219;&#x3002;&#x8FD9;&#x6070;&#x6070;&#x5C31;&#x662F;&#x827A;&#x672F;&#x4E2D;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x4E00;&#x79CD;&#x77E5;&#x8BC6;&#x7684;&#x521B;&#x9020;&#x8005;&#x5E76;&#x6CA1;&#x6709;&#x4E1D;&#x6BEB;&#x7684;&#x5174;&#x8DA3;&#x6765;&#x5C06;&#x81EA;&#x5DF1;&#x4ECE;&#x521B;&#x4F5C;&#x4E2D;&#x89E3;&#x8131;&#x51FA;&#x6765;&#x3002;&#x201C;</p>
</li>
<li><p>Of particular relevance to the understanding of a new interpenetration of art and science is the generative nature of either area, which brings forth words or world-views of its own. For that reason, &#xAB;the worlds of art and science are ideologically no longer opposites,&#xBB; as Ilya Prigogine states, &#xAB;the variety of the significates and the basic opacity of the world are reflected in new languages and new formalisms.&#xBB; [^7]<br>&#x4E0E;&#x7406;&#x89E3;&#x827A;&#x672F;&#x4E0E;&#x79D1;&#x5B66;&#x7684;&#x65B0;&#x76F8;&#x4E92;&#x6E17;&#x900F;&#x7279;&#x522B;&#x76F8;&#x5173;&#x7684;&#x662F;&#x4EFB;&#x4F55;&#x4E00;&#x4E2A;&#x9886;&#x57DF;&#x7684;&#x751F;&#x6210;&#x6027;&#x8D28;&#xFF0C;&#x5B83;&#x5E26;&#x6765;&#x4E86;&#x81EA;&#x5DF1;&#x7684;&#x6587;&#x5B57;&#x6216;&#x4E16;&#x754C;&#x89C2;&#x3002; &#x51FA;&#x4E8E;&#x8FD9;&#x4E2A;&#x539F;&#x56E0;&#xFF0C;&#x201C;&#x827A;&#x672F;&#x548C;&#x79D1;&#x5B66;&#x7684;&#x4E16;&#x754C;&#x5728;&#x610F;&#x8BC6;&#x5F62;&#x6001;&#x4E0A;&#x4E0D;&#x518D;&#x662F;&#x5BF9;&#x7ACB;&#x7684;&#xFF0C;&#x201D;&#x6B63;&#x5982;Ilya Prigogine&#x6240;&#x8BF4;&#xFF0C;&#x201C;&#x4E16;&#x754C;&#x7684;&#x5404;&#x79CD;&#x610F;&#x4E49;&#x548C;&#x57FA;&#x672C;&#x7684;&#x4E0D;&#x900F;&#x660E;&#x6027;&#x90FD;&#x53CD;&#x6620;&#x5728;&#x65B0;&#x8BED;&#x8A00;&#x548C;&#x65B0;&#x5F62;&#x5F0F;&#x4E3B;&#x4E49;&#x4E2D;&#x3002;&#x201D;</p>
</li>
</ol>
<p>:::info<br>&#x5218;&#x8FEA;&#x5148; 5~7<br>:::</p>
<h3 id="The-origins-of-information-theory"><a href="#The-origins-of-information-theory" class="headerlink" title="The origins of information theory"></a>The origins of information theory</h3><h3 id="&#x4FE1;&#x606F;&#x8BBA;&#x8D77;&#x6E90;"><a href="#&#x4FE1;&#x606F;&#x8BBA;&#x8D77;&#x6E90;" class="headerlink" title="&#x4FE1;&#x606F;&#x8BBA;&#x8D77;&#x6E90;"></a>&#x4FE1;&#x606F;&#x8BBA;&#x8D77;&#x6E90;</h3><p>:::success</p>
<h6 id="&#x5BFF;&#x76DB;&#x6960;8-11"><a href="#&#x5BFF;&#x76DB;&#x6960;8-11" class="headerlink" title="&#x5BFF;&#x76DB;&#x6960;8-11"></a>&#x5BFF;&#x76DB;&#x6960;8-11</h6><p>:::</p>
<ol start="8">
<li><p>The technological revolution received its fundamental impetus from the first industrial revolution in the nineteenth century. By starting up a process of mechanization, the industrial revolution triggered the phenomenon of crises of control. [^8] The mounting production levels resulting from mechanization led to the need for control systems to accelerate the flow of information. Researchers began to seek solutions in feedback techniques, automatic control systems, and information processing.<br>&#x6280;&#x672F;&#x9769;&#x547D;&#x4ECE;19&#x4E16;&#x7EAA;&#x7B2C;&#x4E00;&#x6B21;&#x5DE5;&#x4E1A;&#x9769;&#x547D;&#x90A3;&#x91CC;&#x83B7;&#x5F97;&#x4E86;&#x6839;&#x672C;&#x6027;&#x7684;&#x63A8;&#x52A8;&#x529B;&#x3002;&#x968F;&#x7740;&#x673A;&#x68B0;&#x5316;&#x7684;&#x5F00;&#x5C55;&#xFF0C;&#x5DE5;&#x4E1A;&#x9769;&#x547D;&#x6263;&#x54CD;&#x4E86;&#x63A7;&#x5236;&#x5371;&#x673A;&#x8FD9;&#x4E00;&#x73B0;&#x8C61;&#x7684;&#x6273;&#x673A;&#x3002; [8]&#x673A;&#x68B0;&#x5316;&#x5E26;&#x6765;&#x7684;&#x751F;&#x4EA7;&#x6C34;&#x5E73;&#x7684;&#x9012;&#x589E;&#x6FC0;&#x8D77;&#x4E86;&#x4EBA;&#x4EEC;&#x5BF9;&#x63A7;&#x5236;&#x7CFB;&#x7EDF;&#x7684;&#x9700;&#x6C42;&#xFF0C;&#x4EE5;&#x6B64;&#x6765;&#x52A0;&#x901F;&#x4FE1;&#x606F;&#x6D41;&#x52A8;&#x3002;&#x7814;&#x7A76;&#x4EBA;&#x5458;&#x5F00;&#x59CB;&#x5728;&#x53CD;&#x9988;&#x6280;&#x672F;&#x3001;&#x81EA;&#x52A8;&#x63A7;&#x5236;&#x7CFB;&#x7EDF;&#x548C;&#x4FE1;&#x606F;&#x5904;&#x7406;&#x65B9;&#x9762;&#x5BFB;&#x6C42;&#x89E3;&#x51B3;&#x529E;&#x6CD5;&#x3002;</p>
</li>
<li><p>Under the title &#xAB;On Governors&#xBB; in 1868, Clerk Maxwell presented the first theoretical study towards an analysis of control and feedback mechanisms, so ushering in the radical transformation in automatic control engineering. By the late nineteenth century, a series of developments and technical innovations wereunderway that in the 1940s would serve as the basis of a new theory, namely cybernetics. [^9]<br>1868&#x5E74;&#xFF0C;&#x5728;&#x9898;&#x4E3A;&#x201C;On Governors&#x201D;&#x7684;&#x4E00;&#x6587;&#x4E2D;&#xFF0C;Clerk Maxwell&#x9996;&#x6B21;&#x53D1;&#x8868;&#x4E86;&#x5BF9;&#x63A7;&#x5236;&#x673A;&#x5236;&#x548C;&#x53CD;&#x9988;&#x673A;&#x5236;&#x8FDB;&#x884C;&#x5206;&#x6790;&#x7684;&#x7406;&#x8BBA;&#x7814;&#x7A76;&#xFF0C;&#x4ECE;&#x800C;&#x5F15;&#x53D1;&#x4E86;&#x81EA;&#x52A8;&#x63A7;&#x5236;&#x5DE5;&#x7A0B;&#x9886;&#x57DF;&#x7684;&#x6FC0;&#x8FDB;&#x53D8;&#x9769;&#x3002;&#x5230;&#x5341;&#x4E5D;&#x4E16;&#x7EAA;&#x540E;&#x671F;&#xFF0C;&#x4E00;&#x7CFB;&#x5217;&#x7684;&#x53D1;&#x5C55;&#x548C;&#x6280;&#x672F;&#x9769;&#x65B0;&#x6B63;&#x5728;&#x8FDB;&#x884C;&#xFF0C;&#x5373;&#x5C06;&#x5728;20&#x4E16;&#x7EAA;40&#x5E74;&#x4EE3;&#x6210;&#x4E3A;&#x65B0;&#x7406;&#x8BBA;&#x7684;&#x57FA;&#x7840;&#xFF0C;&#x5373;&#x63A7;&#x5236;&#x8BBA;&#x3002; [9]</p>
</li>
<li><p>The control revolution produced not only feedback techniques and a new hierarchization of media, but also revolutionized the cultural reproduction forms of society. [^10] This included areas like communications and art, since the technologies exercised a direct influence on the forms of sociocultural (re)production.<br>&#x63A7;&#x5236;&#x9769;&#x547D;&#x4E0D;&#x4EC5;&#x4EA7;&#x751F;&#x4E86;&#x53CD;&#x9988;&#x6280;&#x672F;&#x3001;&#x9020;&#x5C31;&#x4E86;&#x65B0;&#x7684;&#x5A92;&#x4F53;&#x5206;&#x5C42;&#xFF0C;&#x800C;&#x4E14;&#x8FD8;&#x9769;&#x65B0;&#x4E86;&#x793E;&#x4F1A;&#x7684;&#x6587;&#x5316;&#x518D;&#x751F;&#x4EA7;&#x5F62;&#x5F0F;&#x3002; [10]&#x8FD9;&#x5176;&#x4E2D;&#x4FBF;&#x5305;&#x62EC;&#x4E86;&#x8BF8;&#x5982;&#x901A;&#x4FE1;&#x548C;&#x827A;&#x672F;&#x7B49;&#x9886;&#x57DF;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x4E9B;&#x6280;&#x672F;&#x76F4;&#x63A5;&#x5F71;&#x54CD;&#x5230;&#x4E86;&#x793E;&#x4F1A;&#x6587;&#x5316;&#xFF08;&#x518D;&#xFF09;&#x751F;&#x4EA7;&#x7684;&#x5F62;&#x5F0F;&#x3002;</p>
</li>
<li><p>Until then, nevertheless, the themes associated with control mechanisms and automation were discussed in connection with only one common parameter, namely energy. As the basic concept of Newtonian mechanics, energy retained the same position in the natural sciences and in research fields like acoustics, electrical science, and optics. The invariant of &#x2039;mass&#x203A; similarly occupied a central position in physics. However, as production techniques continued to be improved, so the relationship of human and machine began to change likewise, leading to the emergence of questions about new terms and theories able to make this communication process between biological and technological systems the object of targeted research.<br>&#x800C;&#x5728;&#x90A3;&#x4E4B;&#x524D;&#xFF0C;&#x4E0E;&#x63A7;&#x5236;&#x673A;&#x5236;&#x548C;&#x81EA;&#x52A8;&#x5316;&#x76F8;&#x5173;&#x7684;&#x4E3B;&#x9898;&#x53EA;&#x4E0E;&#x4E00;&#x4E2A;&#x901A;&#x7528;&#x53C2;&#x6570;&#x6709;&#x5173;&#xFF0C;&#x5373;&#x80FD;&#x91CF;&#x3002;&#x4F5C;&#x4E3A;&#x725B;&#x987F;&#x529B;&#x5B66;&#x7684;&#x57FA;&#x672C;&#x6982;&#x5FF5;&#xFF0C;&#x80FD;&#x91CF;&#x5728;&#x81EA;&#x7136;&#x79D1;&#x5B66;&#x3001;&#x58F0;&#x5B66;&#x3001;&#x7535;&#x5B50;&#x79D1;&#x5B66;&#x548C;&#x5149;&#x5B66;&#x7B49;&#x7814;&#x7A76;&#x9886;&#x57DF;&#x4FDD;&#x6709;&#x540C;&#x6837;&#x7684;&#x5730;&#x4F4D;&#x3002; (mass)&#x7684;&#x4E0D;&#x53D8;&#x6027;&#x540C;&#x6837;&#x5728;&#x7269;&#x7406;&#x5B66;&#x4E2D;&#x5360;&#x636E;&#x4E86;&#x4E2D;&#x5FC3;&#x4F4D;&#x7F6E;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x968F;&#x7740;&#x751F;&#x4EA7;&#x6280;&#x672F;&#x7684;&#x4E0D;&#x65AD;&#x5B8C;&#x5584;&#xFF0C;&#x4EBA;&#x4E0E;&#x673A;&#x5668;&#x7684;&#x5173;&#x7CFB;&#x4E5F;&#x5F00;&#x59CB;&#x53D1;&#x751F;&#x53D8;&#x5316;&#xFF0C;&#x5BFC;&#x81F4;&#x51FA;&#x73B0;&#x4E86;&#x4E00;&#x4E9B;&#x5173;&#x4E8E;&#x65B0;&#x672F;&#x8BED;&#x548C;&#x65B0;&#x7406;&#x8BBA;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x8FD9;&#x4E9B;&#x65B0;&#x7684;&#x672F;&#x8BED;&#x548C;&#x7406;&#x8BBA;&#x80FD;&#x4F7F;&#x751F;&#x7269;&#x7CFB;&#x7EDF;&#x548C;&#x6280;&#x672F;&#x7CFB;&#x7EDF;&#x4E4B;&#x95F4;&#x7684;&#x4EA4;&#x6D41;&#x8FC7;&#x7A0B;&#x6210;&#x4E3A;&#x6709;&#x9488;&#x5BF9;&#x6027;&#x7684;&#x7814;&#x7A76;&#x5BF9;&#x8C61;&#x3002;</p>
</li>
</ol>
<h3 id="The-constitution-of-two-new-disciplines-cybernetics-and-artificial-intelligence"><a href="#The-constitution-of-two-new-disciplines-cybernetics-and-artificial-intelligence" class="headerlink" title="The constitution of two new disciplines: cybernetics and artificial intelligence"></a>The constitution of two new disciplines: cybernetics and artificial intelligence</h3><h3 id="&#x4E24;&#x4E2A;&#x65B0;&#x5B66;&#x79D1;&#x7684;&#x6784;&#x6210;&#xFF1A;&#x63A7;&#x5236;&#x8BBA;&#x4E0E;&#x4EBA;&#x5DE5;&#x667A;&#x80FD;"><a href="#&#x4E24;&#x4E2A;&#x65B0;&#x5B66;&#x79D1;&#x7684;&#x6784;&#x6210;&#xFF1A;&#x63A7;&#x5236;&#x8BBA;&#x4E0E;&#x4EBA;&#x5DE5;&#x667A;&#x80FD;" class="headerlink" title="&#x4E24;&#x4E2A;&#x65B0;&#x5B66;&#x79D1;&#x7684;&#x6784;&#x6210;&#xFF1A;&#x63A7;&#x5236;&#x8BBA;&#x4E0E;&#x4EBA;&#x5DE5;&#x667A;&#x80FD;"></a>&#x4E24;&#x4E2A;&#x65B0;&#x5B66;&#x79D1;&#x7684;&#x6784;&#x6210;&#xFF1A;&#x63A7;&#x5236;&#x8BBA;&#x4E0E;&#x4EBA;&#x5DE5;&#x667A;&#x80FD;</h3><ol start="12">
<li><p>That society can only be understood through a study of the messages and the communication facilities which belong to it; and that in the future development of these messages and communication facilities, messages between man and machines, between machines and man, and between machine and machine, are destined to play an ever increasing part,&#xBB; [^11] was the key idea of the American mathematician Norbert Wiener (1894&#x2013;1964), which he elaborated in his book &#xAB;The Human Use of Human Beings. Cybernetics and Society,&#xBB; published in 1950 after a first technical study &#xAB;Cybernetic, or Control and Communication in the Animal and in the Machine&#xBB; of 1948. In 1950 likewise, the British mathematician Alan Turing (1912&#x2013;1954) raised the question of the feasibility of logical thought by machines. In his essay &#xAB;Computing Machinery and Intelligence,&#xBB; published in volume 59 of the philosophical journal &#xAB;Mind,&#xBB; Turing proceeds from the basic question with which his text begins: &#xAB;Can machines think?&#xBB;<br>&#x53EA;&#x6709;&#x901A;&#x8FC7;&#x7814;&#x7A76;&#x5C5E;&#x4E8E;&#x5B83;&#x7684;&#x4FE1;&#x606F;&#x548C;&#x901A;&#x4FE1;&#x8BBE;&#x65BD;&#x624D;&#x80FD;&#x7406;&#x89E3;&#x201C;&#x793E;&#x4F1A;&#x201D;&#xFF1B;&#x800C;&#x4E14;&#x5728;&#x8FD9;&#x4E9B;&#x4FE1;&#x606F;&#x548C;&#x901A;&#x4FE1;&#x8BBE;&#x65BD;&#x7684;&#x672A;&#x6765;&#x53D1;&#x5C55;&#x4E2D;&#xFF0C;&#x4EBA;&#x4E0E;&#x673A;&#x5668;&#x4E4B;&#x95F4;&#xFF0C;&#x673A;&#x5668;&#x4E0E;&#x4EBA;&#x4E4B;&#x95F4;&#xFF0C;&#x673A;&#x5668;&#x4E0E;&#x673A;&#x5668;&#x4E4B;&#x95F4;&#x7684;&#x4FE1;&#x606F;&#x6CE8;&#x5B9A;&#x5C06;&#x4F1A;&#x53D1;&#x6325;&#x8D8A;&#x6765;&#x8D8A;&#x5927;&#x7684;&#x4F5C;&#x7528;&#xFF0C;&#x201C;[11]&#x662F;&#x7F8E;&#x56FD;&#x91CD;&#x8981;&#x601D;&#x60F3;&#x5BB6;&#x4E0E;&#x6570;&#x5B66;&#x5BB6;&#x8BFA;&#x4F2F;&#x7279;&#xB7;&#x7EF4;&#x7EB3;&#xFF08;Norbert Wiener&#xFF0C;1894-1964&#xFF09;&#xFF0C;&#x5728;&#x4ED6;&#x7684;&#x4E66;&#x300A;&#x4EBA;&#x7C7B;&#x7684;&#x4EBA;&#x7C7B;&#x4F7F;&#x7528;&#xFF0C;&#x63A7;&#x5236;&#x8BBA;&#x4E0E;&#x793E;&#x4F1A;&#x300B;&#x4E00;&#x4E66;&#x4E2D;&#x8BE6;&#x7EC6;&#x9610;&#x8FF0;&#x4E86;&#x8FD9;&#x4E00;&#x70B9;&#x3002; &#x8BE5;&#x4E66;&#x4E8E;1950&#x5E74;&#x53D1;&#x8868;&#xFF0C;&#x7ECF;&#x8FC7;&#x7B2C;&#x4E00;&#x6B21;&#x6280;&#x672F;&#x7814;&#x7A76;&#x300A;1948&#x5E74;&#x52A8;&#x7269;&#x548C;&#x673A;&#x5668;&#x4E2D;&#x7684;&#x63A7;&#x5236;&#x4E0E;&#x6C9F;&#x901A;&#x300B;&#x4E4B;&#x540E;&#x3002;&#x5728;1950&#x5E74;&#xFF0C;&#x540C;&#x6837;&#xFF0C;&#x82F1;&#x56FD;&#x6570;&#x5B66;&#x5BB6;&#x827E;&#x4F26;&#x56FE;&#x7075;&#xFF08;1912-1954&#xFF09;&#x63D0;&#x51FA;&#x4E86;&#x673A;&#x5668;&#x903B;&#x8F91;&#x601D;&#x7EF4;&#x7684;&#x53EF;&#x884C;&#x6027;&#x3002;&#x5728;&#x54F2;&#x5B66;&#x6742;&#x5FD7;&#x300A;&#x5FC3;&#x300B;&#x201D;&#x7B2C;59&#x5377;&#x53D1;&#x8868;&#x7684;&#x8BBA;&#x6587;&#xAB;&#x8BA1;&#x7B97;&#x673A;&#x68B0;&#x4E0E;&#x60C5;&#x62A5;&#xBB;&#x4E4B;&#x4E2D;&#xFF0C;&#x56FE;&#x7075;&#x4ECE;&#x4ED6;&#x7684;&#x6587;&#x672C;&#x5F00;&#x59CB;&#x7684;&#x57FA;&#x672C;&#x95EE;&#x9898;&#x51FA;&#x53D1;&#xFF1A;&#x201C;&#x673A;&#x5668;&#x80FD;&#x601D;&#x8003;&#x5417;&#xFF1F;&#x201D;</p>
</li>
<li><p>Until the mid-twentieth century no more than a few researchers working in isolation were concerned with subjects such as communication between dissimilar systems (for instance, biological and technical systems), or with the feasibility of technically designing thought machines. In addition to Wiener and Turing their ranks included Charles Babbage, Claude Shannon, Warren Weaver and Hermann Schmidt. However, from the 1950s on these subjects rapidly became two fields of basic research: cybernetics and Artificial Intelligence. [^12] The two aforementioned texts triggered a flood of publications containing speculation and analysis on these subjects. In the first three years after 1950 alone, more than a thousand essays published dealt with intelligence and with communication with and between machines. Yet, when Turing published his essay there existed no more than four digital computers worldwide (Mark I and EDSAC in England, ENIAC and BINAC in the USA). [^13] Although Turing&#x2019;s theorem&#x2014;everything the human mind can do in the form of an algorithm can also be carried out by a Universal Turing Machine&#x2014;was based on models so far investigated only as a hypothetical experiment, several researchers were inspired to empirically confirm or disprove it by building machines.<br>&#x4E00;&#x76F4;&#x5230;&#x4E8C;&#x5341;&#x4E16;&#x7EAA;&#x4E2D;&#x53F6;&#xFF0C;&#x53EA;&#x6709;&#x5F88;&#x5C11;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x7814;&#x7A76;&#x4EBA;&#x5458;&#x5728;&#x5173;&#x6CE8;&#x8BF8;&#x5982;&#x4E0D;&#x540C;&#x7CFB;&#x7EDF;&#xFF08;&#x4F8B;&#x5982;&#x751F;&#x7269;&#x7CFB;&#x7EDF;&#x548C;&#x6280;&#x672F;&#x7CFB;&#x7EDF;&#xFF09;&#x4E4B;&#x95F4;&#x7684;&#x901A;&#x4FE1;&#x6216;&#x8005;&#x4ECE;&#x6280;&#x672F;&#x4E0A;&#x8BBE;&#x8BA1;&#x601D;&#x60F3;&#x673A;&#x5668;&#x7684;&#x53EF;&#x884C;&#x6027;&#x7B49;&#x7B49;&#x4E3B;&#x9898;&#x3002;&#x9664;&#x4E86;&#x7EF4;&#x7EB3;&#x548C;&#x56FE;&#x7075;&#x4E4B;&#x5916;&#xFF0C;&#x4ED6;&#x4EEC;&#xFF08;&#x5B66;&#x8005;&#xFF09;&#x7684;&#x961F;&#x4F0D;&#x8FD8;&#x5305;&#x62EC;&#x67E5;&#x5C14;&#x65AF;&#x5DF4;&#x8D1D;&#x5947;&#xFF0C;&#x514B;&#x52B3;&#x5FB7;&#x9999;&#x519C;&#xFF0C;&#x6C83;&#x4F26;&#x97E6;&#x5F17;&#x548C;&#x8D6B;&#x5C14;&#x66FC;&#x65BD;&#x5BC6;&#x7279;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x4ECE;20&#x4E16;&#x7EAA;50&#x5E74;&#x4EE3;&#x5F00;&#x59CB;&#xFF0C;&#x8FD9;&#x4E9B;&#x4E3B;&#x9898;&#x8FC5;&#x901F;&#x6F14;&#x53D8;&#x4E3A;&#x57FA;&#x7840;&#x7814;&#x7A76;&#x7684;&#x4E24;&#x4E2A;&#x9886;&#x57DF;&#xFF1A;&#x63A7;&#x5236;&#x8BBA;&#x548C;&#x4EBA;&#x5DE5;&#x667A;&#x80FD;&#x3002; [12]&#x4E0A;&#x8FF0;&#x4E24;&#x7BC7;&#x6587;&#x7AE0;&#x5F15;&#x53D1;&#x4E86;&#x5927;&#x91CF;&#x7684;&#x51FA;&#x7248;&#x7269;&#x7684;&#x51FA;&#x7248;&#xFF0C;&#x5176;&#x4E2D;&#x5305;&#x62EC;&#x5BF9;&#x8FD9;&#x4E9B;&#x4E3B;&#x9898;&#x7684;&#x731C;&#x6D4B;&#x548C;&#x5206;&#x6790;&#x3002;&#x5728;1950&#x5E74;&#x4EE5;&#x540E;&#x7684;&#x5934;&#x4E09;&#x5E74;&#x4E4B;&#x4E2D;&#xFF0C;&#x53D1;&#x8868;&#x7684;&#x8BBA;&#x6587;&#x8D85;&#x8FC7;&#x4E00;&#x5343;&#x7BC7;&#xFF0C;&#x6D89;&#x53CA;&#x667A;&#x80FD;&#x548C;&#x673A;&#x5668;&#x95F4;&#x7684;&#x6C9F;&#x901A;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x5F53;&#x56FE;&#x7075;&#x53D1;&#x8868;&#x4ED6;&#x7684;&#x6587;&#x7AE0;&#x65F6;&#xFF0C;&#x4E16;&#x754C;&#x4E0A;&#x6570;&#x5B57;&#x8BA1;&#x7B97;&#x673A;&#x4E0D;&#x8D85;&#x8FC7;&#x56DB;&#x53F0;&#xFF08;&#x82F1;&#x683C;&#x5170;&#x7684;Mark I&#x548C;EDSAC&#xFF0C;&#x7F8E;&#x56FD;&#x7684;ENIAC&#x548C;BINAC&#xFF09;&#x3002; [13]&#x867D;&#x7136;&#x56FE;&#x7075;&#x5B9A;&#x7406; - &#x4EBA;&#x7C7B;&#x5927;&#x8111;&#x80FD;&#x591F;&#x4EE5;&#x7B97;&#x6CD5;&#x7684;&#x5F62;&#x5F0F;&#x505A;&#x7684;&#x6240;&#x6709;&#x4E8B;&#x60C5;&#x4E5F;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x901A;&#x7528;&#x56FE;&#x7075;&#x673A;&#x6765;&#x5B9E;&#x73B0; - &#x57FA;&#x4E8E;&#x8FC4;&#x4ECA;&#x4E3A;&#x6B62;&#x53EA;&#x4F5C;&#x4E3A;&#x5047;&#x8BBE;&#x5B9E;&#x9A8C;&#x8FDB;&#x884C;&#x8FC7;&#x8C03;&#x67E5;&#x7684;&#x6A21;&#x578B;&#xFF0C;&#x4F46;&#x51E0;&#x4F4D;&#x7814;&#x7A76;&#x4EBA;&#x5458;&#x53D7;&#x5230;&#x542F;&#x53D1;&#x4EE5;&#x51ED;&#x7ECF;&#x9A8C;&#x8BC1;&#x5B9E;&#x6216;&#x8005;&#x901A;&#x8FC7;&#x5EFA;&#x9020;&#x673A;&#x5668;&#x6765;&#x8FDB;&#x884C;&#x53CD;&#x9A73;&#x3002;</p>
</li>
</ol>
<p>:::info</p>
<h4 id="&#x51AF;&#x6D69;&#x796F;11-13"><a href="#&#x51AF;&#x6D69;&#x796F;11-13" class="headerlink" title="&#x51AF;&#x6D69;&#x796F;11 ~ 13"></a>&#x51AF;&#x6D69;&#x796F;11 ~ 13</h4><p>:::</p>
<h3 id="Communication"><a href="#Communication" class="headerlink" title="Communication"></a>Communication</h3><ol start="14">
<li>The approach of cybernetics&#x2014;a name derived from the Greek term &#x2039;kybernetes&#x203A; (steersman)&#x2014;consists in transferring the theory of control and message transmission, whether in the machine or in a living being, to the fields of communication and machine control. The objective is to investigate the relationships between animal and machine, and in the case of the machine the specific mode of its behavior, as a characteristic of the performance to be expected. [14]<br>&#x63A7;&#x5236;&#x8BBA;&#x7684;&#x65B9;&#x6CD5; &#x2014;&#x2014; &#x4E00;&#x4E2A;&#x6E90;&#x4E8E;&#x5E0C;&#x814A;&#x8BED;<kybernetes>&#xFF08;&#x8235;&#x624B;&#xFF09;&#x7684;&#x540D;&#x79F0; &#x2014;&#x2014; &#x5C06;&#x65E0;&#x8BBA;&#x662F;&#x5728;&#x673A;&#x5668;&#x8FD8;&#x662F;&#x5728;&#x751F;&#x7269;&#x4F53;&#x4E2D;&#x7684;&#x63A7;&#x5236;&#x548C;&#x4FE1;&#x606F;&#x4F20;&#x8F93;&#x7406;&#x8BBA;&#xFF0C;&#x90FD;&#x8F6C;&#x79FB;&#x5230;&#x4E86;&#x4FE1;&#x606F;&#x4EA4;&#x6D41;&#x4E0E;&#x673A;&#x5668;&#x63A7;&#x5236;&#x9886;&#x57DF;&#x3002;&#x5176;&#x76EE;&#x7684;&#x662F;&#x8C03;&#x67E5;&#x5206;&#x6790;&#x52A8;&#x7269;&#x548C;&#x673A;&#x5668;&#x4E4B;&#x95F4;&#x7684;&#x5173;&#x7CFB;&#xFF0C;&#x4EE5;&#x53CA;&#x4EE5;&#x673A;&#x5668;&#x7684;&#x7279;&#x5B9A;&#x884C;&#x4E3A;&#x6A21;&#x5F0F;&#xFF0C;&#x4F5C;&#x4E3A;&#x9884;&#x671F;&#x6027;&#x80FD;&#x7684;&#x4E00;&#x4E2A;&#x7279;&#x5F81;&#x3002;[14]</kybernetes></li>
</ol>
<ol start="15">
<li>On the basis of the observation of certain analogies between machines and living organisms, the mathematician asserts that no reason actually exists not to make a machine resemble a human being, since one and the other develop tendencies toward decreasing entropy, meaning that both are examples of local anti-entropic phenomena.<br>&#x5728;&#x89C2;&#x5BDF;&#x673A;&#x5668;&#x548C;&#x751F;&#x7269;&#x4F53;&#x4E4B;&#x95F4;&#x7684;&#x67D0;&#x4E9B;&#x76F8;&#x4F3C;&#x6027;&#x7684;&#x57FA;&#x7840;&#x4E0A;&#xFF0C;&#x6570;&#x5B66;&#x5BB6;&#x65AD;&#x8A00;&#xFF0C;&#x5B9E;&#x9645;&#x4E0A;&#x673A;&#x5668;&#x4E0E;&#x4EBA;&#x7C7B;&#x662F;&#x6709;&#x7406;&#x7531;&#x76F8;&#x4F3C;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x4ED6;&#x4EEC;&#x90FD;&#x503E;&#x5411;&#x4E8E;&#x71B5;&#x51CF;&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x4E24;&#x8005;&#x90FD;&#x6709;&#x5C40;&#x90E8;anti-entropic&#xFF08;&#x53CD;&#x71B5;&#xFF09;&#x7684;&#x73B0;&#x8C61;&#x3002;</li>
</ol>
<ol start="16">
<li>Turing likewise conceded priority to the subject of communication. His famous experiment&#x2014;the imitationgame, as he called it, also known as the Church-Turing thesis or Turing Theorem&#x2014;for verifying the intelligence of a computer was concerned less with the actual construction of such a machine than with simulating with machines the human capability of communication. Turing was here acting in line with a tradition of measuring the faculty of thought by the ability to use human language. Descartes had already presented the logically semantic usage of language as a criterion for identifying thinking beings. For a long time, the mastery of semantics would remain a basic problem of Artificial Intelligence.<br>&#x56FE;&#x7075;&#x540C;&#x6837;&#x5C06;&#x91CD;&#x70B9;&#x653E;&#x5728;&#x4EA4;&#x6D41;&#x4E0A;&#x3002; &#x4ED6;&#x8457;&#x540D;&#x7684;&#x5B9E;&#x9A8C; &#x2014;&#x2014; &#x4ED6;&#x79F0;&#x4E4B;&#x4E3A;&#x201C;&#x6A21;&#x4EFF;&#x6E38;&#x620F;&#x201D;&#xFF0C;&#x4E5F;&#x88AB;&#x79F0;&#x4E3A;Church-Turing thesis&#xFF08;&#x4E18;&#x5947;-&#x56FE;&#x7075;&#x8BBA;&#x9898;&#xFF09;&#x6216;Turing Theorem&#xFF08;&#x56FE;&#x7075;&#x5B9A;&#x7406;&#xFF09; &#x2014;&#x2014; &#x8BC1;&#x660E;&#x8BA1;&#x7B97;&#x673A;&#x7684;&#x667A;&#x80FD;&#x4E0E;&#x673A;&#x5668;&#x6A21;&#x62DF;&#x4EBA;&#x6C9F;&#x901A;&#x7684;&#x80FD;&#x529B;&#x76F8;&#x5173;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x4E0E;&#x8FD9;&#x79CD;&#x673A;&#x5668;&#x7684;&#x5B9E;&#x9645;&#x6784;&#x9020;&#x76F8;&#x5173;&#x3002;&#x7B1B;&#x5361;&#x5C14;&#x5DF2;&#x7ECF;&#x5C06;&#x8BED;&#x8A00;&#x7684;&#x903B;&#x8F91;&#x8BED;&#x4E49;&#x7528;&#x6CD5;&#x4F5C;&#x4E3A;&#x8BC6;&#x522B;&#x601D;&#x7EF4;&#x5B58;&#x5728;&#x7684;&#x6807;&#x51C6;&#x3002; &#x5728;&#x5F88;&#x957F;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x91CC;&#xFF0C;&#x8BED;&#x4E49;&#x7684;&#x638C;&#x63E1;&#x4ECD;&#x7136;&#x662F;&#x4EBA;&#x5DE5;&#x667A;&#x80FD;&#x7684;&#x4E00;&#x4E2A;&#x57FA;&#x672C;&#x95EE;&#x9898;&#x3002;<blockquote>
</blockquote>
</li>
</ol>
<h3 id="Information"><a href="#Information" class="headerlink" title="Information"></a>Information</h3><ol start="17">
<li>In contrast to that tradition Wiener&#x2019;s cybernetics sought operational ways of developing a specific language that would enable communication between dissimilar systems, and aimed to adapt semantics to specific goals in the process. Viewed from this perspective, Wiener&#x2019;s theory replaced the notion of energy with that of information as the elementary parameter of communication, and thus postulated the definition of this new invariant for cybernetic science as a whole, which is a basic prerequisite for understanding the range of the cybernetic approach.<br>&#x4E0E;&#x4F20;&#x7EDF;&#x76F8;&#x53CD;&#xFF0C;Wiener&#x2019;s&#xFF08;&#x7EF4;&#x7EB3;&#x7684;&#xFF09;&#x63A7;&#x5236;&#x8BBA;&#x5BFB;&#x6C42;&#x5F00;&#x53D1;&#x4E00;&#x79CD;&#x80FD;&#x591F;&#x5728;&#x4E0D;&#x540C;&#x7CFB;&#x7EDF;&#x4E4B;&#x95F4;&#x8FDB;&#x884C;&#x901A;&#x4FE1;&#x7684;&#x7279;&#x5B9A;&#x8BED;&#x8A00;&#x7684;&#x64CD;&#x4F5C;&#x65B9;&#x5F0F;&#xFF0C;&#x5E76;&#x4E14;&#x65E8;&#x5728;&#x8FC7;&#x7A0B;&#x4E2D;&#x4F7F;&#x8BED;&#x4E49;&#x9002;&#x5E94;&#x7684;&#x7279;&#x5B9A;&#x7684;&#x76EE;&#x6807;&#x3002;&#x4ECE;&#x8FD9;&#x4E2A;&#x89D2;&#x5EA6;&#x6765;&#x770B;&#xFF0C;Wiener&#x2019;s&#xFF08;&#x7EF4;&#x7EB3;&#x7684;&#xFF09;&#x7406;&#x8BBA;&#x7528;&#x4F5C;&#x4E3A;&#x4EA4;&#x6D41;&#x7684;&#x57FA;&#x672C;&#x53C2;&#x6570;&#x7684;&#x4FE1;&#x606F;&#x53D6;&#x4EE3;&#x4E86;&#x80FD;&#x91CF;&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x5E76;&#x56E0;&#x6B64;&#x5047;&#x5B9A;&#x8FD9;&#x4E2A;&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x6574;&#x4F53;&#x7684;&#x65B0;&#x7684;&#x63A7;&#x5236;&#x8BBA;&#x79D1;&#x5B66;&#x4E0D;&#x53D8;&#x91CF;&#x7684;&#x5B9A;&#x4E49;&#xFF0C;&#x8FD9;&#x662F;&#x7406;&#x89E3;&#x63A7;&#x5236;&#x8BBA;&#x65B9;&#x6CD5;&#x5DE5;&#x4F5C;&#x8303;&#x56F4;&#x7684;&#x4E00;&#x4E2A;&#x57FA;&#x672C;&#x5148;&#x51B3;&#x6761;&#x4EF6;&#x3002;</li>
</ol>
<ol start="18">
<li><p>Unlike Newton&#x2019;s mechanics, which operates with closed systems, information is applied to open systems. In this way it must be seen as a key enabling linkage and communication between dissimilar systems, and between the latter and the external world. &#x2039;Mass&#x203A; and &#x2039;energy&#x203A; are directly related to matter in the natural sciences, whereas &#x2039;information&#x203A; is not conveyed by any substance, but is based on variable properties: Information can be reproduced (duplicated or copied), destroyed (erased), or reiterated (repeated). &#xAB;Information is a name for the content of what is exchanged with the outer world as we adjust to it, and make our adjustment felt upon it. The process of receiving and of using information is the process of our adjusting to the contingencies of the outer environment, and of our living effectively within that environment.&#xBB; [^15] To this extent, not the possible quantity of circulating information is crucial to the effectiveness of communication, but the degree to which this information is integrated into communication. Along the lines of cybernetics, then,significant information is not the entirety of all information transmitted, but that information which passes through the &#x2039;filters.&#x203A;<br>&#x4E0E;&#x725B;&#x987F;&#x7684;&#x673A;&#x68B0;&#x7CFB;&#x7EDF;&#x4E0D;&#x540C;&#xFF0C;&#x8BE5;&#x7CFB;&#x7EDF;&#x91C7;&#x7528;&#x5C01;&#x95ED;&#x7CFB;&#x7EDF;&#x8FD0;&#x884C;&#xFF0C;&#x4FE1;&#x606F;&#x5E94;&#x7528;&#x4E8E;&#x5F00;&#x653E;&#x7CFB;&#x7EDF;&#x3002; &#x901A;&#x8FC7;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#xFF0C;&#x5B83;&#x5FC5;&#x987B;&#x88AB;&#x770B;&#x4F5C;&#x662F;&#x4E0D;&#x540C;&#x7CFB;&#x7EDF;&#x4E4B;&#x95F4;&#x4EE5;&#x53CA;&#x540E;&#x8005;&#x4E0E;&#x5916;&#x90E8;&#x4E16;&#x754C;&#x4E4B;&#x95F4;&#x7684;&#x5173;&#x952E;&#x8FDE;&#x63A5;&#x548C;&#x4EA4;&#x6D41;&#x3002; &lt;&#x8D28;&#x91CF;&gt;&#x548C;&lt;&#x80FD;&#x91CF;&gt;&#x4E0E;&#x81EA;&#x7136;&#x79D1;&#x5B66;&#x4E2D;&#x7684;&#x7269;&#x8D28;&#x76F4;&#x63A5;&#x76F8;&#x5173;&#xFF0C;&lt;&#x4FE1;&#x606F;&gt;&#x4E0D;&#x662F;&#x7531;&#x4EFB;&#x4F55;&#x7269;&#x8D28;&#x4F20;&#x9012;&#x7684;&#xFF0C;&#x800C;&#x662F;&#x57FA;&#x4E8E;&#x4E0D;&#x540C;&#x7684;&#x5C5E;&#x6027;&#xFF1A;&#x4FE1;&#x606F;&#x53EF;&#x4EE5;&#x88AB;&#x590D;&#x5236;&#xFF08;&#x590D;&#x5236;&#x6216;&#x62F7;&#x8D1D;&#xFF09;&#xFF0C;&#x9500;&#x6BC1;&#xFF08;&#x64E6;&#x9664;&#xFF09; &#x6216;&#x91CD;&#x7533;&#xFF08;&#x91CD;&#x590D;&#xFF09;&#x3002;&#x201C;&#x4FE1;&#x606F;&#x662F;&#x6211;&#x4EEC;&#x5728;&#x9002;&#x5E94;&#x5B83;&#x65F6;&#x4E0E;&#x5916;&#x90E8;&#x4E16;&#x754C;&#x4EA4;&#x6362;&#x5185;&#x5BB9;&#x7684;&#x540D;&#x79F0;&#xFF0C;&#x5E76;&#x4F7F;&#x6211;&#x4EEC;&#x7684;&#x53EF;&#x4EE5;&#x8C03;&#x6574;&#x611F;&#x53D7;&#x5230;&#x5B83;&#x3002; &#x63A5;&#x6536;&#x548C;&#x4F7F;&#x7528;&#x4FE1;&#x606F;&#x7684;&#x8FC7;&#x7A0B;&#x662F;&#x6211;&#x4EEC;&#x9002;&#x5E94;&#x5916;&#x90E8;&#x73AF;&#x5883;&#x7684;&#x7A81;&#x53D1;&#x4E8B;&#x4EF6;&#x548C;&#x8C03;&#x6574;&#x6211;&#x4EEC;&#x5728;&#x8BE5;&#x73AF;&#x5883;&#x4E2D;&#x53EF;&#x4EE5;&#x6709;&#x6548;&#x5730;&#x751F;&#x6D3B;&#x7684;&#x8FC7;&#x7A0B;&#x3002;&#x201C;[14]&#x5728;&#x8FD9;&#x79CD;&#x5C42;&#x9762;&#x4E0A;&#xFF0C;&#x91CD;&#x8981;&#x7684;&#x4E0D;&#x662F;&#x5927;&#x91CF;&#x4F20;&#x64AD;&#x4FE1;&#x606F;&#x5BF9;&#x4E8E;&#x4EA4;&#x6D41;&#x7684;&#x6709;&#x6548;&#x6027;&#xFF0C;&#x800C;&#x662F;&#x8FD9;&#x79CD;&#x4FE1;&#x606F;&#x878D;&#x5165;&#x4EA4;&#x6D41;&#x7684;&#x7A0B;&#x5EA6;&#x3002;&#x7136;&#x540E;&#xFF0C;&#x6839;&#x636E;&#x63A7;&#x5236;&#x8BBA;&#x7684;&#x89C2;&#x70B9;&#xFF0C;&#x91CD;&#x8981;&#x4FE1;&#x606F;&#x5E76;&#x4E0D;&#x662F;&#x6240;&#x6709;&#x4FE1;&#x606F;&#x7684;&#x5B8C;&#x6574;&#x4F20;&#x9012;&#xFF0C;&#x800C;&#x662F;&#x901A;&#x8FC7;&lt;&#x8FC7;&#x6EE4;&#x5668;&gt;&#x7684;&#x4FE1;&#x606F;&#x3002;<br>:::success</p>
<h4 id="&#x5434;&#x884D;&#x5F6C;14-18"><a href="#&#x5434;&#x884D;&#x5F6C;14-18" class="headerlink" title="&#x5434;&#x884D;&#x5F6C;14-18"></a>&#x5434;&#x884D;&#x5F6C;14-18</h4><p>:::</p>
<h3 id="Feedback"><a href="#Feedback" class="headerlink" title="Feedback"></a>Feedback</h3><h2 id="&#x53CD;&#x9988;"><a href="#&#x53CD;&#x9988;" class="headerlink" title="&#x53CD;&#x9988;"></a>&#x53CD;&#x9988;</h2></li>
<li><p>In the field of information and communication Wiener devoted particular attention to the question of automatons and the development of feedback models. His core interest lay in investigating machines capable of evaluating input and of integrating the stored experience into the further feedback loops. In this respect, feedback is a method of making systems self-regulating, by which the results of preceding activities are re-integrated in the procedural sequence and thus enable runtime corrections to be made permanently. To this end, machines must be capable of learning processes.<br>&#x5728;&#x4FE1;&#x606F;&#x548C;&#x901A;&#x4FE1;&#x9886;&#x57DF;&#xFF0C;&#x7EF4;&#x7EB3;&#x7279;&#x522B;&#x5173;&#x6CE8;&#x81EA;&#x52A8;&#x673A;&#x95EE;&#x9898;&#x548C;&#x53CD;&#x9988;&#x6A21;&#x578B;&#x7684;&#x53D1;&#x5C55;&#x3002;&#x4ED6;&#x7684;&#x6838;&#x5FC3;&#x5174;&#x8DA3;&#x5728;&#x4E8E;&#x7814;&#x7A76;&#x80FD;&#x591F;&#x8BC4;&#x4F30;&#x8F93;&#x5165;&#x5E76;&#x5C06;&#x5B58;&#x50A8;&#x7684;&#x4F53;&#x9A8C;&#x6574;&#x5408;&#x5230;&#x66F4;&#x591A;&#x53CD;&#x9988;&#x73AF;&#x8DEF;&#x7684;&#x673A;&#x5668;&#x3002;&#x5728;&#x8FD9;&#x65B9;&#x9762;&#xFF0C;&#x53CD;&#x9988;&#x662F;&#x4E00;&#x79CD;&#x4F7F;&#x7CFB;&#x7EDF;&#x81EA;&#x6211;&#x8C03;&#x8282;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x901A;&#x8FC7;&#x8BE5;&#x65B9;&#x6CD5;&#x5C06;&#x524D;&#x9762;&#x6D3B;&#x52A8;&#x7684;&#x7ED3;&#x679C;&#x91CD;&#x65B0;&#x96C6;&#x6210;&#x5728;&#x8FC7;&#x7A0B;&#x5E8F;&#x5217;&#x5F53;&#x4E2D;&#xFF0C;&#x4ECE;&#x800C;&#x4F7F;&#x5728;&#x8FD0;&#x884C;&#x7684;&#x540C;&#x65F6;&#x4FEE;&#x6B63;&#x53EF;&#x4EE5;&#x591F;&#x6C38;&#x4E45;&#x5730;&#x6301;&#x7EED;&#x4E0B;&#x53BB;&#x3002;&#x4E3A;&#x6B64;&#xFF0C;&#x673A;&#x5668;&#x5FC5;&#x987B;&#x80FD;&#x591F;&#x5B66;&#x4E60;&#x8FC7;&#x7A0B;&#x3002;</p>
</li>
<li><p>Although his approaches and conclusions are very different from those of Wiener, Turing in his essay likewise clearly indicated the necessity of developing systems capable of learning. Devoted to the subject of learning machines, the essay takes as its starting point the principle that &#xAB;education can take place provided that communication in both directions between teacher and pupil can take place by some means or other.&#xBB; [^16] Turing&#x2019;s theory already aims at the need to create systems that guarantee for bi-directional communication of this kind. Necessary for this purpose are &#xAB;unemotional channels of communication&#xBB; over which it is possible to &#xAB;teach a machine by punishments and rewards to obey orders given in some language, e.g., a symbolic language.&#xBB; [^17]<br>&#x867D;&#x7136;&#x4ED6;&#x7684;&#x65B9;&#x6CD5;&#x548C;&#x7ED3;&#x8BBA;&#x4E0E;&#x7EF4;&#x7EB3;&#x7684;&#x65B9;&#x6CD5;&#x548C;&#x7ED3;&#x8BBA;&#x6709;&#x5F88;&#x5927;&#x4E0D;&#x540C;&#xFF0C;&#x4F46;&#x56FE;&#x7075;&#x5728;&#x4ED6;&#x7684;&#x8BBA;&#x6587;&#x4E2D;&#x4E5F;&#x6E05;&#x695A;&#x5730;&#x8868;&#x660E;&#x4E86;&#x5F00;&#x53D1;&#x80FD;&#x591F;&#x5B66;&#x4E60;&#x7684;&#x7CFB;&#x7EDF;&#x7684;&#x5FC5;&#x8981;&#x6027;&#x3002;&#x81F4;&#x529B;&#x4E8E;&#x5B66;&#x4E60;&#x673A;&#x5668;&#x7684;&#x4E3B;&#x9898;&#xFF0C;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x7684;&#x51FA;&#x53D1;&#x70B9;&#x662F;&#x201C;&#x6559;&#x80B2;&#x7684;&#x524D;&#x63D0;&#x662F;&#x5F53;&#x6559;&#x5E08;&#x548C;&#x5B66;&#x751F;&#x4E4B;&#x95F4;&#x7684;&#x53CC;&#x5411;&#x6C9F;&#x901A;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x67D0;&#x79CD;&#x65B9;&#x5F0F;&#x8FDB;&#x884C;&#x3002;&#x201D;[15]&#x3002;&#x56FE;&#x7075;&#x7684;&#x7406;&#x8BBA;&#x7784;&#x51C6;&#x7684;&#x662F;&#x9700;&#x8981;&#x521B;&#x5EFA;&#x4FDD;&#x8BC1;&#x8FD9;&#x79CD;&#x53CC;&#x5411;&#x901A;&#x4FE1;&#x673A;&#x5236;&#x7684;&#x7CFB;&#x7EDF;&#x3002;&#x4E3A;&#x6B64;&#xFF0C;&#x975E;&#x5E38;&#x5FC5;&#x987B;&#x7684;&#x662F;&#x201C;&#x975E;&#x60C5;&#x611F;&#x7684;&#x6C9F;&#x901A;&#x6E20;&#x9053;&#x201D;&#xFF0C;&#x901A;&#x8FC7;&#x8FD9;&#x79CD;&#x6C9F;&#x901A;&#x6E20;&#x9053;&#xFF0C;&#x53EF;&#x4EE5;&#x5B9E;&#x73B0;&#x201C;&#x901A;&#x8FC7;&#x60E9;&#x7F5A;&#x548C;&#x5956;&#x52B1;&#x6559;&#x5BFC;&#x673A;&#x5668;&#x9075;&#x5B88;&#x67D0;&#x4E9B;&#x8BED;&#x8A00;&#x7ED9;&#x51FA;&#x7684;&#x547D;&#x4EE4;&#xFF0C;&#x4F8B;&#x5982;&#x8C61;&#x5F81;&#x6027;&#x7684;&#x8BED;&#x8A00;&#x201D;&#x3002;[16]</p>
</li>
</ol>
<h3 id="Human-machine-communication"><a href="#Human-machine-communication" class="headerlink" title="Human-machine communication"></a>Human-machine communication</h3><ol start="21">
<li><p>Turing&#x2019;s idea was directed at the concept today known as &#x2039;interface&#x203A; or &#x2039;humanmachine interface.&#x203A; This intermediary element is a kind of &#x2039;translator&#x203A; who transforms the information conveyed in symbolic language into binary code, the language of the computer. To this extent, the interface opens up a communication channel between the two systems, between the human and the electronic.<br>&#x56FE;&#x7075;&#x7684;&#x601D;&#x60F3;&#x88AB;&#x7528;&#x4E8E;&#x5F53;&#x4ECA;&#x77E5;&#x540D;&#x7684;&lt;&#x63A5;&#x53E3;&gt;&#x6216;&#x8005;&#x662F;&lt;&#x4EBA;&#x673A;&#x63A5;&#x53E3;&gt;&#x7684;&#x6982;&#x5FF5;&#x3002;&#x8FD9;&#x4E2A;&#x5A92;&#x4ECB;&#x7684;&#x5143;&#x7D20;&#x662F;&lt;&#x7FFB;&#x8BD1;&#x5668;&gt;&#x7684;&#x4E00;&#x79CD;&#x7C7B;&#x578B;&#xFF1A;&#x8F6C;&#x6362;&#x7B26;&#x53F7;&#x8BED;&#x8A00;&#x7684;&#x8868;&#x8FBE;&#x901A;&#x8FC7;&#x8BA1;&#x7B97;&#x673A;&#x4E8C;&#x8FDB;&#x5236;&#x4EE3;&#x7801;&#x7684;&#x8BED;&#x8A00;&#x6765;&#x4F20;&#x8FBE;&#x4FE1;&#x606F;&#x3002;&#x901A;&#x8FC7;&#x8FD9;&#x6837;&#x7684;&#x6269;&#x5C55;&#xFF0C;&#x8FD9;&#x4E2A;&#x63A5;&#x53E3;&#x4FBF;&#x5F00;&#x542F;&#x4E86;&#x4EBA;&#x548C;&#x7535;&#x5B50;&#x8BBE;&#x5907;&#x4E24;&#x4E2A;&#x7CFB;&#x7EDF;&#x4E4B;&#x95F4;&#x901A;&#x4FE1;&#x7684;&#x901A;&#x9053;&#x3002;<br>:::success</p>
<h4 id="&#x502A;&#x534E;&#x590F;-21"><a href="#&#x502A;&#x534E;&#x590F;-21" class="headerlink" title="&#x502A;&#x534E;&#x590F; 21"></a>&#x502A;&#x534E;&#x590F; 21</h4><p>:::</p>
</li>
<li><p>Turing here went one step further than the feedback theory of Wiener, whose concept was confined to recursive processes within single systems. Turing, by contrast, conceived of a system capable oflearning and based on the exchange of information between human and machine. The approaches of the two mathematicians differ above all in the possibility of comparing systems. Norbert Wiener took as his point of departure the principle that a resemblance exists between living beings and machines, with the learning process being restricted to the acquisition of information and the ability to memorize the results of past operations for future usage. Alan Turing insisted that there was a difference between the behavior of the human nervous system, in which &#xAB;chemical phenomena are at least as important as electrical&#xBB; [^18] and the capabilities of a discrete machine. [^19] Machines &#xAB;which move by sudden jumps or clicks from one quite definite state to another&#xBB; [^20] do not, strictly speaking, exist, since in reality everything is a constant process. This difference therefore makes impossible a direct connection between human beings and machines, and at the same time demands the development of a &#x2039;channel&#x203A; (interface) that initiates this communication. [^21] Turing&#x2019;s proposal was thus a decisive step towards the development of electronic interfaces for human-machine communication, and beyond that for the development of interactive, digital systems. This communication channel permits bi-directional information exchange, and therefore also learning processes. On the basis of this method, Turing repudiated the thesis set up by Ada Lovelace in 1842. [^22] Using investigations made with the &#x2039;analytic machine&#x203A; of Charles Babbage, Lady Lovelace had claimed that a machine can do only that which it is instructed to do, and therefore is never capable of producing anything truly new. [^23] Turing contradicted this thesis with the question &#xAB;who can be certain that &#x2039;original work&#x203A; that he has done was not simply the growth of the seed planted in him by teaching, or the effect of following well-known general principles?&#xBB; [^24] He further pointed out that the machine must be to a certain degree<br>&#x2039;undisciplined&#x203A; or random-controlled in order that its behavior can be considered intelligent. [^25]Precisely this element of chance was what lent the machine &#x2039;creative&#x203A; ability, namely the ability to solve problems.<br>&#x56FE;&#x7075;&#x5728;&#x8FD9;&#x91CC;&#x6BD4;&#x7EF4;&#x7EB3;&#x7684;&#x53CD;&#x9988;&#x7406;&#x8BBA;&#x66F4;&#x8FDB;&#x4E00;&#x6B65;&#xFF0C;&#x5B83;&#x7684;&#x6982;&#x5FF5;&#x4EC5;&#x9650;&#x4E8E;&#x5355;&#x4E2A;&#x7CFB;&#x7EDF;&#x5185;&#x7684;&#x9012;&#x5F52;&#x8FC7;&#x7A0B;&#x3002;&#x76F8;&#x53CD;&#xFF0C;&#x56FE;&#x7075;&#x6784;&#x60F3;&#x4E86;&#x4E00;&#x4E2A;&#x80FD;&#x591F;&#x5B66;&#x4E60;&#x7684;&#x7CFB;&#x7EDF;&#xFF0C;&#x5E76;&#x57FA;&#x4E8E;&#x4EBA;&#x673A;&#x4EA4;&#x4E92;&#x4FE1;&#x606F;&#x3002;&#x4E24;&#x4F4D;&#x6570;&#x5B66;&#x5BB6;&#x7684;&#x65B9;&#x6CD5;&#x5728;&#x6BD4;&#x8F83;&#x7CFB;&#x7EDF;&#x7684;&#x53EF;&#x80FD;&#x6027;&#x4E0A;&#x6709;&#x6240;&#x4E0D;&#x540C;&#x3002;&#x8BFA;&#x4F2F;&#x7279;&#xB7;&#x7EF4;&#x7EB3;&#x4EE5;&#x4ED6;&#x7684;&#x51FA;&#x53D1;&#x70B9;&#x4E3A;&#x57FA;&#x7840;&#xFF0C;&#x8BA4;&#x4E3A;&#x751F;&#x7269;&#x4E0E;&#x673A;&#x5668;&#x4E4B;&#x95F4;&#x5B58;&#x5728;&#x76F8;&#x4F3C;&#x4E4B;&#x5904;&#xFF0C;&#x5B66;&#x4E60;&#x8FC7;&#x7A0B;&#x4EC5;&#x9650;&#x4E8E;&#x83B7;&#x53D6;&#x4FE1;&#x606F;&#xFF0C;&#x5E76;&#x80FD;&#x591F;&#x8BB0;&#x5FC6;&#x8FC7;&#x53BB;&#x64CD;&#x4F5C;&#x7684;&#x7ED3;&#x679C;&#x4EE5;&#x5907;&#x5C06;&#x6765;&#x4F7F;&#x7528;&#x3002;&#x827E;&#x4F26;&#x56FE;&#x7075;&#x575A;&#x6301;&#x8BA4;&#x4E3A;&#x4EBA;&#x7C7B;&#x795E;&#x7ECF;&#x7CFB;&#x7EDF;&#x7684;&#x884C;&#x4E3A;&#x4E0E;&#x201C;&#x79BB;&#x6563;&#x673A;&#x5668;&#x7684;&#x80FD;&#x529B;&#x201D;&#x4E4B;&#x95F4;&#x5B58;&#x5728;&#x7740;&#x5DEE;&#x5F02;&#xFF0C;&#x5176;&#x4E2D;&#x201C;&#x5316;&#x5B66;&#x73B0;&#x8C61;&#x81F3;&#x5C11;&#x4E0E;&#x7535;&#x529B;&#x4E00;&#x6837;&#x91CD;&#x8981;&#x201D;[18]&#x3002; [^ 19]&#x4ECE;&#x4E25;&#x683C;&#x610F;&#x4E49;&#x4E0A;&#x8BF4;&#xFF0C;&#x673A;&#x5668;&#x201C;&#x7A81;&#x7136;&#x8DF3;&#x8DC3;&#x6216;&#x70B9;&#x51FB;&#x4ECE;&#x4E00;&#x4E2A;&#x76F8;&#x5F53;&#x786E;&#x5B9A;&#x7684;&#x72B6;&#x6001;&#x79FB;&#x52A8;&#x5230;&#x53E6;&#x4E00;&#x4E2A;&#x72B6;&#x6001;&#x201D;[^ 20]&#x5E76;&#x4E0D;&#x5B58;&#x5728;&#xFF0C;&#x56E0;&#x4E3A;&#x5B9E;&#x9645;&#x4E0A;&#x4E00;&#x5207;&#x90FD;&#x662F;&#x4E00;&#x4E2A;&#x8FDE;&#x7EED;&#x7684;&#x8FC7;&#x7A0B;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x8FD9;&#x79CD;&#x5DEE;&#x5F02;&#x4F7F;&#x5F97;&#x4EBA;&#x4E0E;&#x673A;&#x5668;&#x4E4B;&#x95F4;&#x4E0D;&#x53EF;&#x80FD;&#x76F4;&#x63A5;&#x8FDE;&#x63A5;&#xFF0C;&#x5E76;&#x4E14;&#x540C;&#x65F6;&#x8981;&#x6C42;&#x5F00;&#x53D1;&#x542F;&#x52A8;&#x8BE5;&#x901A;&#x4FE1;&#x7684;&lt;&#x901A;&#x9053;&gt;&#xFF08;&#x63A5;&#x53E3;&#xFF09;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x56FE;&#x7075;&#x7684;&#x63D0;&#x6848;&#x662F;&#x5F00;&#x53D1;&#x7528;&#x4E8E;&#x4EBA;&#x673A;&#x901A;&#x4FE1;&#x7684;&#x7535;&#x5B50;&#x63A5;&#x53E3;&#x7684;&#x51B3;&#x5B9A;&#x6027;&#x6B65;&#x9AA4;&#xFF0C;&#x5E76;&#x8D85;&#x8D8A;&#x4E86;&#x5F00;&#x53D1;&#x4EA4;&#x4E92;&#x5F0F;&#x6570;&#x5B57;&#x7CFB;&#x7EDF;&#x7684;&#x51B3;&#x5FC3;&#x3002;&#x8BE5;&#x901A;&#x4FE1;&#x6E20;&#x9053;&#x5141;&#x8BB8;&#x53CC;&#x5411;&#x4FE1;&#x606F;&#x4EA4;&#x6362;&#xFF0C;&#x56E0;&#x6B64;&#x4E5F;&#x5141;&#x8BB8;&#x5B66;&#x4E60;&#x8FC7;&#x7A0B;&#x3002;&#x5728;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x7684;&#x57FA;&#x7840;&#x4E0A;&#xFF0C;&#x56FE;&#x7075;&#x9A73;&#x65A5;&#x4E86;Ada Lovelace&#x5728;1842&#x5E74;&#x8BBE;&#x7ACB;&#x7684;&#x8BBA;&#x6587;&#x3002;[^ 22]&#x5229;&#x7528;Charles Babbage&#x7684;<analytic machine="">&#x6240;&#x505A;&#x7684;&#x8C03;&#x67E5;&#xFF0C;Lady Lovelace&#x58F0;&#x79F0;&#x673A;&#x5668;&#x53EA;&#x80FD;&#x505A;&#x5230;&#x88AB;&#x6307;&#x793A;&#x53BB;&#x505A;&#xFF0C;&#x56E0;&#x6B64;&#x6C38;&#x8FDC;&#x4E0D;&#x4F1A;&#x4EA7;&#x751F;&#x4EFB;&#x4F55;&#x771F;&#x6B63;&#x65B0;&#x7684;&#x4E1C;&#x897F;&#x3002;&#x56FE;&#x7075;&#x63D0;&#x51FA;&#x95EE;&#x9898;&#x6765;&#x53CD;&#x9A73;&#xFF0C;&#x201C;&#x8C01;&#x80FD;&#x591F;&#x786E;&#x4FE1;&#x4ED6;&#x6240;&#x505A;&#x7684;&#x5DE5;&#x4F5C;&#x5E76;&#x4E0D;&#x4EC5;&#x4EC5;&#x662F;&#x6559;&#x4ED6;&#x79CD;&#x5728;&#x4ED6;&#x8EAB;&#x4E0A;&#x7684;&#x79CD;&#x5B50;&#x7684;&#x6210;&#x957F;&#xFF0C;&#x8FD8;&#x662F;&#x9075;&#x5FAA;&#x4F17;&#x6240;&#x5468;&#x77E5;&#x7684;&#x4E00;&#x822C;&#x539F;&#x5219;&#x7684;&#x5F71;&#x54CD;&#xFF1F; &#xBB;[^ 24]&#x4ED6;&#x8FDB;&#x4E00;&#x6B65;&#x6307;&#x51FA;&#xFF0C;&#x673A;&#x5668;&#x5FC5;&#x987B;&#x8FBE;&#x5230;&#x67D0;&#x79CD;&#x201C;&#x65E0;&#x89C4;&#x5F8B;&#x7684;&#x201D;&#x6216;&#x8005;&#x968F;&#x673A;&#x63A7;&#x5236;&#x7684;&#x7A0B;&#x5EA6;&#xFF0C;&#x624D;&#x53EF;&#x4EE5;&#x88AB;&#x8BA4;&#x4E3A;&#x662F;&#x667A;&#x80FD;&#x7684;&#x3002; [^ 25]&#x6B63;&#x662F;&#x8FD9;&#x79CD;&#x968F;&#x673A;&#x6027;&#x662F;&#x673A;&#x5668;&#x4EA7;&#x751F;&#x521B;&#x9020;&#x6027;&#x7684;&#x80FD;&#x529B;&#xFF0C;&#x5373;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#x7684;&#x80FD;&#x529B;&#x3002;</analytic></p>
</li>
<li><p>Although discrete machines that could pass the Turing Test are feasible, they would succeed notbecause they were replicas of the human brain but because they would have been programmed accordingly. As Turing himself realized, the basic problem lies in the area of programming. In fact, it was not necessary to wait the fifty years assumed by Turing in order to program &#xAB;computers, with a storage capacity of about 109, to make them play the imitation game so well that an average interrogator will not have more than a 70 per cent chance of making the right identification after five minutes of questioning.&#xBB; [^26] The programs have been written, and have passed the Turing Test with a high degree of interactivity. One might therefore conclude that the problem is not solely confined to investigating the possibilities of Artificial Intelligence. [^27]<br>&#x5C3D;&#x7BA1;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x56FE;&#x7075;&#x6D4B;&#x8BD5;&#x7684;&#x5206;&#x7ACB;&#x673A;&#x5668;&#x662F;&#x53EF;&#x884C;&#x7684;&#xFF0C;&#x4F46;&#x5B83;&#x4EEC;&#x4F1A;&#x6210;&#x529F;&#xFF0C;&#x4E0D;&#x662F;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x662F;&#x4EBA;&#x8111;&#x7684;&#x590D;&#x5236;&#x54C1;&#xFF0C;&#x800C;&#x662F;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x4F1A;&#x88AB;&#x76F8;&#x5E94;&#x5730;&#x7F16;&#x7A0B;&#x3002; &#x6B63;&#x5982;&#x56FE;&#x7075;&#x81EA;&#x5DF1;&#x610F;&#x8BC6;&#x5230;&#x7684;&#x90A3;&#x6837;&#xFF0C;&#x57FA;&#x672C;&#x95EE;&#x9898;&#x5728;&#x4E8E;&#x7F16;&#x7A0B;&#x9886;&#x57DF;&#x3002; &#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x6CA1;&#x6709;&#x5FC5;&#x8981;&#x7B49;&#x5F85;&#x56FE;&#x7075;&#x5047;&#x5B9A;&#x7684;50&#x5E74;&#x6765;&#x7F16;&#x7A0B;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x8BA1;&#x7B97;&#x673A;&#x201C;&#x6709;109&#x4E2A;&#x50A8;&#x5B58;&#x5668;&#xFF0C;&#x80FD;&#x591F;&#x5F88;&#x597D;&#x7684;&#x8FD0;&#x884C;&#x5192;&#x5145;(&#x4EBA;&#x7C7B;)&#x7684;&#x6E38;&#x620F;&#xFF0C;&#x5E76;&#x4F7F;&#x666E;&#x901A;&#x7684;&#x8BE2;&#x95EE;&#x7740;&#x4E0D;&#x4F1A;&#x8D85;&#x8FC7;70%&#x6982;&#x7387;&#x505A;&#x51FA;&#x6B63;&#x786E;&#x7684;&#x5224;&#x65AD;&#x201D;&#x8FD9;&#x4E9B;&#x7A0B;&#x5E8F;&#x5DF2;&#x7ECF;&#x7F16;&#x5199;&#x5B8C;&#x6210;&#xFF0C;&#x5E76;&#x4E14;&#x5DF2;&#x7ECF;&#x901A;&#x8FC7;&#x4E86;&#x9AD8;&#x4E92;&#x52A8;&#x6027;&#x7684;&#x7684;&#x56FE;&#x7075;&#x6D4B;&#x8BD5;&#x3002; &#x6709;&#x4EBA;&#x53EF;&#x80FD;&#x56E0;&#x6B64;&#x5F97;&#x51FA;&#x7ED3;&#x8BBA;&#xFF1A;&#x95EE;&#x9898;&#x4E0D;&#x4EC5;&#x4EC5;&#x5C40;&#x9650;&#x4E8E;&#x8C03;&#x67E5;&#x4EBA;&#x5DE5;&#x667A;&#x80FD;&#x7684;&#x53EF;&#x80FD;&#x6027;&#x3002;</p>
</li>
<li><p>Viewed from the contemporary perspective, cybernetics and AI cannot be reduced to solely scientific, economic, or technical interest. Since these theories belong to a socio-technical field in which communication structures, world-views and people-views are formed and transformed, they are concerned with philosophic issues of perception, cognition, language, ethics, and aesthetics. If information technology is basically working towards the automation of mental processes, then it directly or indirectly reaches into disciplines concerned with human cognition or creativity.<br>&#x4ECE;&#x5F53;&#x4EE3;&#x89D2;&#x5EA6;&#x6765;&#x770B;&#xFF0C;&#x63A7;&#x5236;&#x8BBA;&#x548C;&#x4EBA;&#x5DE5;&#x667A;&#x80FD;&#x4E0D;&#x80FD;&#x4EC5;&#x4EC5;&#x5F52;&#x7ED3;&#x4E3A;&#x79D1;&#x5B66;&#xFF0C;&#x7ECF;&#x6D4E;&#x6216;&#x6280;&#x672F;&#x7684;&#x5174;&#x8DA3;&#x3002; &#x7531;&#x4E8E;&#x8FD9;&#x4E9B;&#x7406;&#x8BBA;&#x5C5E;&#x4E8E;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x793E;&#x4F1A;&#x6280;&#x672F;&#x9886;&#x57DF;&#xFF1A;&#x5728;&#x8FD9;&#x4E2A;&#x9886;&#x57DF;&#x4EA4;&#x6D41;&#x6A21;&#x5F0F;&#x4E2D;&#xFF0C;&#x4E16;&#x754C;&#x89C2;&#x548C;&#x4EBA;&#x4EEC;&#x7684;&#x89C2;&#x70B9;&#x88AB;&#x5F62;&#x6210;&#x548C;&#x8F6C;&#x5316;&#xFF0C;&#x4ED6;&#x4EEC;&#x5173;&#x5FC3;&#x7684;&#x662F;&#x611F;&#x77E5;&#xFF0C;&#x8BA4;&#x77E5;&#xFF0C;&#x8BED;&#x8A00;&#xFF0C;&#x4F26;&#x7406;&#x548C;&#x7F8E;&#x5B66;&#x7B49;&#x54F2;&#x5B66;&#x95EE;&#x9898;&#x3002; &#x5982;&#x679C;&#x4FE1;&#x606F;&#x6280;&#x672F;&#x57FA;&#x672C;&#x4E0A;&#x81F4;&#x529B;&#x4E8E;&#x5FC3;&#x7406;&#x8FC7;&#x7A0B;&#x7684;&#x81EA;&#x52A8;&#x5316;&#xFF0C;&#x90A3;&#x4E48;&#x5B83;&#x76F4;&#x63A5;&#x6216;&#x95F4;&#x63A5;&#x5730;&#x6D89;&#x53CA;&#x4E0E;&#x4EBA;&#x7C7B;&#x8BA4;&#x77E5;&#x6216;&#x521B;&#x9020;&#x6709;&#x5173;&#x7684;&#x5B66;&#x79D1;&#x3002;</p>
</li>
</ol>
<p>Translation by Tom Morrison</p>
<p>&#x7FFB;&#x8BD1;&#xFF1A;Tom Morrison</p>
<p>[^1]: See Werner Heisenberg, Physik und Erkenntnis, Gesammelte Werke, vol. 3, Munich, 1985.<br>&#x89C1;Werner Heisenberg&#xFF0C;Physik und Erkenntnis&#xFF0C;Gesammelte Werke&#xFF0C;vol. 3&#xFF0C;&#x6155;&#x5C3C;&#x9ED1;&#xFF0C;1985<br>[^2]:Peter Weibel, &#xAB;The Unreasonable Effectiveness of the Methodological Convergence of Art and Science,&#xBB; in Art @ Science, Christa Sommerer/Laurent Mignonneau (eds), Vienna/New York, 1998, p. 170.<br>Peter Weibel&#xFF0C;&#x201C;&#x827A;&#x672F;&#x4E0E;&#x79D1;&#x5B66;&#x7684;&#x65B9;&#x6CD5;&#x8BBA;&#x878D;&#x5408;&#x7684;&#x4E0D;&#x5408;&#x7406;&#x6709;&#x6548;&#x6027;&#x201D;&#xFF0C;Art @ Science&#xFF0C;Christa Sommerer / Laurent Mignonneau&#xFF08;&#x7F16;&#x8F91;&#xFF09;&#xFF0C;&#x7EF4;&#x4E5F;&#x7EB3;/&#x7EBD;&#x7EA6;&#xFF0C;1998&#x5E74;&#xFF0C;170&#x3002;</p>
<p>[^3]: Peter Weibel, &#xAB;The Unreasonable Effectiveness of the Methodological Convergence of Art and Science,&#xBB; in Art @ Science, Christa Sommerer/Laurent Mignonneau (eds), Vienna/New York, 1998, p. 173.</p>
<p>[^4]: Peter Weibel, &#xAB;The Unreasonable Effectiveness of the Methodological Convergence of Art and Science,&#xBB; in Art @ Science, Christa Sommerer/Laurent Mignonneau (eds), Vienna/New York, 1998, p. 174.<br>[^5]: See Paul K. Feyerabend, Against Method, London, 1975.<br>[^6]: Jorge Wagensberg, &#xAB;Las reglas del juego,&#xBB; in Proceso al Azar, Jorge Wagensberg (ed.), Barcelona, 1986, p. 13.<br>[^7]: Ilya Prigogine, &#xAB;Enfrent&#xE1;ndose con lo irracional,&#xBB; in Proceso al Azar, Jorge Wagensberg (ed.), Barcelona, 1986, p. 158.<br>[^8]: See James Beniger, The Control Revolution. Technological and Economic Origins of the Information Society, Cambridge, 1986.<br>[^9]: See Jochen Schulte-Sasse, &#xAB;Von der schriftlichen zur elektronischen Kultur: &#xDC;ber neuere Wechselbeziehungen zwischen Mediengeschichte und Kulturgeschichte,&#xBB; in Materialit&#xE4;t der Kommunikation, Hans Ulrich Gumbrecht/Ludwig Pfeiffer (eds), Frankfurt/Main, 1988, pp. 429&#x2013;453.<br>[^10]: Jochen Schulte-Sasse, &#xAB;Von der schriftlichen zur elektronischen Kultur: &#xDC;ber neuere Wechselbeziehungen zwischen Mediengeschichte und Kulturgeschichte,&#xBB; in Materialit&#xE4;t der Kommunikation, Hans Ulrich Gumbrecht/Ludwig Pfeiffer (eds), Frankfurt/Main, 1988, p. 433.<br>[^11]: Norbert Wiener, The Human Use of Human Beings. Cybernetics and Society, Boston, 1950/1954, p. 16.<br>[^12]: Abbreviated as AI.<br>[^13]: The first computer running on a program was developed in 1941 by Konrad Zuse in Germany.<br>[^14]&#xFF1A; Norbert Wiener, The Human Use of Human Beings. Cybernetics and Society, Boston, 1950/1954.<br>[^15]: Norbert Wiener, The Human Use of Human Beings. Cybernetics and Society, Boston, 1950/1954, pp. 17&#x2013;18.<br>[^16]: Alan M. Turing, &#xAB;Computing Machinery and Intelligence&#xBB; (1950), in Mind, 59, pp. 433&#x2013;460.<br>[^17]: Alan M. Turing, &#xAB;Computing Machinery and Intelligence,&#xBB; in Mind, 59, pp. 433&#x2013; 460.<br>[^18]: Alan M. Turing, &#xAB;Computing Machinery and Intelligence,&#xBB; in Mind, 59, pp. 433&#x2013; 460.<br>[^19]: &#xAB;Discrete&#xBB; signifies numerical values that are separated by finite intervals and, breaking down into individual points, are countable. A discrete quantity has a defined number of possible values.<br>[^20]: Alan M. Turing, &#xAB;Computing Machinery and Intelligence,&#xBB; in Mind, 59, pp. 433&#x2013; 460.<br>[^21]: See Wulf R. Halbach, Interfaces: Medien- und kommunikationstheoretische Elemente einer Interface- Theorie, Munich, 1994, p. 143.<br>[^22]: Daughter of Lord Byron and assistant of Charles Babbage.<br>[^23]: See Ada A. Lovelace, &#xAB;Sketch of the Analytical Engine Invented by Charles Babbage,&#xBB; Geneva, 1842, reprinted in Philip and Emily Morrison, Charles Babbage and His Calculating Engines, New York, 1962, pp. 248&#x2013;249 and 284.<br>[^24]: See Alan M. Turing, &#xAB;Rechenmaschinen und Intelligenz&#xBB; in Intelligence Service &#x2014; Schriften, Berlin. 1987, p. 153. Alan M. Turing, &#xAB;Computing Machinery and Intelligence,&#xBB; in Mind, 59, pp. 433&#x2013; 460.<br>[^25]: Alan M. Turing, &#xAB;Computing Machinery and Intelligence,&#xBB; in Mind, 59, pp. 433&#x2013; 460.<br>[^26]: Alan M. Turing, &#xAB;Computing Machinery and Intelligence,&#xBB; in Mind, 59, pp. 433&#x2013; 460.<br>[^27]: See Margaret A. Boden (ed.), The Philosophy of Artificial Intelligence, Oxford, 1989/1990.<br>&#xA9; Media Art Net 2004</p>

    
    </div>
    
    
</article>




    
        <article class="article content gallery" itemscope="" itemprop="blogPost">
    <h1 class="article-title is-size-3 is-size-4-mobile" itemprop="name">
        
            <a href="/2018/11/08/MarkHansen/" itemprop="url">MarkHansen</a>
        
    </h1>
    <div class="article-meta columns is-variable is-1 is-multiline is-mobile is-size-7-mobile">
        <span class="column is-narrow">
            <time datetime="2018-11-07T17:43:45.000Z" itemprop="datePublished">11月 8 2018</time>
        </span>
        
        
        <span class="column is-narrow">
            
            
            12 分钟 读完 (约 1752 字)
        </span>
        
    </div>
    <div class="article-entry is-size-6-mobile" itemprop="articleBody">
    
        <h1 id="Markhansen"><a href="#Markhansen" class="headerlink" title="Markhansen"></a>Markhansen</h1><h1 id="Day-1"><a href="#Day-1" class="headerlink" title="Day 1"></a>Day 1</h1><p>comesfrom Germany<br>
Poststructuralism, America name for a movement in France from 1960-1970-80<br>A critical developments from structuralism</p>
<p>Claude Levi-Strauss</p>
<p><strong>structural linguistics</strong><br>&#x8BED;&#x8A00;&#x7ED3;&#x6784;&#x5B66;</p>
<p>Sign -&gt;signifer&#x80FD;&#x6307; -&gt;signify&#x6240;&#x6307;</p>
<h5 id="&#x540E;&#x7ED3;&#x6784;&#x4E3B;&#x4E49;"><a href="#&#x540E;&#x7ED3;&#x6784;&#x4E3B;&#x4E49;" class="headerlink" title="&#x540E;&#x7ED3;&#x6784;&#x4E3B;&#x4E49;"></a><strong>&#x540E;&#x7ED3;&#x6784;&#x4E3B;&#x4E49;</strong></h5><p>&#x8BED;&#x8A00;&#x7ED3;&#x6784;&#x5B66;-&#x5FB7;&#x91CC;&#x8FBE;Jacques Derrida<br>&#x7ED3;&#x6784;&#x5FC3;&#x7406;&#x5B66;-&#x62C9;&#x5EB7;Jacques Lacan<br>&#x540E;&#x7ED3;&#x6784;&#x4E3B;&#x4E49;-&#x798F;&#x67EF;Michel Foucault</p>
<pre><code>order of discource&#x8BDD;&#x8BED;&#x79E9;&#x5E8F;  </code></pre><p>&#x7F57;&#x5170;&#x5DF4;&#x7279;</p>
<p><strong>Hermeneutic</strong> -hermes &#x89E3;&#x91CA;&#x5B66;</p>
<p>&#x80FD;&#x6307;&#x4E0E;&#x6240;&#x6307;  &#x4E92;&#x76F8;&#x4F5C;&#x7528;<br>&#x80FD;&#x6307;&#x662F;&#x6240;&#x6307;&#x7684;&#x7269;&#x8D28;&#x652F;&#x6301;-&#x7ED3;&#x6784;&#x4E3B;&#x4E49;<br>meterial suport &#x662F;&#x4E0D;&#x5B58;&#x5728;&#x7684;  &#x2013;&#x5A92;&#x4ECB;&#x5B66;&#x5BB6;&#x7684;&#x8BBA;&#x8C03;</p>
<pre><code>&#x865A;&#x6784;&#x5C0F;&#x8BF4;&#x6240;&#x6784;&#x5EFA;&#x7684;&#x4E16;&#x754C;</code></pre><h5 id="M-H"><a href="#M-H" class="headerlink" title="M.H"></a>M.H</h5><p><strong><em>understanding Media</em></strong><br>Mcluhan &#x7684;&#x80A4;&#x6D45;-&#x7406;&#x8BBA;&#x4E4B;&#x4E0B;&#x6CA1;&#x6709;&#x5185;&#x5BB9;</p>
<blockquote>
<p>&#x8D21;&#x732E;&#xFF1A;&#x7535;&#x5B50;&#x5A92;&#x4ECB;&#x4E0E;&#x6A21;&#x62DF;&#x5A92;&#x4ECB;&#x7684;&#x8F6C;&#x53D8;&#x662F;&#x611F;&#x77E5;&#x7684;&#x8F6C;&#x53D8;</p>
<ol>
<li>&#x5BF9;&#x5A92;&#x4ECB;&#x7406;&#x8BBA;&#x7684;&#x603B;&#x7ED3;</li>
<li>&#x5177;&#x4F53;&#x4F8B;&#x5B50;-&#x70ED;&#x5A92;&#x4F53;&#x3001;&#x51B7;&#x5A92;&#x4F53;&#x7B49;&#x7B49;</li>
</ol>
</blockquote>
<p><strong><em>Guttenburg Galaxy</em></strong><br>&#x201C;&#x5370;&#x5237;&#x6280;&#x672F;&#x3001;&#x4E66;&#x5199;&#x5BF9;&#x4EBA;&#x6210;&#x4E3A;&#x5355;&#x4E00;&#x7684;&#x4E2A;&#x4F53;&#x7684;&#x8D21;&#x732E;&#x201D;</p>
<blockquote>
<p>&#x5171;&#x540C;&#x611F;&#x5B98;&#x4F53;&#x9A8C;&#x4E0E;&#x4E2A;&#x4EBA;&#x611F;&#x5B98;&#x4F60;&#x4F53;&#x9A8C;&#x2014;&#x2014;&#x5FAE;&#x4FE1;</p>
</blockquote>
<h5 id="M-H&#x7684;&#x8001;&#x5E08;"><a href="#M-H&#x7684;&#x8001;&#x5E08;" class="headerlink" title="M.H&#x7684;&#x8001;&#x5E08;"></a>M.H&#x7684;&#x8001;&#x5E08;</h5><p><strong><em>Bias of Communication</em></strong></p>
<ul>
<li>argued that different kinds of writing surfaces worked within and produced different kinds of empires.</li>
<li>&#x4E24;&#x79CD;&#x504F;&#x89C1;<ul>
<li><strong>Time bias</strong> &#x65F6;&#x95F4;&#x504F;&#x89C1;: -heavy, monumental &#x77F3;&#x7891;&#x7B49;&#x4E66;&#x5199;&#x754C;&#x9762;&#x2013;&#x4E2D;&#x592E;&#x96C6;&#x6743;&#x653F;&#x5E9C;</li>
<li><strong>Space bias</strong> : &#x8349;&#x7EB8;&#x7684;&#x4E66;&#x5199;&#x754C;&#x9762;  &#x975E;&#x4E2D;&#x592E;&#x96C6;&#x6743;</li>
</ul>
</li>
</ul>
<h5 id="Fridrich-Kittler"><a href="#Fridrich-Kittler" class="headerlink" title="Fridrich Kittler"></a>Fridrich Kittler</h5><p>background in Hermeneutic analyse of literature</p>
<ul>
<li><em>Discourse Network</em> 1800/1900 - analysis of literature in relation to technical system</li>
<li>1800Romantic poetry</li>
<li>1900 literature in ralation to..</li>
<li><em>Film, Gramophone,Typewriter</em> three kinds of analog mediatisation<ul>
<li>&#x5C06;&#x58F0;&#x97F3;&#x4E0E;&#x89C6;&#x89C9;&#x7684;&#x4F53;&#x9A8C;&#x8054;&#x7CFB;&#x8D77;&#x6765;</li>
<li>systematize  literature  <strong>Alphabetic Monopoly</strong><br>
<br>
#### Kittler&apos;s sources</li>
</ul>
</li>
<li>Foucault -Archoeology of Knowledge<ul>
<li>what&#x2019;s is said&#x2014;&#x2014;-&gt;enouciated</li>
<li>what&#x2019;s sayble? &#x2014;&#x2014;&gt;enouciation</li>
<li>&#x5728;&#x7279;&#x5B9A;&#x7684;&#x65F6;&#x7A7A;&#x4E2D;&#x90A3;&#x4E9B;&#x662F;&#x5DF2;&#x8BF4;&#x7684;&#xFF0C;&#x90A3;&#x4E9B;&#x662F;&#x80FD;&#x8BF4;&#x7684;  &#x4EA7;&#x51FA;&#x7684;&#x8BDD;&#x8BED;&#x6743;&#xFF1F;</li>
<li>&#x89C4;&#x5B9A;&#x7740;&#x6211;&#x4EEC;&#x8BF4;&#x8BDD;&#x7684;&#x6587;&#x5316;&#x6863;&#x6848;</li>
</ul>
</li>
<li>What&#x2019;s lacking here is a<ul>
<li>lacking&#xFF1A;&#x5A92;&#x4F53;&#x6280;&#x672F;&#x5BF9;&#x6587;&#x5316;&#x6863;&#x6848;&#x7684;&#x652F;&#x6301; meidia technology of suport</li>
<li>&#x5A92;&#x4ECB;&#x6280;&#x672F;&#x7684;&#x89C4;&#x5B9A;&#x6027;&#x4E0E;&#x754C;&#x5B9A;&#x6027;&#xFF1A;&#x5BF9;&#x4E8E;&#x2019;sayble&#x2019;  </li>
<li>technogical and meterial the suport of <strong>said</strong> or <strong>sayble</strong><h4 id="Key-theoretical-issues-in-media"><a href="#Key-theoretical-issues-in-media" class="headerlink" title="Key theoretical issues in media"></a>Key theoretical issues in media</h4></li>
</ul>
</li>
<li><strong>N.KatherineHayles</strong></li>
<li>Conflict between attention to material of the medium and to the meaning</li>
<li>Claude Shannon, methematical of Information Communications</li>
<li><img src="/2018/11/08/MarkHansen/WechatIMG355_k0lm9n4gl.jpeg">
<h4 id="Other-key-figures-in-history-of-media-study"><a href="#Other-key-figures-in-history-of-media-study" class="headerlink" title="Other key figures in history of media study"></a>Other key figures in history of media study</h4></li>
<li><em>&#x6211;&#x4EEC;&#x4F55;&#x4EE5;&#x6210;&#x4E3A;&#x540E;&#x4EBA;&#x7C7B;</em> &#x4FE1;&#x606F;&#x4E0D;&#x662F;material</li>
</ul>
<h4 id="German-versus-American-media-theroy"><a href="#German-versus-American-media-theroy" class="headerlink" title="German versus American media theroy"></a>German versus American media theroy</h4><ul>
<li>&#x5FB7;&#x56FD;&#x5728;&#x62E5;&#x62B1;&#x4E00;&#x79CD;&#x540E;&#x89E3;&#x91CA;&#x5B66;&#x7684;&#x7814;&#x7A76;&#x65B9;&#x6CD5; ex&#xFF1A;&#x57FA;&#x6797;&#x65AF;&#x57FA; &#x5A92;&#x4F53;&#x8003;&#x53E4;&#x5B66;<br>
<br>
#### Bernard Stigler</li>
<li>&#x6280;&#x672F;&#x7684;&#x8D77;&#x6E90;&#xFF1A;<img src="/2018/11/08/MarkHansen/IMG_20180604_121606_e7lh2vznm.jpg"></li>
<li>&#x4EBA;&#x4E0E;&#x6280;&#x672F;&#x7684;&#x5171;&#x5B58;&#x5173;&#x7CFB;</li>
<li><strong>Derrida</strong>  <strong>&#x4E66;&#x5199;</strong> &#x2013; <strong>&#x6280;&#x672F;</strong></li>
<li>&#x6BCF;&#x4E00;&#x79CD;&#x5A92;&#x4F53;&#x90FD;&#x662F;&#x6BD2;&#x836F;&#x540C;&#x65F6;&#x53C8;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x79CD;&#x89E3;&#x836F;<br>
<br>

</li>
</ul>
<h4 id="Mark-hansne&#x2019;s-work-within-meida-studies"><a href="#Mark-hansne&#x2019;s-work-within-meida-studies" class="headerlink" title="Mark hansne&#x2019;s work within meida studies"></a>Mark hansne&#x2019;s work within meida studies</h4><ul>
<li><p>Embodying technesis:Technology Beyond Writinig-focus on postcnostructural(Derrida, Lacan, Deleuze-Guattari)</p>
</li>
<li><p><em>New philosophy for New Media 2004</em></p>
<ul>
<li><p><strong>Borgson</strong></p>
<ul>
<li><p>perception as subception</p>
</li>
<li><p>indeterminism</p>
<p>  determinism&#x51B3;&#x5B9A;&#x8BBA;<a href="**&#x51B3;&#x5B9A;&#x8BBA;**&#xFF08;&#x53C8;&#x79F0;&#x62C9;&#x666E;&#x62C9;&#x65AF;&#x4FE1;&#x6761;&#xFF09;&#x662F;&#x4E00;&#x79CD;&#x8BA4;&#x4E3A;&#x81EA;&#x7136;&#x754C;&#x548C;&#x4EBA;&#x7C7B;&#x793E;&#x4F1A;&#x666E;&#x904D;&#x5B58;&#x5728;&#x5BA2;&#x89C2;&#x89C4;&#x5F8B;&#x548C;&#x56E0;&#x679C;&#x8054;&#x7CFB;&#x7684;&#x7406;&#x8BBA;&#x548C;&#x5B66;&#x8BF4;&#xFF0C;&#x5176;&#x4E0E;&#x975E;&#x51B3;&#x5B9A;&#x8BBA;&#x76F8;&#x5BF9;&#x3002;&#x5FC3;&#x7406;&#x5B66;&#x4E2D;&#x7684;&#x51B3;&#x5B9A;&#x8BBA;&#x8BA4;&#x4E3A;&#xFF0C;&#x4EBA;&#x7684;&#x4E00;&#x5207;&#x6D3B;&#x52A8;&#xFF0C;&#x90FD;&#x662F;&#x5148;&#x524D;&#x67D0;&#x79CD;&#x539F;&#x56E0;&#x548C;&#x51E0;&#x79CD;&#x539F;&#x56E0;&#x5BFC;&#x81F4;&#x7684;&#x7ED3;&#x679C;&#xFF0C;&#x4EBA;&#x7684;&#x884C;&#x4E3A;&#x662F;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x5148;&#x524D;&#x7684;&#x6761;&#x4EF6;&#x3001;&#x7ECF;&#x5386;&#x6765;&#x9884;&#x6D4B;&#x7684;&#x3002;">^1</a></p>
</li>
</ul>
</li>
</ul>
</li>
<li><p><em>Bodies in Code</em> 2006</p>
<ul>
<li>Fouces on Maurice</li>
</ul>
</li>
<li><p>argument</p>
</li>
<li><p><em>Feed forward</em> &#x63D0;&#x524D;&#x83B7;&#x53D6;</p>
<ul>
<li>&#x8BA1;&#x7B97;&#x673A;&#x79D1;&#x6280;&#x7684;&#x8BA1;&#x7B97;&#x901F;&#x5EA6;&#x8D8A;&#x6765;&#x8D8A;&#x5FEB;&#x4EE5;&#x81F3;&#x4E8E;&#x8D85;&#x8D8A;&#x4E86;&#x6211;&#x4EEC;&#x611F;&#x77E5;&#x8303;&#x56F4;&#x4EE5;&#x5916;</li>
<li><strong>data capitalism</strong> :&#x7531;&#x6211;&#x4EEC;&#x4EA7;&#x751F;&#x7684;&#x6570;&#x636E;&#x4E0D;&#x5C5E;&#x4E8E;&#x6211;&#x4EEC;</li>
</ul>
</li>
</ul>
<hr>
<ul>
<li><a href="https://read.douban.com/ebook/15846014/" rel="external nofollow noopener noreferrer" target="_blank"><em>&#x4F20;&#x64AD;&#x7684;&#x504F;&#x5411;</em> </a></li>
<li><a href="https://book.douban.com/subject/20492452/" rel="external nofollow noopener noreferrer" target="_blank"><em>&#x5E1D;&#x56FD;&#x4E0E;&#x4F20;&#x64AD;</em></a></li>
<li><a href="https://en.wikipedia.org/wiki/Macy_conferences" rel="external nofollow noopener noreferrer" target="_blank">&#x6885;&#x897F;&#x4F1A;&#x8BAE;</a></li>
<li>&#x63A7;&#x5236;&#x8BBA;</li>
</ul>
<hr>
<p>#Day3</p>
<ul>
<li><strong><em>Image</em></strong> (article)<ul>
<li>something about  Lev Manovich&#x2019; <strong><em>The Language of New Media</em></strong></li>
</ul>
</li>
<li>DN Rodowick <a href="http://www.hup.harvard.edu/catalog.php?isbn=9780674026988" rel="external nofollow noopener noreferrer" target="_blank"><em>Virtual life of Film</em></a></li>
</ul>
<h2 id="Kittler"><a href="#Kittler" class="headerlink" title="Kittler"></a>Kittler</h2><ul>
<li><strong><em>Grammophon Filme typewrite</em></strong></li>
<li>Kittler bold claim about digital media  <ul>
<li>michell:kittle is wrong</li>
<li>hansem:Kittler is right but not for the reason he think</li>
</ul>
</li>
</ul>
<p>alphabetic monopoly(no concept of medium)1800-1839&#x2014;&#x2014;-&gt;technical media diferentiation(1839&#x76F8;&#x673A;&#x2013;1850 &#x7559;&#x58F0;&#x673A;&#x2013;1890&#x7535;&#x5F71;)&#x2014;&#x2013;&gt;digital</p>
<pre class="mermaid">graph LR;
    a(alphabetic,<br>1800-1839)--&gt;e(&quot;technical <br>media&quot;);
    e--&gt;d(digital);</pre>


<ol>
<li>Key role of time/teaporrality</li>
<li>role of Foucault</li>
<li>shift from poetry to literature</li>
<li>Typewriter</li>
</ol>
<hr>
<h1 id="DAY4"><a href="#DAY4" class="headerlink" title="DAY4"></a>DAY4</h1><img src="/2018/11/08/MarkHansen/IMG_20180607_095323_i546zjkfa.jpg">

<p><strong>Jaffrey Shaw</strong></p>
<p><a href="https://vimeo.com/137858219" rel="external nofollow noopener noreferrer" target="_blank">vimeo&#x89C6;&#x9891;</a><br>1995&#x5E74;&#x5965;&#x5730;&#x5229;&#x6797;&#x8328;<br>&#x4F5C;&#x8005;&#xFF1A;Jeffrey Shaw<br>&#x8F6F;&#x4EF6;&#xFF1A;Adolf Matthias<br>&#x8BBE;&#x5907;&#xFF1A;Huib Nelissen<br>&#x5236;&#x4F5C;&#xFF1A;ZKM&#x827A;&#x672F;&#x4E0E;&#x5A92;&#x4F53;&#x4E2D;&#x5FC3;&#xFF0C;&#x5361;&#x5C14;&#x65AF;&#x9C81;&#x5384;[^2]</p>
<p>Primery retention<br>Secendery retention<br>terthery retention</p>
<ul>
<li>EVE expended virtual environment  </li>
</ul>
<hr>
<h1 id="Day5"><a href="#Day5" class="headerlink" title="Day5"></a>Day5</h1><p>##&#x897F;&#x8499;&#x4E1C;</p>
<p>####Induiduation &#x4E2A;&#x4F53;&#x5316;</p>
<ul>
<li><p>&#x5723;&#x8BDE;&#x8282;&#x54C8;&#x8428;&#x514B;<br>  &#x4FE1;&#x606F;&#x5B58;&#x5728;&#x4E0E;&#x4E2A;&#x4F53;&#x5316;&#x4E4B;&#x524D;</p>
</li>
<li><pre class="mermaid">graph LR

   a(information)--&gt;b(Processing--efect by media)
   b--&gt;c(human)</pre></li>
<li><p>media as mediation of human experience</p>
</li>
<li><p>media as a sort of the operationaty of the world</p>
</li>
</ul>
<p>&#x91CF;&#x5B50;&#x529B;&#x5B66;&#x5E76;&#x6CA1;&#x6709;&#x652F;&#x6301;&#x81EA;&#x7531;&#x610F;&#x5FD7;&#xFF0C;&#x53EA;&#x662F;&#x4E8E;&#x5FAE;&#x89C2;&#x4E16;&#x754C;&#x7269;&#x8D28;&#x5177;&#x6709;&#x6982;&#x7387;&#x6CE2;&#x7B49;&#x5B58;&#x5728;&#x4E0D;&#x786E;&#x5B9A;&#x6027;&#xFF0C;&#x4E0D;&#x8FC7;&#x5176;&#x4F9D;&#x7136;&#x5177;&#x6709;&#x7A33;&#x5B9A;&#x7684;&#x5BA2;&#x89C2;&#x89C4;&#x5F8B;&#xFF0C;&#x4E0D;&#x4EE5;&#x4EBA;&#x7684;&#x610F;&#x5FD7;&#x4E3A;&#x8F6C;&#x79FB;&#x3002;<br>[^2]:&#x8BE5;&#x88C5;&#x7F6E;&#x6709;&#x4E00;&#x4E2A;&#x76F4;&#x5F84;9&#x7C73;&#x7684;&#x5706;&#x67F1;&#x5F62;&#x6295;&#x5F71;&#x5C4F;&#x5E55;&#xFF0C;&#x4E2D;&#x592E;&#x6709;&#x4E00;&#x4E2A;&#x5706;&#x5F62;&#x7684;&#x673A;&#x52A8;&#x5E73;&#x53F0;&#xFF0C;&#x4E09;&#x53F0;&#x89C6;&#x9891;&#x6295;&#x5F71;&#x4EEA;&#x5C06;&#x56FE;&#x50CF;&#x4F20;&#x8F93;&#x5230;&#x5C4F;&#x5E55;&#x7684;120&#x5EA6;&#x90E8;&#x5206;&#x3002;&#x5728;&#x5C4F;&#x5E55;&#x5468;&#x56F4;&#x8FDE;&#x7EED;&#x65CB;&#x8F6C;&#x8FD9;&#x4E2A;&#x89C2;&#x5BDF;&#x7A97;&#x53E3;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x5B8C;&#x6574;&#x7684;360&#x5EA6;&#x8BA1;&#x7B97;&#x673A;&#x751F;&#x6210;&#x7684;&#x573A;&#x666F;&#x3002;&#x867D;&#x7136;&#x5DE5;&#x4F5C;&#x53D7;&#x5230;&#x63A7;&#x5236;&#xFF0C;&#x5E76;&#x4E14;&#x901A;&#x5E38;&#x4ECE;&#x5C4F;&#x5E55;&#x7684;&#x5706;&#x5468;&#x5185;&#x89C2;&#x770B;&#xFF0C;&#x8DEF;&#x4EBA;&#x4E5F;&#x53EF;&#x4EE5;&#x5728;&#x5176;&#x5916;&#x8868;&#x9762;&#x4E0A;&#x89C2;&#x770B;&#x6295;&#x5F71;&#x56FE;&#x50CF;&#x3002;<br><br>&#x8FD9;&#x9879;&#x5DE5;&#x4F5C;&#x4E2D;&#x7684;&#x7528;&#x6237;&#x754C;&#x9762;&#x662F;&#x4E00;&#x4E2A;&#x4FEE;&#x6539;&#x540E;&#x7684;&#x6444;&#x50CF;&#x673A;&#x3002;&#x901A;&#x8FC7;&#x65CB;&#x8F6C;&#x6B64;&#x76F8;&#x673A;&#x5E76;&#x4F7F;&#x7528;&#x5176;&#x7F29;&#x653E;&#x548C;&#x64AD;&#x653E;&#x6309;&#x94AE;&#xFF0C;&#x89C2;&#x770B;&#x8005;&#x53EF;&#x63A7;&#x5236;&#x5176;&#x5728;&#x865A;&#x62DF;&#x573A;&#x666F;&#x4E2D;&#x7684;&#x524D;&#x8FDB;&#xFF0C;&#x540E;&#x9000;&#x548C;&#x65CB;&#x8F6C;&#x8FD0;&#x52A8;&#xFF0C;&#x4EE5;&#x53CA;&#x5E73;&#x53F0;&#x548C;&#x6295;&#x5F71;&#x56FE;&#x50CF;&#x5728;&#x5706;&#x5F62;&#x5C4F;&#x5E55;&#x5468;&#x56F4;&#x7684;&#x65CB;&#x8F6C;&#x3002;&#x6295;&#x5F71;&#x7684;&#x666F;&#x89C2;&#x663E;&#x793A;&#x4E86;&#x4E00;&#x4E2A;&#x7535;&#x8111;&#x73AF;&#x5883;&#xFF0C;&#x6709;11&#x4E2A;&#x5706;&#x67F1;&#x4F53;&#xFF0C;&#x53EF;&#x4EE5;&#x5728;&#x4E0D;&#x540C;&#x5730;&#x70B9;&#x62CD;&#x6444;&#x5168;&#x666F;&#x98CE;&#x666F;&#x7167;&#x7247;&#xFF0C;&#x5305;&#x62EC;&#x6FB3;&#x5927;&#x5229;&#x4E9A;&#xFF0C;&#x65E5;&#x672C;&#xFF0C;&#x62C9;&#x5E15;&#x5C14;&#x9A6C;&#xFF0C;&#x5DF4;&#x5398;&#x5C9B;&#xFF0C;&#x6CD5;&#x56FD;&#x548C;&#x5FB7;&#x56FD;&#x3002;<br><br>&#x6BCF;&#x4E2A;&#x865A;&#x62DF;&#x5706;&#x67F1;&#x5177;&#x6709;&#x4E0E;&#x5B9E;&#x9645;&#x6295;&#x5F71;&#x5C4F;&#x5E55;&#x76F8;&#x540C;&#x7684;&#x9AD8;&#x5EA6;&#x548C;&#x76F4;&#x5F84;&#xFF0C;&#x4EE5;&#x4FBF;&#x5F53;&#x89C2;&#x770B;&#x8005;&#x4F4D;&#x4E8E;&#x5168;&#x666F;&#x56FE;&#x50CF;&#x7684;&#x4E2D;&#x5FC3;&#x65F6;&#xFF0C;&#x5B83;&#x586B;&#x5145;&#x5C4F;&#x5E55;&#x5E76;&#x7CBE;&#x786E;&#x91CD;&#x6784;&#x539F;&#x59CB;&#x7684;360&#x5EA6;&#x76F8;&#x673A;&#x89C6;&#x56FE;&#x3002;&#x901A;&#x8FC7;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#xFF0C;&#x827A;&#x672F;&#x54C1;&#x5C06;&#x5176;&#x5168;&#x666F;&#x56FE;&#x50CF;&#x653E;&#x7F6E;&#x5728;&#x4E00;&#x4E2A;&#x5EFA;&#x7B51;&#x6846;&#x67B6;&#x4E2D;&#xFF0C;&#x8BE5;&#x6846;&#x67B6;&#x5C06;&#x865A;&#x62DF;&#x666F;&#x89C2;&#x7684;&#x8BBE;&#x8BA1;&#x4E0E;&#x5B89;&#x88C5;&#x672C;&#x8EAB;&#x7684;&#x8BBE;&#x8BA1;&#x76F8;&#x5173;&#x8054;&#xFF0C;&#x4ECE;&#x800C;&#x4F7F;&#x865A;&#x62DF;&#x7A7A;&#x95F4;&#x548C;&#x5B9E;&#x9645;&#x7A7A;&#x95F4;&#x5728;&#x591A;&#x5C42;&#x6B21;&#x610F;&#x4E49;&#x4E0A;&#x5171;&#x540C;&#x6D3B;&#x52A8;&#x3002;<br><br>&#x8FD9;&#x4E9B;&#x5168;&#x666F;&#x5706;&#x67F1;&#x4F53;&#x653E;&#x7F6E;&#x5728;&#x5730;&#x9762;&#x4E0A;&#xFF0C;&#x6807;&#x6709;&#x5E0C;&#x4F2F;&#x5229;&#x2019;&#x751F;&#x547D;&#x4E4B;&#x6811;&#x2019;&#x56FE;&#x3002;&#x6BCF;&#x5E45;&#x5168;&#x666F;&#x7684;&#x4F4D;&#x7F6E;&#x5C06;&#x5176;&#x666F;&#x89C2;&#x7684;&#x89C6;&#x89C9;&#x7279;&#x5F81;&#x4E0E;&#x5176;&#x5728;&#x56FE;&#x4E2D;&#x7684;&#x7B26;&#x53F7;&#x4F4D;&#x7F6E;&#x7684;&#x5185;&#x6DB5;&#x8054;&#x7CFB;&#x8D77;&#x6765;&#x3002;&#x76F8;&#x673A;&#x754C;&#x9762;&#x4E0A;&#x7684;&#x53D6;&#x666F;&#x5668;&#x663E;&#x793A;&#x4E86;&#x8BE5;&#x56FE;&#x7684;&#x4E00;&#x5E45;&#x9E1F;&#x77B0;&#x56FE;&#xFF0C;&#x8BE5;&#x56FE;&#x4EE5;&#x89C2;&#x770B;&#x8005;&#x5728;&#x666F;&#x89C2;&#x4E2D;&#x7684;&#x5B9E;&#x9645;&#x4F4D;&#x7F6E;&#x52A8;&#x6001;&#x5C45;&#x4E2D;&#x3002;<br><br>&#x76F8;&#x673A;&#x63A5;&#x53E3;&#x9876;&#x90E8;&#x7684;&#x9EA6;&#x514B;&#x98CE;&#x53EF;&#x62FE;&#x53D6;&#x89C2;&#x770B;&#x8005;&#x5236;&#x4F5C;&#x7684;&#x4EFB;&#x4F55;&#x58F0;&#x97F3;&#xFF0C;&#x5E76;&#x63A7;&#x5236;&#x6295;&#x5F71;&#x573A;&#x666F;&#x4E2D;&#x6EDA;&#x52A8;&#x7684;&#x4E09;&#x7EF4;&#x6587;&#x5B57;&#x7684;&#x91CA;&#x653E;&#x3002;&#x4ECE;&#x5404;&#x79CD;&#x6765;&#x6E90;&#x5F15;&#x7528;&#xFF0C;&#x8FD9;&#x4E9B;&#x6587;&#x672C;&#x63D0;&#x4F9B;&#x4E86;&#x5173;&#x4E8E;&#x5730;&#x70B9;&#x548C;&#x8BED;&#x8A00;&#x95EE;&#x9898;&#x7684;&#x8BA8;&#x8BBA;&#x3002;&#x867D;&#x7136;&#x5B57;&#x6BCD;&#x8D77;&#x6E90;&#x4E8E;&#x5C4F;&#x5E55;&#x4E2D;&#x5FC3;&#xFF0C;&#x4F46;&#x662F;&#x89C2;&#x770B;&#x8005;&#x7684;&#x8FD0;&#x52A8;&#x5728;&#x7EC4;&#x6210;&#x4E0A;&#x51B3;&#x5B9A;&#x4E86;&#x4ED6;&#x4EEC;&#x5728;&#x865A;&#x62DF;&#x7A7A;&#x95F4;&#x4E2D;&#x7684;&#x7269;&#x7406;&#x6392;&#x5217;&#x3002;&#x5F62;&#x6210;&#x6BCF;&#x4E2A;&#x89C2;&#x4F17;&#x5728;&#x8FD9;&#x90E8;&#x4F5C;&#x54C1;&#x4E2D;&#x51FA;&#x73B0;&#x7684;&#x53D9;&#x8FF0;&#x548C;&#x7A7A;&#x95F4;&#x75D5;&#x8FF9;&#xFF0C;&#x4ED6;&#x4EEC;&#x751F;&#x6210;&#x7684;&#x5B57;&#x6BCD;&#x5728;&#x51E0;&#x5206;&#x949F;&#x540E;&#x53D8;&#x5F97;&#x8D8A;&#x6765;&#x8D8A;&#x900F;&#x660E;&#xFF0C;&#x76F4;&#x5230;&#x5B83;&#x4EEC;&#x6D88;&#x5931;&#x3002;</p>

    
    </div>
    
    
</article>




    
        <article class="article content gallery" itemscope="" itemprop="blogPost">
    <h1 class="article-title is-size-3 is-size-4-mobile" itemprop="name">
        
            <a href="/2018/11/02/landscape/" itemprop="url">银灰色的风景</a>
        
    </h1>
    <div class="article-meta columns is-variable is-1 is-multiline is-mobile is-size-7-mobile">
        <span class="column is-narrow">
            <time datetime="2018-11-01T16:02:37.000Z" itemprop="datePublished">11月 2 2018</time>
        </span>
        
        <span class="column is-narrow article-category">
            <i class="far fa-folder"></i>
            <a class="article-category-link" href="/categories/未分类/">未分类</a>
        </span>
        
        
        <span class="column is-narrow">
            
            
            几秒 读完 (约 13 字)
        </span>
        
    </div>
    <div class="article-entry is-size-6-mobile" itemprop="articleBody">
    
        <p><img src="https://upload-images.jianshu.io/upload_images/11111607-f2b16883283bc61c.jpg" alt=""></p>
        <p class="article-more-link">
            <a href="/2018/11/02/landscape/#more">阅读更多</a>
        </p>
    
    </div>
    
    
</article>




    
        <article class="article content gallery" itemscope="" itemprop="blogPost">
    <h1 class="article-title is-size-3 is-size-4-mobile" itemprop="name">
        
            <a href="/2018/05/10/Zielinski/" itemprop="url">prospective archeology展望式考古学 -Zielinski</a>
        
    </h1>
    <div class="article-meta columns is-variable is-1 is-multiline is-mobile is-size-7-mobile">
        <span class="column is-narrow">
            <time datetime="2018-05-09T16:25:33.000Z" itemprop="datePublished">5月 10 2018</time>
        </span>
        
        
        <span class="column is-narrow">
            
            
            14 分钟 读完 (约 2063 字)
        </span>
        
    </div>
    <div class="article-entry is-size-6-mobile" itemprop="articleBody">
    
        <p><img src="https://egs.edu/faculty/_facultyHeader/Siegfried-Zielinski-2018.jpg" alt="Sigfried Zielinski"></p>
        <p class="article-more-link">
            <a href="/2018/05/10/Zielinski/#more">阅读更多</a>
        </p>
    
    </div>
    
    
</article>




    
    
        
<nav class="pagination is-centered is-rounded" role="navigation" aria-label="pagination">
    <div class="pagination-previous">
        <a href="/page/2/">上一页</a>
    </div>
    <div class="pagination-next is-invisible is-hidden-mobile">
        <a href="/page/4/">下一页</a>
    </div>
    <ul class="pagination-list is-hidden-mobile">
        
        <li><a class="pagination-link" href="/">1</a></li>
        
        <li><a class="pagination-link" href="/page/2/">2</a></li>
        
        <li><a class="pagination-link is-current" href="/page/3/">3</a></li>
        
    </ul>
</nav>
    
    </div>
</section>
    <footer class="footer">
    <div class="container">
        <div class="columns content">
            <div class="column is-narrow has-text-centered">
                &copy; 2019 liudixian&nbsp;
                Powered by <a href="http://hexo.io/" target="_blank" rel="external nofollow noopener noreferrer">Hexo</a> & <a href="http://github.com/ppoffice/hexo-theme-minos" rel="external nofollow noopener noreferrer" target="_blank">Minos</a>
            </div>
            <div class="column is-hidden-mobile"></div>

            
            <div class="column is-narrow">
                <div class="columns is-mobile is-multiline is-centered">
                
                    
                <a class="column is-narrow has-text-black" title="GitHub" href="https://github.com/ppoffice/hexo-theme-minos" rel="external nofollow noopener noreferrer" target="_blank">
                    
                    GitHub
                    
                </a>
                
                </div>
            </div>
            
            
<div class="column is-narrow has-text-centered">
    <div class="dropdown is-up is-right is-hoverable" style="margin-top: -0.2em;">
        <div class="dropdown-trigger">
            <button class="button is-small" aria-haspopup="true" aria-controls="dropdown-menu7">
                <span class="icon">
                    <i class="fas fa-globe"></i>
                </span>
                <span>简体中文</span>
                <span class="icon is-small">
            <i class="fas fa-angle-down" aria-hidden="true"></i>
          </span>
            </button>
        </div>
        <div class="dropdown-menu has-text-left" role="menu">
            <div class="dropdown-content">
            
                <a href="/page/3/index.html" class="dropdown-item">
                    简体中文
                </a>
            
                <a href="/en/page/3/index.html" class="dropdown-item">
                    English
                </a>
            
            </div>
        </div>
    </div>
</div>

        </div>
    </div>
</footer>
    <script src="//cdnjs.cloudflare.com/ajax/libs/jquery/3.3.1/jquery.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/moment.js/2.22.2/moment-with-locales.min.js"></script>

<!-- test if the browser is outdated -->
<div id="outdated">
    <h6>Your browser is out-of-date!</h6>
    <p>Update your browser to view this website correctly. <a id="btnUpdateBrowser" href="http://outdatedbrowser.com/" rel="external nofollow noopener noreferrer" target="_blank">Update my browser now </a></p>
    <p class="last"><a href="#" id="btnCloseUpdateBrowser" title="Close">&times;</a></p>
</div>
<script src="//cdnjs.cloudflare.com/ajax/libs/outdated-browser/1.1.5/outdatedbrowser.min.js"></script>
<script>
    $(document).ready(function () {
        // plugin function, place inside DOM ready function
        outdatedBrowser({
            bgColor: '#f25648',
            color: '#ffffff',
            lowerThan: 'flex'
        })
    });
</script>

<script>
    window.FontAwesomeConfig = {
        searchPseudoElements: true
    }
    moment.locale("zh-CN");
</script>


    
    
<script src="https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.4/MathJax.js?config=TeX-MML-AM_CHTML"></script>
<script>
    MathJax.Hub.Config({
        "HTML-CSS": {
            matchFontHeight: false
        },
        SVG: {
            matchFontHeight: false
        },
        CommonHTML: {
            matchFontHeight: false
        },
        tex2jax: {
            inlineMath: [
                ['$','$'],
                ['\\(','\\)']
            ]
        }
    });
</script>

    
    
    
    
<script src="//cdnjs.cloudflare.com/ajax/libs/lightgallery/1.6.8/js/lightgallery-all.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/justifiedGallery/3.6.5/js/jquery.justifiedGallery.min.js"></script>
<script>
    (function ($) {
        $(document).ready(function () {
            if (typeof($.fn.lightGallery) === 'function') {
                $('.article.gallery').lightGallery({ selector: '.gallery-item' });
            }
            if (typeof($.fn.justifiedGallery) === 'function') {
                $('.justified-gallery').justifiedGallery();
            }
        });
    })(jQuery);
</script>

    
    
    <script src="https://cdnjs.cloudflare.com/ajax/libs/clipboard.js/2.0.0/clipboard.min.js"></script>
    <style>
        .hljs {
            position: relative;
        }

        .hljs .clipboard-btn {
            float: right;
            color: #9a9a9a;
            background: none;
            border: none;
            cursor: pointer;
        }

        .hljs .clipboard-btn:hover {
          color: #8a8a8a;
        }

        .hljs > .clipboard-btn {
            display: none;
            position: absolute;
            right: 4px;
            top: 4px;
        }

        .hljs:hover > .clipboard-btn {
            display: inline;
        }

        .hljs > figcaption > .clipboard-btn {
            margin-right: 4px;
        }
    </style>
    <script>
      $(document).ready(function () {
        $('figure.hljs').each(function(i, figure) {
          var codeId = 'code-' + i;
          var code = figure.querySelector('.code');
          var copyButton = $('<button>Copy <i class="far fa-clipboard"></i></button>');
          code.id = codeId;
          copyButton.addClass('clipboard-btn');
          copyButton.attr('data-clipboard-target-id', codeId);

          var figcaption = figure.querySelector('figcaption');

          if (figcaption) {
            figcaption.append(copyButton[0]);
          } else {
            figure.prepend(copyButton[0]);
          }
        })

        var clipboard = new ClipboardJS('.clipboard-btn', {
          target: function(trigger) {
            return document.getElementById(trigger.getAttribute('data-clipboard-target-id'));
          }
        });
        clipboard.on('success', function(e) {
          e.clearSelection();
        })
      })
    </script>

    
    

    


<script src="/js/script.js"></script>

    
    <div class="searchbox ins-search">
    <div class="searchbox-mask"></div>
    <div class="searchbox-container ins-search-container">
        <div class="searchbox-input-wrapper">
            <input type="text" class="searchbox-input ins-search-input" placeholder="站内搜索">
            <span class="searchbox-close ins-close ins-selectable"><i class="fa fa-times-circle"></i></span>
        </div>
        <div class="searchbox-result-wrapper ins-section-wrapper">
            <div class="ins-section-container"></div>
        </div>
    </div>
</div>
<script>
    (function (window) {
        var INSIGHT_CONFIG = {
            TRANSLATION: {
                POSTS: '文章',
                PAGES: '页面',
                CATEGORIES: '分类',
                TAGS: '标签',
                UNTITLED: '(无标题)',
            },
            CONTENT_URL: '/content.json',
        };
        window.INSIGHT_CONFIG = INSIGHT_CONFIG;
    })(window);
</script>
<script src="/js/insight.js"></script>
    
</body>
</html>