<!DOCTYPE html>
<html class="has-navbar-fixed-top">
<head><meta name="generator" content="Hexo 3.8.0">
    <meta charset="utf-8">
<title>虚构的生态学 - 刘迪先</title>
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">

<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/outdated-browser/1.1.5/outdatedbrowser.min.css">


<link href="/en/2018/11/15/虚构的生态学/" rel="alternate" hreflang="en">
    




<meta name="keywords" content="media art and theory">



    <meta name="description" content="&amp;#x8D44;&amp;#x6E90;&amp;#x7D27;&amp;#x7F3A;&amp;#x7684;&amp;#x81EA;&amp;#x7136;&amp;#x8D44;&amp;#x6E90;&amp;#x73B0;&amp;#x5B9E;&amp;#x539F;&amp;#x6807;&amp;#x9898;&amp;#xFF1A;A Fictive Ecology: Natural resource for reource-heavy realities   Eschewing norm">
<meta name="keywords" content="ever Elusive">
<meta property="og:type" content="article">
<meta property="og:title" content="虚构的生态学">
<meta property="og:url" content="http://liudixian.github.io/2018/11/15/虚构的生态学/index.html">
<meta property="og:site_name" content="刘迪先">
<meta property="og:description" content="&amp;#x8D44;&amp;#x6E90;&amp;#x7D27;&amp;#x7F3A;&amp;#x7684;&amp;#x81EA;&amp;#x7136;&amp;#x8D44;&amp;#x6E90;&amp;#x73B0;&amp;#x5B9E;&amp;#x539F;&amp;#x6807;&amp;#x9898;&amp;#xFF1A;A Fictive Ecology: Natural resource for reource-heavy realities   Eschewing norm">
<meta property="og:locale" content="zh-cn">
<meta property="og:updated_time" content="2019-06-04T13:14:43.040Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="虚构的生态学">
<meta name="twitter:description" content="&amp;#x8D44;&amp;#x6E90;&amp;#x7D27;&amp;#x7F3A;&amp;#x7684;&amp;#x81EA;&amp;#x7136;&amp;#x8D44;&amp;#x6E90;&amp;#x73B0;&amp;#x5B9E;&amp;#x539F;&amp;#x6807;&amp;#x9898;&amp;#xFF1A;A Fictive Ecology: Natural resource for reource-heavy realities   Eschewing norm">





<link rel="icon" href="/favicon.png">


<link rel="stylesheet" href="//fonts.googleapis.com/css?family=Ovo|Source+Code+Pro">
<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/bulma/0.6.2/css/bulma.min.css">


<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/lightgallery/1.6.8/css/lightgallery.min.css">
<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/justifiedGallery/3.6.5/css/justifiedGallery.min.css">


<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/highlight.js/9.12.0/styles/atom-one-light.min.css">

<link rel="stylesheet" href="/css/style.css">

<script defer src="//use.fontawesome.com/releases/v5.0.8/js/all.js"></script>


    
    
    
    
    
    
    
    
    
    

    


</head>
<body>
    
<nav class="navbar is-transparent is-fixed-top navbar-main" role="navigation" aria-label="main navigation">
    <div class="container">
        <div class="navbar-brand">
            <a class="navbar-item navbar-logo" href="/">
                
                <img src="/images/logo.png" alt="" height="28">
                
            </a>
            <div class="navbar-burger">
                <span></span>
                <span></span>
                <span></span>
            </div>
        </div>
        
        <div class="navbar-menu navbar-start">
            
            <a class="navbar-item " href="/archives">Archives</a>
            
            <a class="navbar-item " href="/categories/媒介理论">Media Theory</a>
            
            <a class="navbar-item " href="/categories/works">Works</a>
            
            <a class="navbar-item " href="/categories/技术">Technology</a>
            
            <a class="navbar-item " href="/categories/coding">Coding</a>
            
            <a class="navbar-item " href="/about">About</a>
            
        </div>
        
        <div class="navbar-menu navbar-end">
            
            <a class="navbar-item search" title="搜索" href="javascript:;">
                <i class="fas fa-search"></i>
            </a>
            
            
            
            <a class="navbar-item" title="GitHub" href="https://github.com/ppoffice/hexo-theme-minos" rel="external nofollow noopener noreferrer" target="_blank">
                
                <i class="fab fa-github"></i>
                
            </a>
               
            
        </div>
    </div>
</nav>

    <section class="section">
    <div class="container">
    <article class="article content gallery" itemscope="" itemprop="blogPost">
    <h1 class="article-title is-size-3 is-size-4-mobile" itemprop="name">
        
            虚构的生态学
        
    </h1>
    <div class="article-meta columns is-variable is-1 is-multiline is-mobile is-size-7-mobile">
        <span class="column is-narrow">
            <time datetime="2018-11-15T01:10:28.000Z" itemprop="datePublished">11月 15 2018</time>
        </span>
        
        
        <span class="column is-narrow">
            
            
            13 分钟 读完 (约 2010 字)
        </span>
        
    </div>
    <div class="article-entry is-size-6-mobile" itemprop="articleBody">
    
        <h5 id="&#x8D44;&#x6E90;&#x7D27;&#x7F3A;&#x7684;&#x81EA;&#x7136;&#x8D44;&#x6E90;&#x73B0;&#x5B9E;"><a href="#&#x8D44;&#x6E90;&#x7D27;&#x7F3A;&#x7684;&#x81EA;&#x7136;&#x8D44;&#x6E90;&#x73B0;&#x5B9E;" class="headerlink" title="&#x8D44;&#x6E90;&#x7D27;&#x7F3A;&#x7684;&#x81EA;&#x7136;&#x8D44;&#x6E90;&#x73B0;&#x5B9E;"></a>&#x8D44;&#x6E90;&#x7D27;&#x7F3A;&#x7684;&#x81EA;&#x7136;&#x8D44;&#x6E90;&#x73B0;&#x5B9E;</h5><p>&#x539F;&#x6807;&#x9898;&#xFF1A;<strong><em>A Fictive Ecology: Natural resource for reource-heavy realities</em></strong></p>
<br>

<p>Eschewing normative definitions pertaining to the bionomics of technology, <em>Ecologies excursion</em> participants select and define key materials with which to construct a new ecology.</p>
<p>&#x907F;&#x514D;&#x4E0E;&#x6280;&#x672F;&#x751F;&#x7269;&#x5B66;&#x6709;&#x5173;&#x7684;&#x89C4;&#x8303;&#x6027;&#x5B9A;&#x4E49;&#xFF0C;<em>&#x751F;&#x6001;&#x6E38;&#x89C8;</em> &#x53C2;&#x4E0E;&#x8005;&#x9009;&#x62E9;&#x548C;&#x5B9A;&#x4E49;&#x6784;&#x5EFA;&#x65B0;&#x751F;&#x6001;&#x5B66;&#x7684;&#x5173;&#x952E;&#x6750;&#x6599;&#x3002;</p>
<a id="more"></a>


<p><strong>Stone - Jonathan Kemp&#xFF08;&#x79FB;&#x4F4D;&#x5BC4;&#x5B58;&#x5668;&#x5C0F;&#x7EC4;)</strong><br>&#x77F3;&#x5934;&#x4E0D;&#x4EC5;&#x8BB0;&#x5F55;&#x4E86;&#x5730;&#x7403;&#x4E0A;&#x7684;&#x7EC4;&#x6210;&#x90E8;&#x5206;&#x7684;&#x76F8;&#x4E92;&#x4F5C;&#x7528;&#xFF0C;&#x800C;&#x4E14;&#x8FD8;&#x8BB0;&#x5F55;&#x4E86;&#x8FD9;&#x4E2A;&#x5212;&#x65F6;&#x4EE3;&#x7684;&#x5730;&#x7403; - &#x5B9E;&#x9A8C;&#x5BA4;&#x7684;&#x8FD0;&#x4F5C;&#x65B9;&#x5F0F;&#x3002; Stone&#x8BB0;&#x5F55;&#x4E86;&#x8FC7;&#x53BB;&#x548C;&#x73B0;&#x5728;&#x7684;&#x73AF;&#x5883;&#xFF0C;&#x9884;&#x6D4B;&#x4E86;&#x672A;&#x6765;&#x7684;&#x73AF;&#x5883;&#xFF08;&#x5730;&#x7403;&#x4F5C;&#x4E3A;&#x5A92;&#x4F53;&#xFF09;&#xFF0C;&#x5B83;&#x7684;aeonic&#x5386;&#x53F2;&#x901A;&#x8FC7;&#x4E0E;&#x4EBA;&#x7C7B;&#x7684;&#x76F8;&#x4E92;&#x4F5C;&#x7528;&#x5448;&#x6307;&#x6570;&#x5730;&#x53D8;&#x5316;&#xFF0C;&#x5B83;&#x5177;&#x6709;&#x957F;&#x671F;&#x8BB0;&#x5FC6;&#xFF0C;&#x5177;&#x6709;&#x53CD;&#x6620;&#x683C;&#x5F0F;&#x5316;&#xFF0C;&#x66B4;&#x9732;&#x4E8E;&#x5730;&#x7403;&#x8868;&#x9762;&#x548C;&#x975E;&#x7EBF;&#x6027;&#x53E0;&#x52A0;&#x7684;&#x5E94;&#x529B;&#x5386;&#x53F2; &#x901A;&#x8FC7;&#x8870;&#x53D8;&#x548C;&#x4EBA;&#x7C7B;&#x5265;&#x524A;&#x7684;&#x53D8;&#x5316;&#xFF0C;&#x8FD9;&#x79CD;&#x7EA0;&#x7F20; - &#x5730;&#x8D28;&#x5B66;&#xFF0C;&#x5730;&#x8C8C;&#x5B66;&#x548C;&#x6587;&#x660E;&#x90FD;&#x91CD;&#x53E0; - &#x4F7F;&#x77F3;&#x5934;&#x6210;&#x4E3A;&#x81EA;&#x5DF1;&#x7684;&#x75C5;&#x7406;&#x8BB0;&#x5F55;&#x5668;&#xFF0C;&#x4F46;&#x5176;&#x4E2D;&#x7B49;&#x540C;&#x6027;&#x6807;&#x5FD7;&#x7740;&#x9605;&#x8BFB;&#x77F3;&#x5934;&#x4E66;&#x5199;&#x7684;&#x56F0;&#x96BE;&#x3002;</p>
<p><strong>&#x5806;&#x80A5; - Shu Lea Cheang&#xFF08;&#x83CC;&#x4E1D;&#x7F51;&#x7EDC;&#x534F;&#x4F1A;&#xFF09;</strong><br>&#x5806;&#x80A5;&#x4F5C;&#x4E3A;&#x4E00;&#x79CD;&#x884C;&#x4E3A;&#xFF0C;&#x4E00;&#x4E2A;&#x6F14;&#x5458;&#xFF0C;&#x884C;&#x52A8;&#xFF0C;&#x6D3B;&#x8DC3;&#x3002; &#x5806;&#x80A5;&#xFF0C;&#x5982;&#x52A0;&#x5DE5;&#xFF0C;&#x8150;&#x70C2;&#xFF0C;&#x6210;&#x719F;&#x3002; &#x5B83;&#x5DE5;&#x4F5C;&#x548C;&#x91CD;&#x65B0;&#x8BBE;&#x8BA1;&#x5176;&#x4E0B;&#x9762;&#x7684;&#x591A;&#x4E2A;&#x81EA;&#x6211;&#xFF0C;&#x6A21;&#x7CCA;&#x5206;&#x88C2;&#xFF0C;&#x9A6F;&#x670D;&#x9057;&#x5FD8;&#x3002; &#x5F04;&#x810F;&#x4F60;&#x7684;&#x624B;&#xFF0C;&#x628A;&#x4F60;&#x7684;&#x88E4;&#x5B50;&#x653E;&#x4E0B;&#x6765;&#xFF0C;&#x5C0F;&#x4FBF;&#xFF0C;&#x5C0F;&#x4FBF;&#xFF0C;&#x55C5;&#x95FB;&#xFF0C;&#x55C5;&#x95FB;&#xFF0C;&#x4E0D;&#x8981;&#x627C;&#x6740;&#x5B83;&#x3002; &#x5806;&#x80A5;&#x4F5C;&#x4E3A;&#x51CC;&#x4E71;&#x7684;&#x788E;&#x7247; - &#x5728;&#x5E74;&#x5E95;&#x8150;&#x70C2;&#x7684;&#x6C89;&#x95F7;&#x611F;&#x89C9;&#xFF0C;&#x53D1;&#x9175;&#x7684;&#x795E;&#x5FD7;&#x4E0D;&#x6E05;&#x7684;&#x4E0A;&#x5347;&#xFF0C;&#x4EE4;&#x4EBA;&#x9676;&#x9189;&#x7684;&#x6DFB;&#x52A0;&#x5242;&#x9AD8;&#x3002; &#x5806;&#x80A5;&#x6CE8;&#x91CA;&#xFF0C;&#x5806;&#x80A5;&#x590D;&#x5408;&#xFF0C;&#x5806;&#x80A5;&#x6210;&#x578B;&#x3002; &#x79CD;&#x5B50;&#x57CB;&#x5728;&#x8C46;&#x82BD;&#x4E0B;&#xFF0C;&#x6084;&#x6084;&#x5730;&#x51B2;&#x5230;&#x73B0;&#x573A;&#xFF0C;&#x4EE4;&#x4EBA;&#x4FE1;&#x670D;&#x5730;&#x5BA3;&#x5E03;&#x81EA;&#x5DF1;&#x7684;&#x5230;&#x6765;&#x3002; &#x7531;&#x53CB;&#x597D;&#x7684;&#x6DF7;&#x5408;&#xFF0C;&#x5806;&#x80A5;&#x6C38;&#x8FDC;&#x4E0D;&#x4F1A;&#x6B7B;&#x3002;</p>
<p><strong>&#x9517; - &#x6770;&#x7C73;&#x827E;&#x4F26;&#xFF08;&#x79FB;&#x4F4D;&#x5BC4;&#x5B58;&#x5668;&#xFF09;</strong><br>&#x5730;&#x7403;&#x4E0A;&#x4E30;&#x5BCC;&#x7684;&#x7845;&#x662F;&#x884C;&#x661F;&#x51DD;&#x805A;&#x7684;&#x5076;&#x7136;&#x7ED3;&#x679C;&#xFF0C;&#x662F;&#x5B87;&#x5B99;&#x4E73;&#x6DB2;&#x7684;&#x9009;&#x62E9;&#x6027;&#x79BB;&#x5FC3;&#x805A;&#x7ED3;&#x3002; &#x65E9;&#x671F;&#x7684;&#x7535;&#x5B50;&#x7814;&#x7A76;&#x4EBA;&#x5458;&#x9996;&#x9009;&#x9517;&#xFF0C;&#x66F4;&#x96BE;&#x63D0;&#x53D6;&#x548C;&#x7A00;&#x7F3A;&#xFF08;&#x5373;&#x6602;&#x8D35;&#xFF09;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x5141;&#x8BB8;&#x66F4;&#x5FEB;&#x7684;&#x5207;&#x6362;&#x548C;&#x66F4;&#x4F4E;&#x7684;&#x7535;&#x538B;&#x9608;&#x503C;&#xFF0C;&#x964D;&#x4F4E;&#x80FD;&#x8017;&#x548C;&#x7535;&#x8DEF;&#x5C3A;&#x5BF8;&#x3002; &#x6761;&#x987F;&#x4EBA;&#x5143;&#x7D20;&#x88AB;&#x7528;&#x4E8E;&#x8096;&#x514B;&#x5229;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x534A;&#x4F20;&#x5BFC;&#x6F14;&#x793A;&#xFF0C;&#x5E76;&#x4E14;&#x5B83;&#x5DF2;&#x7ECF;&#x6210;&#x4E3A;&#x201C;&#x4FE1;&#x606F;&#x7ECF;&#x6D4E;&#x201D;&#x7684;&#x57FA;&#x7840;&#xFF0C;&#x5728;&#x9521;&#x6797;&#x6D69;&#x7279;&#x548C;&#x8BFA;&#x6851;&#x6BD4;&#x4E9A;&#x7B49;&#x5730;&#x533A;&#x7684;&#x9AD8;&#x7B49;&#x7EA7;&#x77FF;&#x5E8A;&#x5C06;&#x6210;&#x4E3A;&#x9774;&#x5B50;&#x3002;&#x5DE5;&#x7A0B;&#x5E08;&#x6B63;&#x5728;&#x91CD;&#x65B0;&#x5BA1;&#x89C6;Ge&#x4F5C;&#x4E3A;&#x7C89;&#x788E;&#x7684;&#x65B9;&#x5F0F;&#x3002; &#x7845;&#x8BA1;&#x7B97;&#x7684;&#x73BB;&#x7483;&#x5929;&#x82B1;&#x677F;&#xFF0C;&#x6253;&#x7834;&#x4E86;&#x6469;&#x5C14;&#x7684;&#x529D;&#x963B;&#x89C4;&#x5F8B;&#x3002;</p>
<p><strong>Stone - Jonathan Kemp(Shift Register)</strong><br>Stone register not only the interplay of earth-on-earth components, but also the workings of this epochal earth-sacle-laboratory. Stone records past and present environments, premediates future ones(earth as media), and its aeonic history exponentially shifts through its interactions whith humans, It has a long memory with stress histories that reflect formatation, exposure on the earth&#x2019;s surface, and the nonlinear superimposition of change through decay and human exploitation, Such an entanglement-where geology, geomorphology and civilization all overlap-makes stone its own pathological recorder, but one where equifinality marks the diffculty in reading the writing of the stones.</p>
<p><strong>Compost - Shu Lea Cheang(Mycelium Network Society)</strong><br>Compost as an act, an actor, action, active. Compost as in processing, decaying,maturing. It works and reworks its multiple selves disposed under, blurs the divides, tames the oblivion. Get your hands dirty, your trousers down, piss on it, piss in it, smell it, sniff it, just don&#x2019;t stifle it. Compost as messy mettters&#x2013;that rotten sunken feeling at year end, that fermenting delirious rising, that intoxicating additive high. Compost annotated, compost composite, compost ferformative. Seeds buried under bean sprouts, bursting assertively onto the scene, convincingly annouceing their own arrival. Blended by the friendly kinds, compost never dies.</p>
<p><strong>Germanium - Jamie Allen (Shift register)</strong><br>The earthly abundance of silicon is the contingent result of planetary condensation, the selective, centrifugal coalescence of a cosmic emulsion. Germanium, harder to extract and scarce (that is, expensive), was preferred by early electronics researchers as it allows for faster switching and lower voltage threshold, reduceing energy consumption and circuit size. The Teutonic element was used in Shockley&#x2019;s first demo of semi-conduction and had it become the basic of the &#x201C;information  economy,&#x201D; high-grade deposits in places like Xilinhaote and Northumbria would be bootowns. Engineers are revisiting Ge as a way to smash the glass ceiling of silicon computation, breaking Moore&#x2019;s dicouraging law.</p>
<hr>
<div style="font-size:9pt">

<p>Shu lea Cheang&#xFF1A;&#x83CC;&#x4E1D;&#x7F51;&#x7EDC;&#x793E;&#x4F1A;<a href="http://mauvaiscontact.info/" rel="external nofollow noopener noreferrer" target="_blank">^1</a>&#x6210;&#x5458;<br><strong>shift register</strong>: <a href="http://www.1010.co.uk/org/" rel="external nofollow noopener noreferrer" target="_blank">&#x99AC;&#x4E01;&#xB7;&#x8C6A;&#x65AF;(Martin Howse)</a>[^2], <a href="https://www.transmediale.de/content/jamie-allen" rel="external nofollow noopener noreferrer" target="_blank">Jamie Allen</a>[^3], Jonathan Kemp[^4]</p>
<p>[^2]:<a href="https://transmediale.de/content/martin-howse" rel="external nofollow noopener noreferrer" target="_blank">Martin Howse</a> &#x5FD9;&#x4E8E;&#x5BF9;&#x5730;&#x7403;&#xFF08;&#x5730;&#x7403;&#x7269;&#x7406;&#x73B0;&#x8C61;&#xFF09;&#xFF0C;&#x8F6F;&#x4EF6;&#x548C;&#x4EBA;&#x7C7B;&#x5FC3;&#x7406;&#xFF08;&#x5FC3;&#x7406;&#x7269;&#x7406;&#x5B66;&#xFF09;&#x4E4B;&#x95F4;&#x7684;&#x8054;&#x7CFB;&#x8FDB;&#x884C;&#x827A;&#x672F;&#x63A2;&#x7D22;&#x548C;&#x7814;&#x7A76;&#xFF0C;&#x63D0;&#x51FA;&#x5728;&#x4E25;&#x91CD;&#x6EE5;&#x7528;&#x79D1;&#x5B66;&#x6280;&#x672F;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#x56DE;&#x5F52;&#x4E07;&#x7269;&#x6709;&#x7075;&#x8BBA;&#x3002;&#x901A;&#x8FC7;&#x6784;&#x5EFA;&#x5B9E;&#x9A8C;&#x60C5;&#x5883;&#xFF08;&#x5728;&#x8FC7;&#x7A0B;&#x9A71;&#x52A8;&#x7684;&#x8868;&#x6F14;&#xFF0C;&#x5B9E;&#x9A8C;&#x5BA4;&#xFF0C;&#x6563;&#x6B65;&#x548C;&#x7814;&#x8BA8;&#x4F1A;&#x5185;&#xFF09;&#xFF0C;&#x6750;&#x6599;&#x827A;&#x672F;&#x4F5C;&#x54C1;&#x548C;&#x6587;&#x672C;&#xFF0C;Martin Howse&#x63A2;&#x7D22;&#x7269;&#x8D28;&#x6216;&#x6750;&#x6599;&#x4E0E;&#x6267;&#x884C;&#x6216;&#x534F;&#x8BAE;&#x4E4B;&#x95F4;&#x7684;&#x4E30;&#x5BCC;&#x8054;&#x7CFB;&#xFF0C;&#x6316;&#x6398;&#x53EF;&#x89C1;&#x6027;&#x548C;&#x9690;&#x85CF;&#x7684;&#x95EE;&#x9898;&#x4E16;&#x754C;&#x3002;<br>[^3]:&#x6770;&#x7C73;&#x827E;&#x4F26;&#x4ED6;&#x662F;&#x52A0;&#x62FF;&#x5927;&#x51FA;&#x751F;&#x7684;&#x7814;&#x7A76;&#x5458;&#xFF0C;&#x827A;&#x672F;&#x5BB6;&#xFF0C;&#x8BBE;&#x8BA1;&#x5E08;&#x548C;&#x6559;&#x5E08;&#xFF0C;&#x5BF9;&#x54EA;&#x4E9B;&#x6280;&#x672F;&#x6559;&#x4F1A;&#x6211;&#x4EEC;&#x4E2A;&#x4EBA;&#xFF0C;&#x6587;&#x5316;&#x548C;&#x793E;&#x4F1A;&#x7684;&#x5174;&#x8DA3;&#x611F;&#x5174;&#x8DA3;&#x3002;&#x4ED6;&#x559C;&#x6B22;&#x7528;&#x5934;&#x548C;&#x624B;&#x505A;&#x4E8B;&#xFF0C;&#x5E76;&#x4E14;&#x662F;&#x7EBD;&#x7EA6;&#x7F8E;&#x56FD;&#x81EA;&#x7136;&#x5386;&#x53F2;&#x535A;&#x7269;&#x9986;&#x7684;&#x7535;&#x5B50;&#x5DE5;&#x7A0B;&#x5E08;&#xFF0C;&#x9AD8;&#x5206;&#x5B50;&#x5316;&#x5B66;&#x5BB6;&#x548C;&#x8BBE;&#x8BA1;&#x5E08;&#x3002;&#x4ED6;&#x5728;&#x4E16;&#x754C;&#x5404;&#x5730;&#x8BB2;&#x5B66;&#xFF0C;&#x51FA;&#x7248;&#x548C;&#x5C55;&#x89C8;&#x3002;&#x4ED6;&#x4F4F;&#x5728;&#x6B27;&#x6D32;&#xFF0C;&#x4ECE;&#x4E8B;&#x827A;&#x672F;&#x548C;&#x6280;&#x672F;&#x9879;&#x76EE;&#xFF0C;&#x5199;&#x4F5C;&#xFF0C;&#x5E76;&#x5C1D;&#x8BD5;&#x4E0E;&#x81EA;&#x5DF1;&#x5408;&#x4F5C;&#xFF0C;&#x521B;&#x9020;&#x51FA;&#x6177;&#x6168;&#x548C;&#x534F;&#x4F5C;&#x7684;&#x9884;&#x8BBE;&#x673A;&#x6784;&#xFF0C;&#x627F;&#x8BA4;&#x53CB;&#x8C0A;&#xFF0C;&#x6FC0;&#x60C5;&#x548C;&#x7231;&#x662F;&#x7F8E;&#x5B66;&#xFF0C;&#x7814;&#x7A76;&#x548C;&#x77E5;&#x8BC6;&#x7684;&#x6838;&#x5FC3;&#x5B9E;&#x8DF5;&#x3002;&#x4ED6;&#x7684;&#x535A;&#x58EB;&#xFF08;&#x4F18;&#x7B49;&#x751F;&#xFF0C;&#x6B27;&#x6D32;&#x7814;&#x7A76;&#x751F;&#x9662;&#xFF09;&#x7531;Siegfried Zielinski&#x548C;Avital Ronell&#x76D1;&#x7763;&#x3002;&#x4ED6;&#x662F;&#x745E;&#x58EB;&#x5DF4;&#x585E;&#x5C14;&#x5173;&#x952E;&#x5A92;&#x4F53;&#x5B9E;&#x9A8C;&#x5BA4;&#x7684;&#x9AD8;&#x7EA7;&#x7814;&#x7A76;&#x5458;<br>&#x3002;<a href="http://www.jamieallen.com&#xFF09;" rel="external nofollow noopener noreferrer" target="_blank">www.jamieallen.com&#xFF09;</a><br>[^4]:<a href="https://transmediale.de/content/jonathan-kemp" rel="external nofollow noopener noreferrer" target="_blank">Jonathan Kemp</a> &#x5728;&#x6295;&#x673A;&#x548C;&#x60C5;&#x5883;&#x751F;&#x6D3B;&#x7F16;&#x7801;&#x4E8B;&#x4EF6;&#x65B9;&#x9762;&#x6709;&#x7740;&#x60A0;&#x4E45;&#x7684;&#x5386;&#x53F2;&#xFF0C;&#x8FD9;&#x4E9B;&#x4E8B;&#x4EF6;&#x88AB;&#x9610;&#x8FF0;&#x4E3A;&#x4E16;&#x754C;&#x4E0A;&#x6D3B;&#x8DC3;&#x7684;&#x4E8B;&#x7269;&#x3002;&#x9879;&#x76EE;&#x5408;&#x4F5C;&#x5305;&#x62EC;&#x6750;&#x6599;&#x52A0;&#x5DE5;&#x6027;&#x80FD;&#xFF0C;&#x73AF;&#x5883;&#x8BBE;&#x65BD;&#xFF0C;&#x6295;&#x673A;&#x6027;&#x7814;&#x8BA8;&#x4F1A;&#x4EE5;&#x53CA;&#x5728;&#x6574;&#x4E2A;&#x6B27;&#x6D32;&#x548C;&#x7F8E;&#x56FD;&#x6267;&#x884C;&#x7684;&#x793E;&#x4EA4;&#x8F6F;&#x4EF6;&#x6D3B;&#x52A8;&#x3002;&#x5F53;&#x524D;&#x7684;&#x9879;&#x76EE;&#x548C;&#x8868;&#x73B0;&#x662F;&#x901A;&#x8FC7;&#x5BF9;&#x8BA1;&#x7B97;&#x6750;&#x6599;&#x57FA;&#x677F;&#x7684;&#x968F;&#x673A;&#x548C;&#x4EE3;&#x7801;&#x6E05;&#x7406;&#x91CD;&#x65B0;&#x914D;&#x7F6E;&#x7684;&#x5174;&#x8DA3;&#x6765;&#x83B7;&#x77E5;&#x7684;&#x3002;</p>
<p><strong>&#x79FB;&#x4F4D;&#x5BC4;&#x5B58;&#x5668;</strong><br>Shift Register&#x662F;Martin Howse&#xFF0C;Jonathan Kemp&#x548C;Jamie Allen&#xFF08;&#x5173;&#x952E;&#x5A92;&#x4F53;&#x5B9E;&#x9A8C;&#x5BA4;&#xFF09;&#x7684;&#x7814;&#x7A76;&#x9879;&#x76EE;&#xFF0C;&#x7814;&#x7A76;&#x4EBA;&#x7C7B;&#x5A92;&#x4F53;&#xFF0C;&#x6280;&#x672F;&#x548C;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x6D3B;&#x52A8;&#x5982;&#x4F55;&#x6807;&#x5FD7;&#x7740;&#x5730;&#x7403;&#x3002;</p>
<p>&#x8F6E;&#x73ED;&#x767B;&#x8BB0;&#x518C;&#x5BF9;&#x5730;&#x7403;&#x4E0A;&#x4EBA;&#x7C7B;&#x6D3B;&#x52A8;&#x7684;&#x7269;&#x8D28;&#x8BC1;&#x636E;&#x8FDB;&#x884C;&#x8C03;&#x67E5;&#x5E76;&#x4F7F;&#x5176;&#x6E05;&#x6670;&#x6613;&#x8BFB;&#xFF0C;&#x5C06;&#x8FD9;&#x4E9B;&#x8BC1;&#x636E;&#x4E0D;&#x4F5C;&#x4E3A;&#x4EBA;&#x7C7B;&#x6210;&#x5C31;&#x7684;&#x6307;&#x6807;&#xFF0C;&#x800C;&#x662F;&#x4F5C;&#x4E3A;&#x6A21;&#x7CCA;&#x7684;&#x8C08;&#x5224;&#x548C;&#x884C;&#x661F;&#x8017;&#x5C3D;&#x7684;&#x6807;&#x5FD7;&#x3002;&#x8BE5;&#x9879;&#x76EE;&#x4ECE;&#x81EA;&#x7136;&#x79D1;&#x5B66;&#x548C;&#x7269;&#x7406;&#x79D1;&#x5B66;&#x5F00;&#x59CB;&#x8FDB;&#x884C;&#x5B9E;&#x5730;&#x8003;&#x5BDF;&#x548C;&#x7814;&#x7A76;&#xFF0C;&#x4F5C;&#x4E3A;&#x89C1;&#x8BC1;&#x8FD9;&#x4E9B;&#x4EBA;&#x7C7B;&#x5F71;&#x54CD;&#x573A;&#x6240;&#x7684;&#x624B;&#x6BB5;&#x3002;&#x9879;&#x76EE;&#x4EA7;&#x51FA;&#xFF08;&#x7740;&#x4F5C;&#xFF0C;&#x5A92;&#x4F53;&#x548C;&#x5C55;&#x89C8;&#x4F5C;&#x54C1;&#xFF09;&#x65E8;&#x5728;&#x4F7F;&#x73AF;&#x5883;&#x79D1;&#x5B66;&#x4E0E;&#x5176;&#x4ED6;&#x6587;&#x5316;&#xFF0C;&#x60C5;&#x611F;&#xFF0C;&#x8DE8;&#x6587;&#x5316;&#x548C;&#x4E9A;&#x6587;&#x5316;&#x89C2;&#x70B9;&#x76F8;&#x6DF7;&#x6DC6;&#xFF0C;&#x4EE5;&#x4FBF;&#x8003;&#x8651;&#x5230;&#x5730;&#x7403;&#x7684;&#x80FD;&#x91CF;&#x548C;&#x901A;&#x4FE1;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x7684;&#x590D;&#x6742;&#x6027;&#x548C;&#x59CB;&#x7EC8;&#x77DB;&#x76FE;&#x7684;&#x6027;&#x8D28;&#x3002;</p>
<p>&#x8BE5;&#x9879;&#x76EE;&#x8C03;&#x67E5;&#x5355;&#x4E00;&#x5F71;&#x54CD;&#x573A;&#x5730;&#xFF0C;&#x5E76;&#x5C06;&#x5730;&#x7403;&#x5A92;&#x4F53;&#x548C;&#x8C03;&#x67E5;&#x7ED3;&#x679C;&#x8F6C;&#x5316;&#x4E3A;&#x4E13;&#x95E8;&#x5F00;&#x53D1;&#x7684;&#x5730;&#x7403;&#x5B9E;&#x9A8C;&#x5BA4;&#xFF0C;&#x7814;&#x7A76;&#xFF0C;&#x7814;&#x8BA8;&#x4F1A;&#x548C;&#x5C55;&#x89C8;&#x573A;&#x6240;&#x3002;&#x5730;&#x7403;&#x5B9E;&#x9A8C;&#x5BA4;&#x65E2;&#x662F;&#x4E00;&#x4E2A;&#x6982;&#x5FF5;&#x6027;&#x7684;&#xFF0C;&#x4E5F;&#x662F;&#x4E00;&#x4E2A;&#x5F53;&#x5730;&#x7684;&#x6237;&#x5916;&#x5DE5;&#x4F5C;&#x73AF;&#x5883;&#xFF0C;&#x8FD9;&#x4E2A;&#x7ED3;&#x6784;&#x5728;&#x9879;&#x76EE;&#x7684;&#x4E24;&#x5E74;&#x4E2D;&#x4F5C;&#x4E3A;&#x7EB5;&#x5411;&#x7684;&#x6BD4;&#x8F83;&#x573A;&#x5730;&#x3002;&#x5728;&#x5730;&#x7403;&#x5B9E;&#x9A8C;&#x5BA4;&#xFF0C;&#x6750;&#x6599;&#x6837;&#x672C;&#x88AB;&#x8C03;&#x89E3;&#xFF0C;&#x5C55;&#x793A;&#x548C;&#x8BB0;&#x5F55;&#xFF0C;&#x51C6;&#x5907;&#x5A92;&#x4F53;&#x6587;&#x4EF6;&#x548C;&#x8C03;&#x5EA6;&#xFF0C;&#x5E76;&#x8FDB;&#x884C;&#x516C;&#x5171;&#x9879;&#x76EE;&#x8BA8;&#x8BBA;&#x3002;</p>
<p>&#x79FB;&#x6C11;&#x767B;&#x8BB0;&#x7531;&#x745E;&#x58EB;&#x56FD;&#x5BB6;&#x79D1;&#x5B66;&#x57FA;&#x91D1;&#x4F1A;&#x548C;&#x4E00;&#x7FA4;&#x4ECE;&#x4E1A;&#x8005;&#xFF0C;&#x987E;&#x95EE;&#x548C;&#x670B;&#x53CB;&#x7684;&#x5E2E;&#x52A9;&#x548C;&#x5174;&#x8DA3;&#x652F;&#x6301;&#xFF0C;&#x5305;&#x62EC;&#xFF1A;ChristophK&#xFC;ffer&#xFF0C;Bronwyn Lay&#xFF0C;Orit Halpern&#xFF0C;Paul Boshears&#xFF0C;Eric Berger&#xFF0C;Merle Ibach&#xFF0C;RIXC&#x7B49;&#x7B49;&#xFF0C;&#x5F88;&#x591A;&#x5176;&#x4ED6;&#x7684;&#x3002;</p>
</div>
    
    </div>
    
    <div class="columns is-variable is-1 is-multiline is-mobile">
    
        <span class="column is-narrow"><a class="tag is-light article-tag" href="/tags/ever-Elusive/">#ever Elusive</a></span>
    
    </div>
    
    
    <div class="columns is-mobile is-multiline article-nav">
        <span class="column is-12-mobile is-half-desktop  article-nav-prev">
            
            <a href="/2018/11/17/East2018/">East2018</a>
            
        </span>
        <span class="column is-12-mobile is-half-desktop  article-nav-next">
            
            <a href="/2018/11/10/交流，互动和系统/">系统美学与交互语境</a>
            
        </span>
    </div>
    
</article>


<div class="sharebox">
    
<div class="sharethis-inline-share-buttons"></div>
<script type="text/javascript" src="//platform-api.sharethis.com/js/sharethis.js#property=5d03e67f4351e90012650a82&amp;product=sticky-share-buttons" async="async"></script>

</div>



<div class="comments">
    <h3 class="title is-4">评论</h3>
    <script>(function(d, s, id) {
    var js, fjs = d.getElementsByTagName(s)[0];
    if (d.getElementById(id)) return;
    js = d.createElement(s); js.id = id;
    js.src = "//connect.facebook.net/zh-CN/sdk.js#xfbml=1&version=v2.8";
    fjs.parentNode.insertBefore(js, fjs);
}(document, 'script', 'facebook-jssdk'));</script>
<div class="fb-comments" data-width="100%" data-href="http://liudixian.github.io/2018/11/15/虚构的生态学/" data-num-posts="5"></div>

</div>

    </div>
</section>
    <footer class="footer">
    <div class="container">
        <div class="columns content">
            <div class="column is-narrow has-text-centered">
                &copy; 2020 liudixian&nbsp;
                Powered by <a href="http://hexo.io/" target="_blank" rel="external nofollow noopener noreferrer">Hexo</a> & <a href="http://github.com/ppoffice/hexo-theme-minos" rel="external nofollow noopener noreferrer" target="_blank">Minos</a>
            </div>
            <div class="column is-hidden-mobile"></div>

            
            <div class="column is-narrow">
                <div class="columns is-mobile is-multiline is-centered">
                
                    
                <a class="column is-narrow has-text-black" title="GitHub" href="https://github.com/ppoffice/hexo-theme-minos" rel="external nofollow noopener noreferrer" target="_blank">
                    
                    GitHub
                    
                </a>
                
                </div>
            </div>
            
            
<div class="column is-narrow has-text-centered">
    <div class="dropdown is-up is-right is-hoverable" style="margin-top: -0.2em;">
        <div class="dropdown-trigger">
            <button class="button is-small" aria-haspopup="true" aria-controls="dropdown-menu7">
                <span class="icon">
                    <i class="fas fa-globe"></i>
                </span>
                <span>简体中文</span>
                <span class="icon is-small">
            <i class="fas fa-angle-down" aria-hidden="true"></i>
          </span>
            </button>
        </div>
        <div class="dropdown-menu has-text-left" role="menu">
            <div class="dropdown-content">
            
                <a href="/2018/11/15/虚构的生态学/" class="dropdown-item">
                    简体中文
                </a>
            
                <a href="/en/2018/11/15/虚构的生态学/" class="dropdown-item">
                    English
                </a>
            
            </div>
        </div>
    </div>
</div>

        </div>
    </div>
</footer>
    <script src="//cdnjs.cloudflare.com/ajax/libs/jquery/3.3.1/jquery.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/moment.js/2.22.2/moment-with-locales.min.js"></script>

<!-- test if the browser is outdated -->
<div id="outdated">
    <h6>Your browser is out-of-date!</h6>
    <p>Update your browser to view this website correctly. <a id="btnUpdateBrowser" href="http://outdatedbrowser.com/" rel="external nofollow noopener noreferrer" target="_blank">Update my browser now </a></p>
    <p class="last"><a href="#" id="btnCloseUpdateBrowser" title="Close">&times;</a></p>
</div>
<script src="//cdnjs.cloudflare.com/ajax/libs/outdated-browser/1.1.5/outdatedbrowser.min.js"></script>
<script>
    $(document).ready(function () {
        // plugin function, place inside DOM ready function
        outdatedBrowser({
            bgColor: '#f25648',
            color: '#ffffff',
            lowerThan: 'flex'
        })
    });
</script>

<script>
    window.FontAwesomeConfig = {
        searchPseudoElements: true
    }
    moment.locale("zh-CN");
</script>


    
    
<script src="https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.4/MathJax.js?config=TeX-MML-AM_CHTML"></script>
<script>
    MathJax.Hub.Config({
        "HTML-CSS": {
            matchFontHeight: false
        },
        SVG: {
            matchFontHeight: false
        },
        CommonHTML: {
            matchFontHeight: false
        },
        tex2jax: {
            inlineMath: [
                ['$','$'],
                ['\\(','\\)']
            ]
        }
    });
</script>

    
    
    
    
<script src="//cdnjs.cloudflare.com/ajax/libs/lightgallery/1.6.8/js/lightgallery-all.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/justifiedGallery/3.6.5/js/jquery.justifiedGallery.min.js"></script>
<script>
    (function ($) {
        $(document).ready(function () {
            if (typeof($.fn.lightGallery) === 'function') {
                $('.article.gallery').lightGallery({ selector: '.gallery-item' });
            }
            if (typeof($.fn.justifiedGallery) === 'function') {
                $('.justified-gallery').justifiedGallery();
            }
        });
    })(jQuery);
</script>

    
    
    <script src="https://cdnjs.cloudflare.com/ajax/libs/clipboard.js/2.0.0/clipboard.min.js"></script>
    <style>
        .hljs {
            position: relative;
        }

        .hljs .clipboard-btn {
            float: right;
            color: #9a9a9a;
            background: none;
            border: none;
            cursor: pointer;
        }

        .hljs .clipboard-btn:hover {
          color: #8a8a8a;
        }

        .hljs > .clipboard-btn {
            display: none;
            position: absolute;
            right: 4px;
            top: 4px;
        }

        .hljs:hover > .clipboard-btn {
            display: inline;
        }

        .hljs > figcaption > .clipboard-btn {
            margin-right: 4px;
        }
    </style>
    <script>
      $(document).ready(function () {
        $('figure.hljs').each(function(i, figure) {
          var codeId = 'code-' + i;
          var code = figure.querySelector('.code');
          var copyButton = $('<button>Copy <i class="far fa-clipboard"></i></button>');
          code.id = codeId;
          copyButton.addClass('clipboard-btn');
          copyButton.attr('data-clipboard-target-id', codeId);

          var figcaption = figure.querySelector('figcaption');

          if (figcaption) {
            figcaption.append(copyButton[0]);
          } else {
            figure.prepend(copyButton[0]);
          }
        })

        var clipboard = new ClipboardJS('.clipboard-btn', {
          target: function(trigger) {
            return document.getElementById(trigger.getAttribute('data-clipboard-target-id'));
          }
        });
        clipboard.on('success', function(e) {
          e.clearSelection();
        })
      })
    </script>

    
    

    


<script src="/js/script.js"></script>

    
    <div class="searchbox ins-search">
    <div class="searchbox-mask"></div>
    <div class="searchbox-container ins-search-container">
        <div class="searchbox-input-wrapper">
            <input type="text" class="searchbox-input ins-search-input" placeholder="站内搜索">
            <span class="searchbox-close ins-close ins-selectable"><i class="fa fa-times-circle"></i></span>
        </div>
        <div class="searchbox-result-wrapper ins-section-wrapper">
            <div class="ins-section-container"></div>
        </div>
    </div>
</div>
<script>
    (function (window) {
        var INSIGHT_CONFIG = {
            TRANSLATION: {
                POSTS: '文章',
                PAGES: '页面',
                CATEGORIES: '分类',
                TAGS: '标签',
                UNTITLED: '(无标题)',
            },
            CONTENT_URL: '/content.json',
        };
        window.INSIGHT_CONFIG = INSIGHT_CONFIG;
    })(window);
</script>
<script src="/js/insight.js"></script>
    
</body>
</html>