<!DOCTYPE html>
<html class="has-navbar-fixed-top">
<head><meta name="generator" content="Hexo 3.8.0">
    <meta charset="utf-8">
<title>标签: MediaArtNetII - 刘迪先</title>
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">

<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/outdated-browser/1.1.5/outdatedbrowser.min.css">


<link href="/en/tags/MediaArtNetII/index.html" rel="alternate" hreflang="en">
    




<meta name="keywords" content="media art and theory">



    <meta name="keywords" content="media art and theory">
<meta property="og:type" content="website">
<meta property="og:title" content="刘迪先">
<meta property="og:url" content="http://liudixian.github.io/tags/MediaArtNetII/index.html">
<meta property="og:site_name" content="刘迪先">
<meta property="og:locale" content="zh-cn">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="刘迪先">





<link rel="icon" href="/favicon.png">


<link rel="stylesheet" href="//fonts.googleapis.com/css?family=Ovo|Source+Code+Pro">
<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/bulma/0.6.2/css/bulma.min.css">


<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/lightgallery/1.6.8/css/lightgallery.min.css">
<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/justifiedGallery/3.6.5/css/justifiedGallery.min.css">


<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/highlight.js/9.12.0/styles/atom-one-light.min.css">

<link rel="stylesheet" href="/css/style.css">

<script defer src="//use.fontawesome.com/releases/v5.0.8/js/all.js"></script>


    
    
    
    
    
    
    
    
    
    

    


</head>
<body>
    
<nav class="navbar is-transparent is-fixed-top navbar-main" role="navigation" aria-label="main navigation">
    <div class="container">
        <div class="navbar-brand">
            <a class="navbar-item navbar-logo" href="/">
                
                <img src="/images/logo.png" alt="" height="28">
                
            </a>
            <div class="navbar-burger">
                <span></span>
                <span></span>
                <span></span>
            </div>
        </div>
        
        <div class="navbar-menu navbar-start">
            
            <a class="navbar-item " href="/archives">Archives</a>
            
            <a class="navbar-item " href="/categories/媒介理论">Media Theory</a>
            
            <a class="navbar-item " href="/categories/works">Works</a>
            
            <a class="navbar-item " href="/categories/技术">Technology</a>
            
            <a class="navbar-item " href="/categories/coding">Coding</a>
            
            <a class="navbar-item " href="/about">About</a>
            
        </div>
        
        <div class="navbar-menu navbar-end">
            
            <a class="navbar-item search" title="搜索" href="javascript:;">
                <i class="fas fa-search"></i>
            </a>
            
            
            
            <a class="navbar-item" title="GitHub" href="https://github.com/ppoffice/hexo-theme-minos" rel="external nofollow noopener noreferrer" target="_blank">
                
                <i class="fab fa-github"></i>
                
            </a>
               
            
        </div>
    </div>
</nav>

    <section class="section section-heading">
    <div class="container">
        <div class="content">
            <h5>#MediaArtNetII</h5>
        </div>
    </div>
</section>
<section class="section">
    <div class="container">
    
        <article class="article content gallery" itemscope="" itemprop="blogPost">
    <h1 class="article-title is-size-3 is-size-4-mobile" itemprop="name">
        
            <a href="/2018/11/10/交流，互动和系统/" itemprop="url">系统美学与交互语境</a>
        
    </h1>
    <div class="article-meta columns is-variable is-1 is-multiline is-mobile is-size-7-mobile">
        <span class="column is-narrow">
            <time datetime="2018-11-10T12:24:14.000Z" itemprop="datePublished">11月 10 2018</time>
        </span>
        
        
        <span class="column is-narrow">
            
            
            1 小时 读完 (约 7529 字)
        </span>
        
    </div>
    <div class="article-entry is-size-6-mobile" itemprop="articleBody">
    
        <h1 id="Cybernetic-Aesthetics-and-communicative-Context"><a href="#Cybernetic-Aesthetics-and-communicative-Context" class="headerlink" title="Cybernetic Aesthetics and communicative Context"></a>Cybernetic Aesthetics and communicative Context</h1><p><em>Claudia Giannetti</em></p>
<p><a href="http://mediaartnet.org/themes/aesthetics_of_the_digital/aesthetics_and_communicative%20Context/" rel="external nofollow noopener noreferrer" target="_blank">http://mediaartnet.org/themes/aesthetics_of_the_digital/aesthetics_and_communicative%20Context/</a></p>
<h6 id="tags-&#x7FFB;&#x8BD1;"><a href="#tags-&#x7FFB;&#x8BD1;" class="headerlink" title="tags: &#x7FFB;&#x8BD1;"></a>tags: <code>&#x7FFB;&#x8BD1;</code></h6><h3 id="Communication-interaction-and-systems&#x4EA4;&#x6D41;&#xFF0C;&#x4E92;&#x52A8;&#xFF0C;&#x548C;&#x7CFB;&#x7EDF;"><a href="#Communication-interaction-and-systems&#x4EA4;&#x6D41;&#xFF0C;&#x4E92;&#x52A8;&#xFF0C;&#x548C;&#x7CFB;&#x7EDF;" class="headerlink" title="Communication, interaction, and systems&#x4EA4;&#x6D41;&#xFF0C;&#x4E92;&#x52A8;&#xFF0C;&#x548C;&#x7CFB;&#x7EDF;"></a>Communication, interaction, and systems&#x4EA4;&#x6D41;&#xFF0C;&#x4E92;&#x52A8;&#xFF0C;&#x548C;&#x7CFB;&#x7EDF;</h3><ol>
<li>The idea of a scientific analysis of organization systems was first formulated in the early twentieth century by the Russian researcher Alexander Bogdanov. [^1] His system theory, which attempts to register all organization elements in their entirety, introduced the basic concepts of the open system (with reference to living systems) and of feedback, and made Bogdanov a forerunner of cybernetics and of the systemic theories Ludwig von Bertalanffy would develop two decades later. [^2]</li>
</ol>
<p>&#x4FC4;&#x7F57;&#x65AF;&#x7814;&#x7A76;&#x5458;Alexander Bogdanov&#xFF08;&#x4E9A;&#x5386;&#x5C71;&#x5927;&#xB7;&#x6CE2;&#x683C;&#x4E39;&#x8BFA;&#x592B;&#xFF09;&#x5728;&#x4E8C;&#x5341;&#x4E16;&#x7EAA;&#x521D;&#x9996;&#x5148;&#x63D0;&#x51FA;&#x4E86;&#x5BF9;&#x7EC4;&#x7EC7;&#x4F53;&#x7CFB;&#x8FDB;&#x884C;&#x79D1;&#x5B66;&#x5206;&#x6790;&#x7684;&#x6784;&#x60F3;&#x3002; [1]&#x4ED6;&#x7684;&#x7CFB;&#x7EDF;&#x7406;&#x8BBA;&#x8BD5;&#x56FE;&#x5168;&#x90E8;&#x63D0;&#x51FA;&#x6240;&#x6709;&#x7CFB;&#x7EDF;&#x6027;&#x7684;&#x5143;&#x7D20;&#xFF0C;&#x4ECB;&#x7ECD;&#x4E86;&#x5F00;&#x653E;&#x7CFB;&#x7EDF;&#xFF08;&#x53C2;&#x8003;&#x751F;&#x547D;&#x7CFB;&#x7EDF;&#xFF09;&#x548C;&#x53CD;&#x9988;&#x7684;&#x57FA;&#x672C;&#x6982;&#x5FF5;&#xFF0C;&#x5E76;&#x4E14;&#x4F7F;Bogdanov&#xFF08;&#x535A;&#x683C;&#x4E39;&#x8BFA;&#x592B;&#xFF09;&#x5148;&#x5BFC;&#x7684;&#x63A7;&#x5236;&#x8BBA;&#x548C;Ludwig von Bertalanffy&#xFF08;&#x8DEF;&#x5FB7;&#x7EF4;&#x5E0C;&#x51AF;&#x8D1D;&#x5854;&#x6717;&#x83F2;&#xFF09;&#x5148;&#x5BFC;&#x7684;&#x7CFB;&#x7EDF;&#x7406;&#x8BBA;&#x5728;&#x4E8C;&#x5341;&#x5E74;&#x540E;&#x6709;&#x6240;&#x53D1;&#x5C55;&#x3002;</p>
<p>&#x5434;&#x884D;&#x5F6C;</p>
<ol start="2">
<li>The first comprehensive contribution to the understanding and dissemination of the theory of self-organization was the result of the research carried out by the physicist and cyberneticist Heinz von Foerster from the late 1950s on, and especially after the publication of his treatise &#xAB;On Self- Organizing Systems and their Environment&#xBB; of 1960. Heinz von Foerster was well acquainted with cybernetics and information theory, and likewise with the basics of Artificial Intelligence (A. Turing and J. von Neumann) and system theory (P. Weiss and L. von Bertalanffy). Taking these theories as his starting point, heproposed that concepts such as those of redundancy, entropy or information (cybernetics) as well as those of self-regulation, autonomy and hierarchic order (system theory) be applied in the examination of organization. As Foerster saw it, every system exists autonomously&#x2014;according to its own laws&#x2014;and is organizationally self-contained, meaning its organization is selfreferential, self-maintaining, and recursive. He understood reality to be an interactive construction in which the observer and what is observed are two interdependent sub-aspects. In consequence, objectivity exists merely as an illusion on the part of the subject, even without whom a perception could exist independently. This implies that perception takes place by means of a linkage of observer and system unit, and namely in the domain in which this unit operates. In the 1970s and 1980s the basic concepts of system research, which relate to interaction, self-organization, co-evolution, or the environment, were further developed by a number of scientists, and translated into new theories. [^3] System theory received an important impetus from the theory of &#xAB;autopoiesis&#xBB; [^4] developed from the 1970s onward by the Chilean biologist Humberto together with the neuroscientist Francisco J. Varela. This theory linked for the first time two areas until then studied only separately: biology, or the theory of the organization of living organisms, and cognitive theory, which is particularly concerned with the problem of the cognition and perception of phenomena. In 1969 Maturana drew up the thesis according to which the nervous system is a closed system. [^5]</li>
</ol>
<p>&#x5BF9;&#x81EA;&#x7EC4;&#x7EC7;&#x7406;&#x8BBA;&#x7684;&#x7406;&#x89E3;&#x548C;&#x4F20;&#x64AD;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x5168;&#x9762;&#x8D21;&#x732E;&#x662F;&#x7269;&#x7406;&#x5B66;&#x5BB6;&#x548C;&#x63A7;&#x5236;&#x8BBA;&#x5BB6;Heinz von Foerster&#x4ECE;20&#x4E16;&#x7EAA;50&#x5E74;&#x4EE3;&#x540E;&#x671F;&#x5F00;&#x59CB;&#xFF0C;&#x7279;&#x522B;&#x662F;&#x5728;&#x4ED6;&#x7684;&#x8BBA;&#x6587;&#xAB;On Self- Organizing Systems and their Environment&#xBB;&#xFF08;&#xAB;&#x8BBA;&#x81EA;&#x7EC4;&#x7EC7;&#x7CFB;&#x7EDF;&#x53CA;&#x5176;&#x73AF;&#x5883;&#xBB; &#xFF09;&#x5728;1960&#x5E74;&#x51FA;&#x7248;&#x4E4B;&#x540E;&#xFF0C;Heinz von Foerster&#x638C;&#x63E1;&#x63A7;&#x5236;&#x8BBA;&#x548C;&#x4FE1;&#x606F;&#x8BBA;&#xFF0C;&#x540C;&#x6837;&#x638C;&#x63E1;&#x4EBA;&#x5DE5;&#x667A;&#x80FD;&#xFF08;A. Turing&#x548C;J. von Neumann&#xFF09;&#x548C;&#x7CFB;&#x7EDF;&#x8BBA;&#xFF08;P. Weiss&#x548C;L. von Bertalanffy&#xFF09;&#x7684;&#x57FA;&#x7840;&#x77E5;&#x8BC6;&#x3002; &#x4EE5;&#x8FD9;&#x4E9B;&#x7406;&#x8BBA;&#x4E3A;&#x51FA;&#x53D1;&#x70B9;&#xFF0C;&#x4ED6;&#x63D0;&#x51FA;&#x5197;&#x4F59;&#xFF0C;&#x71B5;&#x6216;&#x4FE1;&#x606F;&#xFF08;&#x63A7;&#x5236;&#x8BBA;&#xFF09;&#x4EE5;&#x53CA;&#x81EA;&#x6211;&#x8C03;&#x8282;&#xFF0C;&#x81EA;&#x6CBB;&#x548C;&#x7B49;&#x7EA7;&#x79E9;&#x5E8F;&#xFF08;&#x7CFB;&#x7EDF;&#x8BBA;&#xFF09;&#x7B49;&#x6982;&#x5FF5;&#x5E94;&#x7528;&#x4E8E;&#x7CFB;&#x7EDF;&#x6027;&#x7684;&#x8003;&#x5BDF;&#x3002;&#x6B63;&#x5982;Foerster&#x6240;&#x770B;&#x5230;&#x7684;&#x90A3;&#x6837;&#xFF0C;&#x6BCF;&#x4E2A;&#x7CFB;&#x7EDF;&#x90FD;&#x662F;&#x6839;&#x636E;&#x81EA;&#x5DF1;&#x7684;&#x89C4;&#x5F8B;&#x81EA;&#x6CBB;&#x5730;&#x5B58;&#x5728;&#x7684;&#xFF0C;&#x5E76;&#x4E14;&#x5728;&#x7EC4;&#x7EC7;&#x4E0A;&#x662F;&#x72EC;&#x7ACB;&#x7684;&#xFF0C;&#x610F;&#x5473;&#x7740;&#x5B83;&#x7684;&#x7EC4;&#x7EC7;&#x662F;&#x81EA;&#x6211;&#x6307;&#x6D89;&#x7684;&#xFF0C;&#x81EA;&#x6211;&#x7EF4;&#x62A4;&#x7684;&#x548C;&#x9012;&#x5F52;&#x7684;&#x3002; &#x4ED6;&#x5C06;&#x73B0;&#x5B9E;&#x7406;&#x89E3;&#x4E3A;&#x4E00;&#x79CD;&#x4EA4;&#x4E92;&#x5F0F;&#x7684;&#x6784;&#x9020;&#xFF0C;&#x5176;&#x4E2D;&#x89C2;&#x5BDF;&#x8005;&#x548C;&#x6240;&#x89C2;&#x5BDF;&#x5230;&#x7684;&#x662F;&#x4E24;&#x4E2A;&#x76F8;&#x4E92;&#x4F9D;&#x8D56;&#x7684;&#x5B50;&#x65B9;&#x9762;&#xFF08;sub-aspects&#xFF09;&#x3002; &#x7ED3;&#x679C;&#xFF0C;&#x5BA2;&#x89C2;&#x5B58;&#x5728;&#x4EC5;&#x4EC5;&#x662F;&#x4F5C;&#x4E3A;&#x4E3B;&#x4F53;&#x65B9;&#x9762;&#x7684;&#x5E7B;&#x60F3;&#xFF0C;&#x5373;&#x4F7F;&#x4EBA;&#x7684;&#x611F;&#x89C9;&#x662F;&#x6CA1;&#x6709;&#x529E;&#x6CD5;&#x72EC;&#x7ACB;&#x5B58;&#x5728;&#x7684;&#x3002; &#x8FD9;&#x610F;&#x5473;&#x7740;&#x611F;&#x77E5;&#x901A;&#x8FC7;&#x89C2;&#x5BDF;&#x8005;&#x548C;&#x7CFB;&#x7EDF;&#x5355;&#x5143;&#x7684;&#x8054;&#x7CFB;&#x53D1;&#x751F;&#xFF0C;&#x5373;&#x5728;&#x8BE5;&#x5355;&#x5143;&#x8FD0;&#x4F5C;&#x7684;&#x9886;&#x57DF;&#x4E4B;&#x95F4;&#x53D1;&#x751F;&#x3002;&#x5728;20&#x4E16;&#x7EAA;70&#x5E74;&#x4EE3;&#x548C;80&#x5E74;&#x4EE3;&#xFF0C;&#x4E0E;&#x76F8;&#x4E92;&#x4F5C;&#x7528;&#xFF0C;&#x81EA;&#x7EC4;&#x7EC7;&#xFF0C;&#x5171;&#x540C;&#x8FDB;&#x5316;&#x6216;&#x73AF;&#x5883;&#x76F8;&#x5173;&#x7684;&#x7CFB;&#x7EDF;&#x7814;&#x7A76;&#x7684;&#x57FA;&#x672C;&#x6982;&#x5FF5;&#xFF0C;&#x7531;&#x8BB8;&#x591A;&#x79D1;&#x5B66;&#x5BB6;&#x8FDB;&#x4E00;&#x6B65;&#x53D1;&#x5C55;&#xFF0C;&#x5E76;&#x8F6C;&#x5316;&#x4E3A;&#x65B0;&#x7684;&#x7406;&#x8BBA;&#x3002; [3]&#x7CFB;&#x7EDF;&#x7406;&#x8BBA;&#x53D7;&#x5230;&#x4E86;&#x667A;&#x5229;&#x751F;&#x7269;&#x5B66;&#x5BB6;Humberto&#xFF08;&#x6E29;&#x8D1D;&#x6258;&#xFF09;&#x4E0E;&#x795E;&#x7ECF;&#x79D1;&#x5B66;&#x5BB6;Francisco J. Varela&#xFF08;&#x5F17;&#x6717;&#x897F;&#x65AF;&#x79D1;&#x74E6;&#x96F7;&#x62C9;&#xFF09;&#x4E00;&#x8D77;&#x4ECE;20&#x4E16;&#x7EAA;70&#x5E74;&#x4EE3;&#x53D1;&#x5C55;&#x8D77;&#x6765;&#x7684;&#x201C;autopoiesis&#x201D;&#xFF08;&#x201C;&#x81EA;&#x521B;&#x751F;&#x6210;&#x201D;&#xFF09;&#x7406;&#x8BBA;&#x7684;&#x91CD;&#x8981;&#x63A8;&#x52A8;&#x3002; &#x8FD9;&#x4E2A;&#x7406;&#x8BBA;&#x7B2C;&#x4E00;&#x6B21;&#x628A;&#x4E24;&#x4E2A;&#x9886;&#x57DF;&#x8054;&#x7CFB;&#x8D77;&#x6765;&#xFF0C;&#x76F4;&#x5230;&#x90A3;&#x65F6;&#x624D;&#x5206;&#x522B;&#x7814;&#x7A76;&#xFF1A;&#x751F;&#x7269;&#x5B66;&#x6216;&#x751F;&#x7269;&#x7EC4;&#x7EC7;&#x7406;&#x8BBA;&#xFF0C;&#x8BA4;&#x77E5;&#x7406;&#x8BBA;&#xFF0C;&#x7279;&#x522B;&#x5173;&#x6CE8;&#x73B0;&#x8C61;&#x7684;&#x8BA4;&#x77E5;&#x548C;&#x611F;&#x77E5;&#x95EE;&#x9898;&#x3002; 1969&#x5E74;&#xFF0C;&#x9A6C;&#x56FE;&#x62C9;&#x7EB3;&#x64B0;&#x5199;&#x4E86;&#x4E00;&#x7BC7;&#x8BBA;&#x6587;&#xFF0C;&#x8BBA;&#x8FF0;&#x4E86;&#x795E;&#x7ECF;&#x7CFB;&#x7EDF;&#x662F;&#x4E00;&#x4E2A;&#x5C01;&#x95ED;&#x7684;&#x7CFB;&#x7EDF;&#x3002;[5]</p>
<ol start="3">
<li><p>According to this thesis, living systems are autopoietic. [^6] An autopoietic system operates as a closed system that generates only states of autopoiesis. The most important consequence of an autopoietic organization consists in the fact that everything occurring within the system is subjected to autopoiesis; otherwise the living system would collapse, because changes in the state of the organism and of the nervous system as well as of the medium act reciprocally, and so give rise to continuous autopoiesis. That means that living systems are determined by their structure (&#xAB;structure-specified&#xBB;), and that autopoiesis represents their constitutive attribute. The expansion of the cognitive processes(action and interaction) by the nervous system enables, according to Maturana, non-physical interactions between organisms in simple relationships&#x2014;and therefore communication. [^7]<br>&#x6839;&#x636E;&#x8FD9;&#x7BC7;&#x8BBA;&#x6587;&#xFF0C;&#x751F;&#x547D;&#x7CFB;&#x7EDF;&#x662F;&#x81EA;&#x751F;&#x7684;&#x3002; [^ 6]&#x4E00;&#x4E2A;&#x81EA;&#x521B;&#x751F;&#x7CFB;&#x7EDF;&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x53EA;&#x4EA7;&#x751F;&#x81EA;&#x52A8;&#x751F;&#x6210;&#x72B6;&#x6001;&#x7684;&#x5C01;&#x95ED;&#x7CFB;&#x7EDF;&#x8FD0;&#x884C;&#x3002; &#x4E00;&#x4E2A;&#x81EA;&#x521B;&#x751F;&#x7EC4;&#x7EC7;&#x7684;&#x6700;&#x91CD;&#x8981;&#x7684;&#x540E;&#x679C;&#x5728;&#x4E8E;&#xFF0C;&#x7CFB;&#x7EDF;&#x5185;&#x53D1;&#x751F;&#x7684;&#x6240;&#x6709;&#x4E8B;&#x60C5;&#x90FD;&#x4F1A;&#x53D7;&#x5230;&#x81EA;&#x52A8;&#x751F;&#x6210;&#x7684;&#x5F71;&#x54CD;; &#x5426;&#x5219;&#x751F;&#x547D;&#x7CFB;&#x7EDF;&#x5C31;&#x4F1A;&#x5D29;&#x6E83;&#xFF0C;&#x56E0;&#x4E3A;&#x751F;&#x7269;&#x4F53;&#x548C;&#x795E;&#x7ECF;&#x7CFB;&#x7EDF;&#x4EE5;&#x53CA;&#x5A92;&#x4F53;&#x72B6;&#x6001;&#x7684;&#x53D8;&#x5316;&#x4F1A;&#x76F8;&#x4E92;&#x4F5C;&#x7528;&#xFF0C;&#x4ECE;&#x800C;&#x5BFC;&#x81F4;&#x4E0D;&#x65AD;&#x7684;&#x81EA;&#x6211;&#x521B;&#x751F;&#x3002; &#x8FD9;&#x610F;&#x5473;&#x7740;&#x751F;&#x547D;&#x7CFB;&#x7EDF;&#x662F;&#x7531;&#x5B83;&#x4EEC;&#x7684;&#x7ED3;&#x6784;&#x51B3;&#x5B9A;&#x7684;&#xFF08;&#x201C;&#x7ED3;&#x6784;&#x6307;&#x5B9A;&#x201D;&#xFF09;&#xFF0C;&#x5E76;&#x4E14;&#x81EA;&#x751F;&#x6210;&#x4EE3;&#x8868;&#x4E86;&#x5B83;&#x4EEC;&#x7684;&#x6784;&#x6210;&#x5C5E;&#x6027;&#x3002; &#x6839;&#x636E;Maturana&#x7684;&#x89C2;&#x70B9;&#xFF0C;&#x795E;&#x7ECF;&#x7CFB;&#x7EDF;&#x7684;&#x8BA4;&#x77E5;&#x8FC7;&#x7A0B;&#xFF08;&#x884C;&#x4E3A;&#x548C;&#x76F8;&#x4E92;&#x4F5C;&#x7528;&#xFF09;&#x7684;&#x6269;&#x5C55;&#x4F7F;&#x5F97;&#x7B80;&#x5355;&#x5173;&#x7CFB;&#x4E2D;&#x7684;&#x751F;&#x7269;&#x4F53;&#x4E4B;&#x95F4;&#x7684;&#x975E;&#x7269;&#x7406;&#x76F8;&#x4E92;&#x4F5C;&#x7528;&#x6210;&#x4E3A;&#x53EF;&#x80FD;&#xFF0C;&#x4ECE;&#x800C;&#x4FC3;&#x8FDB;&#x4E86;&#x6C9F;&#x901A;&#x3002;[^7]</p>
</li>
<li><p>These non-physical interactions distinguish human beings from organisms that lack a nervous system and in which interactions are purely physical in nature (as in the case of a plant, for example, where the reception of a photon triggers photosynthesis). Communication as interaction is a component of the system, and as a cognitive process does not refer to an autonomous external reality, but is&#x2014;according to Maturana&#x2014;a process of behavioral coordination between the observers through structural coupling. In this way, the cognitive domain is characterized by consensual coordinations of actions that enable operations to take place in many different cognitive domains constituting different realization modes of autopoiesis. [^8]<br>&#x8FD9;&#x4E9B;&#x975E;&#x7269;&#x7406;&#x7684;&#x76F8;&#x4E92;&#x4F5C;&#x7528;&#x5C06;&#x4EBA;&#x7C7B;&#x4E0E;&#x7F3A;&#x4E4F;&#x795E;&#x7ECF;&#x7CFB;&#x7EDF;&#x7684;&#x751F;&#x7269;&#x533A;&#x5206;&#x5F00;&#x6765;&#xFF0C;&#x5E76;&#x4E14;&#x5176;&#x4E2D;&#x76F8;&#x4E92;&#x4F5C;&#x7528;&#x7EAF;&#x7CB9;&#x662F;&#x7269;&#x7406;&#x6027;&#x8D28;&#x7684;&#xFF08;&#x4F8B;&#x5982;&#x690D;&#x7269;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4F8B;&#x5982;&#xFF0C;&#x63A5;&#x6536;&#x5149;&#x5B50;&#x89E6;&#x53D1;&#x5149;&#x5408;&#x4F5C;&#x7528;&#xFF09;&#x3002; &#x4EA4;&#x6D41;&#x4F5C;&#x4E3A;&#x4EA4;&#x4E92;&#x4F5C;&#x7528;&#x662F;&#x7CFB;&#x7EDF;&#x7684;&#x4E00;&#x4E2A;&#x7EC4;&#x6210;&#x90E8;&#x5206;&#xFF0C;&#x800C;&#x8BA4;&#x77E5;&#x8FC7;&#x7A0B;&#x5E76;&#x4E0D;&#x662F;&#x6307;&#x81EA;&#x4E3B;&#x7684;&#x5916;&#x90E8;&#x73B0;&#x5B9E;&#xFF0C;&#x800C;&#x662F; - &#x6839;&#x636E;Maturana - &#x901A;&#x8FC7;&#x7ED3;&#x6784;&#x8026;&#x5408;&#x89C2;&#x5BDF;&#x8005;&#x4E4B;&#x95F4;&#x7684;&#x884C;&#x4E3A;&#x534F;&#x8C03;&#x8FC7;&#x7A0B;&#x3002; &#x901A;&#x8FC7;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#xFF0C;&#x8BA4;&#x77E5;&#x9886;&#x57DF;&#x7684;&#x7279;&#x70B9;&#x662F;&#x534F;&#x8C03;&#x4E00;&#x81F4;&#x7684;&#x884C;&#x4E3A;&#xFF0C;&#x4F7F;&#x884C;&#x52A8;&#x80FD;&#x591F;&#x53D1;&#x751F;&#x5728;&#x6784;&#x6210;&#x81EA;&#x521B;&#x751F;&#x7684;&#x4E0D;&#x540C;&#x5B9E;&#x73B0;&#x6A21;&#x5F0F;&#x7684;&#x8BB8;&#x591A;&#x4E0D;&#x540C;&#x8BA4;&#x77E5;&#x9886;&#x57DF;&#x4E2D;&#x3002;</p>
</li>
<li><p>If one speaks of a &#x2039;world&#x203A; or of &#x2039;our culture,&#x203A; then one would seem to be referring to something external, something independent of humanity, or to &#x2039;an&#x203A; objective reality. Contradicting this view, Constructivist theory holds that an organism creates its world on the basis of its physiological and functional constitution. As Maturana surmises: we create the world by perceiving it.<br>&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x4EBA;&#x8C08;&#x5230;&#x4E00;&#x4E2A;&lt;&#x4E16;&#x754C;&gt;&#x6216;&lt;&#x6211;&#x4EEC;&#x7684;&#x6587;&#x5316;&gt;&#xFF0C;&#x90A3;&#x4E48;&#x4EBA;&#x4EEC;&#x4F3C;&#x4E4E;&#x6307;&#x7684;&#x662F;&#x67D0;&#x79CD;&#x5916;&#x5728;&#x7684;&#xFF0C;&#x72EC;&#x7ACB;&#x4E8E;&#x4EBA;&#x7C7B;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x6216;&#x8005;&#x662F;&#x5BA2;&#x89C2;&#x7684;&#x73B0;&#x5B9E;&#x3002; &#x4E0E;&#x5EFA;&#x6784;&#x4E3B;&#x4E49;&#x7406;&#x8BBA;&#x76F8;&#x53CD;&#x7684;&#x662F;&#xFF0C;&#x5EFA;&#x6784;&#x4E3B;&#x4E49;&#x7406;&#x8BBA;&#x8BA4;&#x4E3A;&#xFF0C;&#x6709;&#x673A;&#x4F53;&#x4EE5;&#x5176;&#x751F;&#x7406;&#x548C;&#x529F;&#x80FD;&#x7ED3;&#x6784;&#x4E3A;&#x57FA;&#x7840;&#x521B;&#x9020;&#x4E86;&#x5B83;&#x7684;&#x4E16;&#x754C;&#x3002; &#x6B63;&#x5982;Maturana&#x6240;&#x731C;&#x6D4B;&#x7684;&#x90A3;&#x6837;&#xFF1A;&#x6211;&#x4EEC;&#x901A;&#x8FC7;&#x611F;&#x77E5;&#x521B;&#x9020;&#x4E16;&#x754C;&#x3002;</p>
</li>
<li><p>Accordingly, three basic conclusions can be formulated from the systemtheoretic perspective. First, it is not permissible to allocate the cognitive phenomena, including language and communication, to any connotative or denotative function of reality which is independent of the observer; second, that which is produced by cultures is the result of interactions between living systems, as well as between living systems and their specific environment (or &#xAB;niche,&#xBB; as Maturana calls it); and, third, neither cultures nor the results, such as art, of creative operations emerge as &#x2039;independent&#x203A; attributes or objective and autonomous realities, but are always dependent on the observer, i.e. on the cognitive system. Therefore they are attributes of the consensual domain in which living systems operate. Only over context- and observer-dependency is it even possible to explain to human perception and cognition the operationality of cognition. [^9] If this finding is transferred to art, then one could join Werner Heisenberg in saying that whatone views is not the work itself, but the work while being exposed to a particular mode of observation.<br>&#x56E0;&#x6B64;&#xFF0C;&#x4ECE;&#x7CFB;&#x7EDF;&#x7406;&#x8BBA;&#x7684;&#x89D2;&#x5EA6;&#x51FA;&#x53D1;&#x53EF;&#x4EE5;&#x5F97;&#x51FA;&#x4E09;&#x4E2A;&#x57FA;&#x672C;&#x7ED3;&#x8BBA;&#x3002;&#x9996;&#x5148;&#xFF0C;&#x4E0D;&#x5141;&#x8BB8;&#x5C06;&#x5305;&#x62EC;&#x8BED;&#x8A00;&#x548C;&#x4EA4;&#x6D41;&#x5728;&#x5185;&#x7684;&#x8BA4;&#x77E5;&#x73B0;&#x8C61;&#x5206;&#x914D;&#x7ED9;&#x4E0E;&#x89C2;&#x5BDF;&#x8005;&#x65E0;&#x5173;&#x7684;&#x4EFB;&#x4F55;&#x5185;&#x9690;&#x6216;&#x5916;&#x5EF6;&#x7684;&#x73B0;&#x5B9E;&#x529F;&#x80FD;;&#x5176;&#x6B21;&#xFF0C;&#x7531;&#x6587;&#x5316;&#x4EA7;&#x751F;&#x7684;&#x4E1C;&#x897F;&#x662F;&#x751F;&#x547D;&#x7CFB;&#x7EDF;&#x4E4B;&#x95F4;&#x4EE5;&#x53CA;&#x751F;&#x547D;&#x7CFB;&#x7EDF;&#x4E0E;&#x5176;&#x7279;&#x5B9A;&#x73AF;&#x5883;&#x4E4B;&#x95F4;&#x76F8;&#x4E92;&#x4F5C;&#x7528;&#x7684;&#x7ED3;&#x679C;&#xFF08;&#x6216;Maturana&#x79F0;&#x4E4B;&#x4E3A;&#x201C;niche&#x201D;&#xFF09;;&#x7B2C;&#x4E09;&#xFF0C;&#x521B;&#x9020;&#x6027;&#x64CD;&#x4F5C;&#x7684;&#x6587;&#x5316;&#x548C;&#x7ED3;&#x679C;&#xFF08;&#x5982;&#x827A;&#x672F;&#xFF09;&#x65E2;&#x4E0D;&#x662F;&#x72EC;&#x7ACB;&#x7684;&#xFF0C;&#x4E5F;&#x4E0D;&#x662F;&#x5BA2;&#x89C2;&#x7684;&#xFF0C;&#x81EA;&#x4E3B;&#x7684;&#x73B0;&#x5B9E;&#xFF0C;&#x800C;&#x662F;&#x59CB;&#x7EC8;&#x4F9D;&#x8D56;&#x4E8E;&#x89C2;&#x5BDF;&#x8005;&#xFF0C;&#x5373;&#x8BA4;&#x77E5;&#x7CFB;&#x7EDF;&#x3002;&#x56E0;&#x6B64;&#x5B83;&#x4EEC;&#x662F;&#x751F;&#x547D;&#x7CFB;&#x7EDF;&#x8FD0;&#x884C;&#x7684;&#x5171;&#x8BC6;&#x9886;&#x57DF;&#x7684;&#x5C5E;&#x6027;&#x3002;&#x53EA;&#x6709;&#x5728;&#x60C5;&#x5883;&#x548C;&#x89C2;&#x5BDF;&#x8005;&#x4F9D;&#x8D56;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x624D;&#x6709;&#x53EF;&#x80FD;&#x5411;&#x4EBA;&#x7C7B;&#x8BA4;&#x77E5;&#x548C;&#x8BA4;&#x77E5;&#x89E3;&#x91CA;&#x8BA4;&#x77E5;&#x7684;&#x64CD;&#x4F5C;&#x6027;&#x3002;&#x5982;&#x679C;&#x8FD9;&#x4E00;&#x53D1;&#x73B0;&#x8F6C;&#x79FB;&#x5230;&#x827A;&#x672F;&#x4E0A;&#xFF0C;&#x90A3;&#x4E48;&#x4EBA;&#x4EEC;&#x53EF;&#x4EE5;&#x52A0;&#x5165;&#x7EF4;&#x5C14;&#x7EB3;&#x6D77;&#x68EE;&#x5821;&#x7684;&#x89C2;&#x70B9;&#xFF0C;&#x5373;&#x4EFB;&#x4F55;&#x4EBA;&#x7684;&#x89C2;&#x70B9;&#x4E0D;&#x662F;&#x4F5C;&#x54C1;&#x672C;&#x8EAB;&#xFF0C;&#x800C;&#x662F;&#x4F5C;&#x54C1;&#x5728;&#x63A5;&#x89E6;&#x67D0;&#x79CD;&#x7279;&#x5B9A;&#x7684;&#x89C2;&#x5BDF;&#x6A21;&#x5F0F;&#x65F6;&#x3002;</p>
</li>
<li><p>Ken Rinaldo&#x2019;s A-life installation &#xAB;Autopoiesis&#xBB; (2000) is an example of the application of organization parameters to interactive art. It assigns an important role to the environment and to the observers, since both intervene in the individual or collective behavior of the robots, as if the latter were biological beings. Rinaldo creates two organizational levels in the interactive installation: an internal process of organization generated by the communicative reciprocal relationship among the robots and independent of the environment; and a system of organization that is based on the intelligent sensors employed and heightens the data-processing capacity by registering the presence of foreign elements and immediately generating feedback. Thus, by means of the technological simulation of artificial life, his work experiments with &#x2039;organic&#x203A; autopoietic mechanisms, and underscores the interdependence of the machines, the function of the viewer, and the close relationship to the environment.<br>Ken Rinaldo&#x7684;A-life&#x88C5;&#x7F6E;&#xAB;Autopoiesis&#xBB;&#xFF08;2000&#xFF09;&#x662F;&#x7EC4;&#x7EC7;&#x53C2;&#x6570;&#x5E94;&#x7528;&#x4E8E;&#x4E92;&#x52A8;&#x827A;&#x672F;&#x7684;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#x3002;&#x5B83;&#x8D4B;&#x4E88;&#x73AF;&#x5883;&#x548C;&#x89C2;&#x5BDF;&#x8005;&#x4E00;&#x4E2A;&#x91CD;&#x8981;&#x7684;&#x89D2;&#x8272;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x90FD;&#x4ECB;&#x5165;&#x673A;&#x5668;&#x4EBA;&#x7684;&#x4E2A;&#x4EBA;&#x6216;&#x96C6;&#x4F53;&#x884C;&#x4E3A;&#xFF0C;&#x5C31;&#x597D;&#x50CF;&#x540E;&#x8005;&#x662F;&#x751F;&#x7269;&#x4E00;&#x6837;&#x3002;&#x91CC;&#x7EB3;&#x5C14;&#x591A;&#x5728;&#x4EA4;&#x4E92;&#x5F0F;&#x5B89;&#x88C5;&#x4E2D;&#x521B;&#x5EFA;&#x4E86;&#x4E24;&#x4E2A;&#x7EC4;&#x7EC7;&#x7EA7;&#x522B;&#xFF1A;&#x4E00;&#x4E2A;&#x7531;&#x673A;&#x5668;&#x4EBA;&#x4E4B;&#x95F4;&#x7684;&#x4EA4;&#x4E92;&#x6027;&#x76F8;&#x4E92;&#x5173;&#x7CFB;&#x4EA7;&#x751F;&#x7684;&#x72EC;&#x7ACB;&#x4E8E;&#x73AF;&#x5883;&#x7684;&#x7EC4;&#x7EC7;&#x5185;&#x90E8;&#x8FC7;&#x7A0B;;&#x4EE5;&#x53CA;&#x57FA;&#x4E8E;&#x6240;&#x4F7F;&#x7528;&#x7684;&#x667A;&#x80FD;&#x4F20;&#x611F;&#x5668;&#x7684;&#x7EC4;&#x7EC7;&#x7CFB;&#x7EDF;&#xFF0C;&#x5E76;&#x901A;&#x8FC7;&#x6CE8;&#x518C;&#x5916;&#x6765;&#x5143;&#x7D20;&#x7684;&#x5B58;&#x5728;&#x5E76;&#x7ACB;&#x5373;&#x751F;&#x6210;&#x53CD;&#x9988;&#x6765;&#x63D0;&#x9AD8;&#x6570;&#x636E;&#x5904;&#x7406;&#x80FD;&#x529B;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x901A;&#x8FC7;&#x5BF9;&#x4EBA;&#x9020;&#x751F;&#x547D;&#x7684;&#x6280;&#x672F;&#x6A21;&#x62DF;&#xFF0C;&#x4ED6;&#x7684;&#x4F5C;&#x54C1;&#x5C1D;&#x8BD5;&#x4E86;&lt;&#x6709;&#x673A;&gt;&#x81EA;&#x52A8;&#x751F;&#x6210;&#x673A;&#x5236;&#xFF0C;&#x5E76;&#x5F3A;&#x8C03;&#x4E86;&#x673A;&#x5668;&#x7684;&#x76F8;&#x4E92;&#x4F9D;&#x8D56;&#x6027;&#xFF0C;&#x89C2;&#x4F17;&#x7684;&#x529F;&#x80FD;&#x4EE5;&#x53CA;&#x4E0E;&#x73AF;&#x5883;&#x7684;&#x5BC6;&#x5207;&#x5173;&#x7CFB;&#x3002;</p>
<div class="video-container"><iframe src="//www.youtube.com/embed/3w53KboB-00" frameborder="0" allowfullscreen></iframe></div>
<p style="text-align:center">&#xAB;Autopoiesis&#xBB;&#xFF08;2000&#xFF09;</p>
</li>
<li><p>Maturana and Varela&#x2019;s model of autopoeisis roused controversy at the same time as they stimulated new approaches to problems of cognitive research. Together with the contributions of Heinz von Foerster and, in the area of cognitive psychology, of Ernst von Glasersfeld, the model delivered impulses for a new current known as Constructivism or Radical Constructivism. This mode of thought is decisive insofar as it negates any possibility of being able to understand systems by means of analytic and reductionist methods, since it acknowledges the principle of self-organization to be fundamental. Man is part of a world of his own construction, and his life depends on the interactions formed by this interlocking system, or network.<br>This model, however, aims to avoid tendencies toward an orthodox Constructivist attitude. The risk of research concentrating on internal and autopoietic processes of neuronal organization consists largely in the fact that their model conception refers to a closed apparatus with no knowledge of the external. The brain can be viewed as an operational, self-referential system in the sense of a purely internal function; in the cognitive system, however, interior and exterior (environment) are interrelated. Theacquisition of knowledge, education and culture is dependent on individual experiences of life.<br>Maturana&#x548C;Varela&#x7684;autopoeisis&#x6A21;&#x578B;&#x5728;&#x6FC0;&#x53D1;&#x5BF9;&#x8BA4;&#x77E5;&#x7814;&#x7A76;&#x95EE;&#x9898;&#x7684;&#x65B0;&#x65B9;&#x6CD5;&#x7684;&#x540C;&#x65F6;&#x6FC0;&#x8D77;&#x4E86;&#x4E89;&#x8BAE;&#x3002;&#x52A0;&#x4E0A;Heinz von Foerster&#x7684;&#x8D21;&#x732E;&#xFF0C;&#x4EE5;&#x53CA;&#x5728;&#x8BA4;&#x77E5;&#x5FC3;&#x7406;&#x5B66;&#x65B9;&#x9762;&#xFF0C;Ernst von Glasersfeld&#x7684;&#x8D21;&#x732E;&#xFF0C;&#x8BE5;&#x6A21;&#x578B;&#x63A8;&#x52A8;&#x4E86;&#x4E00;&#x79CD;&#x79F0;&#x4E3A;&#x5EFA;&#x6784;&#x4E3B;&#x4E49;&#x6216;&#x6FC0;&#x8FDB;&#x5EFA;&#x6784;&#x4E3B;&#x4E49;&#x7684;&#x65B0;&#x6F6E;&#x6D41;&#x3002;&#x8FD9;&#x79CD;&#x601D;&#x7EF4;&#x65B9;&#x5F0F;&#x662F;&#x51B3;&#x5B9A;&#x6027;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x627F;&#x8BA4;&#x81EA;&#x7EC4;&#x7EC7;&#x7684;&#x57FA;&#x672C;&#x539F;&#x5219;&#x662F;&#x5426;&#x80FD;&#x901A;&#x8FC7;&#x5206;&#x6790;&#x548C;&#x8FD8;&#x539F;&#x65B9;&#x6CD5;&#x6765;&#x7406;&#x89E3;&#x7CFB;&#x7EDF;&#x3002;&#x4EBA;&#x662F;&#x4ED6;&#x81EA;&#x5DF1;&#x5EFA;&#x6784;&#x7684;&#x4E16;&#x754C;&#x7684;&#x4E00;&#x90E8;&#x5206;&#xFF0C;&#x4ED6;&#x7684;&#x751F;&#x6D3B;&#x53D6;&#x51B3;&#x4E8E;&#x8FD9;&#x4E2A;&#x4E92;&#x76F8;&#x8FDE;&#x9501;&#x7684;&#x7CFB;&#x7EDF;&#x6216;&#x7F51;&#x7EDC;&#x6240;&#x5F62;&#x6210;&#x7684;&#x76F8;&#x4E92;&#x4F5C;&#x7528;&#x3002;<br>&#x7136;&#x800C;&#xFF0C;&#x8FD9;&#x79CD;&#x6A21;&#x5F0F;&#x65E8;&#x5728;&#x907F;&#x514D;&#x6B63;&#x7EDF;&#x5EFA;&#x6784;&#x4E3B;&#x4E49;&#x6001;&#x5EA6;&#x7684;&#x503E;&#x5411;&#x3002;&#x7814;&#x7A76;&#x96C6;&#x4E2D;&#x4E8E;&#x795E;&#x7ECF;&#x7EC4;&#x7EC7;&#x5185;&#x90E8;&#x548C;&#x81EA;&#x521B;&#x751F;&#x8FC7;&#x7A0B;&#x7684;&#x7814;&#x7A76;&#x98CE;&#x9669;&#x5F88;&#x5927;&#x7A0B;&#x5EA6;&#x4E0A;&#x53D6;&#x51B3;&#x4E8E;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x4E8B;&#x5B9E;&#xFF0C;&#x5373;&#x4ED6;&#x4EEC;&#x7684;&#x6A21;&#x578B;&#x6982;&#x5FF5;&#x6307;&#x7684;&#x662F;&#x4E00;&#x79CD;&#x4E0D;&#x77E5;&#x9053;&#x5916;&#x90E8;&#x56E0;&#x7D20;&#x7684;&#x5C01;&#x95ED;&#x8BBE;&#x5907;&#x3002;&#x5927;&#x8111;&#x53EF;&#x4EE5;&#x88AB;&#x770B;&#x4F5C;&#x7EAF;&#x7CB9;&#x5185;&#x5728;&#x529F;&#x80FD;&#x610F;&#x4E49;&#x4E0A;&#x7684;&#x53EF;&#x64CD;&#x4F5C;&#x7684;&#x81EA;&#x6211;&#x6307;&#x6D89;&#x7CFB;&#x7EDF;;&#x7136;&#x800C;&#xFF0C;&#x5728;&#x8BA4;&#x77E5;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x5185;&#x90E8;&#x548C;&#x5916;&#x90E8;&#xFF08;&#x73AF;&#x5883;&#xFF09;&#x662F;&#x76F8;&#x4E92;&#x5173;&#x8054;&#x7684;&#x3002;&#x83B7;&#x53D6;&#x77E5;&#x8BC6;&#xFF0C;&#x6559;&#x80B2;&#x548C;&#x6587;&#x5316;&#x53D6;&#x51B3;&#x4E8E;&#x4E2A;&#x4EBA;&#x7684;&#x751F;&#x6D3B;&#x7ECF;&#x9A8C;&#x3002;</p>
</li>
<li><p>Selfreferentiality does not mean isolation, since the systems can be influenced from outside, even if the manner of this influence is determined by their functional organization. [^10] Essential to the perception and construction of reality are other processes that produce a model of one&#x2019;s own body (of the ego), and a spatiotemporal model as well as a model of the place in the time-space. The importance for brain activity of the limbic system&#x2014;of the emotional and intentional components&#x2014;makes it clear that the understanding and interpreting of reality are not exclusively the results of neuronal processes.<br>&#x81EA;&#x6211;&#x8BA4;&#x540C;&#x5E76;&#x4E0D;&#x610F;&#x5473;&#x7740;&#x5B64;&#x7ACB;&#xFF0C;&#x56E0;&#x4E3A;&#x5373;&#x4F7F;&#x8FD9;&#x79CD;&#x5F71;&#x54CD;&#x7684;&#x65B9;&#x5F0F;&#x662F;&#x7531;&#x5176;&#x529F;&#x80FD;&#x7EC4;&#x7EC7;&#x51B3;&#x5B9A;&#x7684;&#xFF0C;&#x7CFB;&#x7EDF;&#x4E5F;&#x53EF;&#x80FD;&#x53D7;&#x5230;&#x5916;&#x754C;&#x7684;&#x5F71;&#x54CD;&#x3002; [^ 10]&#x5BF9;&#x73B0;&#x5B9E;&#x7684;&#x611F;&#x77E5;&#x548C;&#x5EFA;&#x6784;&#x7684;&#x57FA;&#x672C;&#x8981;&#x7D20;&#x662F;&#x4EA7;&#x751F;&#x81EA;&#x5DF1;&#x7684;&#x8EAB;&#x4F53;&#x6A21;&#x578B;&#xFF08;&#x81EA;&#x6211;&#x7684;&#x6A21;&#x578B;&#xFF09;&#xFF0C;&#x4EE5;&#x53CA;&#x65F6;&#x7A7A;&#x6A21;&#x578B;&#x548C;&#x65F6;&#x7A7A;&#x4F4D;&#x7F6E;&#x6A21;&#x578B;(Essential to the perception and construction of reality are other processes that produce a model of one&#x2019;s own body (of the ego), and a spatiotemporal model as well as a model of the place in the time-space. )&#x3002; &#x8FB9;&#x7F18;&#x7CFB;&#x7EDF;&#x7684;&#x5927;&#x8111;&#x6D3B;&#x52A8;&#x7684;&#x91CD;&#x8981;&#x6027; - &#x60C5;&#x611F;&#x548C;&#x610F;&#x56FE;&#x7684;&#x7EC4;&#x6210;&#x90E8;&#x5206; - &#x660E;&#x786E;&#x5730;&#x8868;&#x660E;&#xFF0C;&#x5BF9;&#x73B0;&#x5B9E;&#x7684;&#x7406;&#x89E3;&#x548C;&#x89E3;&#x91CA;&#x4E0D;&#x5B8C;&#x5168;&#x662F;&#x795E;&#x7ECF;&#x8FC7;&#x7A0B;&#x7684;&#x7ED3;&#x679C;&#x3002;</p>
</li>
<li><p>That which is experienced as reality is socially conditioned, for its construction rests on interaction with other individuals, on consensual domains, on language and culture. In summary it can be said that knowledge is a creative process that depends both on cognition and on interpersonal relationships and interactions with the environment: thus the entirety of knowledge, culture and art is based on the consensus, interactions and networking of individuals constituting society.<br>&#x90A3;&#x4E9B;&#x88AB;&#x8BA4;&#x4E3A;&#x662F;&#x73B0;&#x5B9E;&#x7684;&#x4E1C;&#x897F;&#x662F;&#x793E;&#x4F1A;&#x6761;&#x4EF6;&#x6027;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x7684;&#x6784;&#x5EFA;&#x4F9D;&#x8D56;&#x4E8E;&#x4E0E;&#x5176;&#x4ED6;&#x4E2A;&#x4EBA;&#x4E4B;&#x95F4;&#x7684;&#x4E92;&#x52A8;&#xFF0C;&#x57FA;&#x4E8E;&#x5171;&#x8BC6;&#x7684;&#x9886;&#x57DF;&#xFF0C;&#x8BED;&#x8A00;&#x548C;&#x6587;&#x5316;&#x3002; &#x603B;&#x4E4B;&#xFF0C;&#x53EF;&#x4EE5;&#x8BF4;&#x77E5;&#x8BC6;&#x662F;&#x4E00;&#x4E2A;&#x521B;&#x9020;&#x6027;&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x65E2;&#x4F9D;&#x8D56;&#x4E8E;&#x8BA4;&#x77E5;&#xFF0C;&#x4E5F;&#x4F9D;&#x8D56;&#x4E8E;&#x4EBA;&#x9645;&#x5173;&#x7CFB;&#x548C;&#x4E0E;&#x73AF;&#x5883;&#x7684;&#x76F8;&#x4E92;&#x4F5C;&#x7528;&#xFF1A;&#x56E0;&#x6B64;&#xFF0C;&#x77E5;&#x8BC6;&#xFF0C;&#x6587;&#x5316;&#x548C;&#x827A;&#x672F;&#x7684;&#x6574;&#x4F53;&#x57FA;&#x4E8E;&#x6784;&#x6210;&#x793E;&#x4F1A;&#x7684;&#x4E2A;&#x4EBA;&#x7684;&#x5171;&#x8BC6;&#xFF0C;&#x4E92;&#x52A8;&#x548C;&#x7F51;&#x7EDC;&#x3002;</p>
<h3 id="Media-art-as-intercommunicative-process"><a href="#Media-art-as-intercommunicative-process" class="headerlink" title="Media art as intercommunicative process"></a>Media art as intercommunicative process</h3><p>&#x5A92;&#x4F53;&#x827A;&#x672F;&#x662F;&#x4E92;&#x52A8;&#x7684;&#x8FC7;&#x7A0B;</p>
</li>
<li><p>Albert Einstein once stated that scientific theories are free creations of the human mind, and that he considered it to be the most wonderful thing to be able to use them, nevertheless, to explain the world. The same might be said of art. As a free creation of the human mind, it does not explain an independent world; rather, it takes issue with the experience of the subject in his world, and offers various explanatory models for a context in which the observer and the work partake.<br>&#x963F;&#x5C14;&#x4F2F;&#x7279;&#x7231;&#x56E0;&#x65AF;&#x5766;&#x66FE;&#x7ECF;&#x8BF4;&#x8FC7;&#xFF0C;&#x79D1;&#x5B66;&#x7406;&#x8BBA;&#x662F;&#x4EBA;&#x7C7B;&#x601D;&#x60F3;&#x7684;&#x81EA;&#x7531;&#x521B;&#x9020;&#xFF0C;&#x5E76;&#x4E14;&#x4ED6;&#x8BA4;&#x4E3A;&#x80FD;&#x591F;&#x4F7F;&#x7528;&#x5B83;&#x4EEC;&#x662F;&#x6700;&#x5947;&#x5999;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x4F46;&#x662F;&#x5B83;&#x53EF;&#x4EE5;&#x89E3;&#x91CA;&#x4E16;&#x754C;&#x3002; &#x827A;&#x672F;&#x4E5F;&#x662F;&#x5982;&#x6B64;&#x3002; &#x4F5C;&#x4E3A;&#x4EBA;&#x7C7B;&#x601D;&#x60F3;&#x7684;&#x81EA;&#x7531;&#x521B;&#x9020;&#xFF0C;&#x5B83;&#x4E0D;&#x80FD;&#x89E3;&#x91CA;&#x4E00;&#x4E2A;&#x72EC;&#x7ACB;&#x7684;&#x4E16;&#x754C;; &#x76F8;&#x53CD;&#xFF0C;&#x5B83;&#x5728;&#x4ED6;&#x7684;&#x4E16;&#x754C;&#x4E2D;&#x5BF9;&#x4E3B;&#x4F53;&#x7684;&#x7ECF;&#x9A8C;&#x63D0;&#x51FA;&#x4E86;&#x95EE;&#x9898;&#xFF0C;&#x5E76;&#x4E3A;&#x89C2;&#x5BDF;&#x8005;&#x548C;&#x5DE5;&#x4F5C;&#x53C2;&#x4E0E;&#x8005;&#x7684;&#x60C5;&#x5883;&#x63D0;&#x4F9B;&#x4E86;&#x5404;&#x79CD;&#x89E3;&#x91CA;&#x6A21;&#x578B;&#x3002;</p>
</li>
<li><p>Vil&#xE9;m Flusser&#x2019;s thesis states that the function of art is to create other worlds and to enable access to other realities. Anyone who produces a work of art not only expresses with it a part of himself and his environment, but also brings about a dialogue with other observers and a projection of other realities. Because art commits itself to this process, changing the world&#x2014;expanding human realities (knowledge, experiences, sensations or perceptions)&#x2014; becomes its cause.</p>
</li>
<li><p>From this perspective, every reality is based on experiences and actions of the creator as well as of the viewer, and is thus one argument in a (possible) explanation. As an operation within a consensual domain, the dialogic process can expand this domain and contribute to the emergence of new consensual domains, leading to an expansion of experiences, knowledge and arguments, which can potentially result in an altered cognitive horizon. Accordingly, as a form of communication, art must be ascribed to the domain of cognition that creates the prerequisites of communication. &#xAB;Thought, science and art are selfreferential cognitive processes, but they are not self-maintaining: they need the physical-chemical existence of organisms that bring forth cognition, and with it thought, science and art. Whereas autopoietic systems can invariably carry out self-maintenance only in the physical-chemical framework preordained by their environment, cognitive processes are free from these restrictions and obey only internal laws and exigencies.&#xBB; [^11]</p>
</li>
<li><p>In the art domain, therefore, reference to knowledge does not mean an approach to its possible contents exclusively on the basis of reason; rather, the intention is to emphasize that the co-influence of emotions and sensory experiences in the process of assimilating a work of art is an inseparable part of the dialogic process.</p>
</li>
<li><p>In summary, two hypotheses can be set up. One is that since explanations of art are not constitutive, reductionist or transcendental, it is by no means a matter of the search for a single and definitive explanation for the domain of art. The other is that the function of art consists in changing the world, with the latter being understood to mean the expansions of human realities and cognitive domains, and consequently also of the knowledge and experiences resulting from possible interactions and the dialogic exchange in the explanatory context of the cognitive worlds. This leads to the question of how art can execute the communicative process.</p>
</li>
<li><p>The branch of aesthetics more closely modeled on communication science examines social processes that develop expressive forms as well as phenomena of aesthetic expression fulfilling communicative functions (communication media, events, or social ceremonies).In art it is possible to distinguish among various modes of proceeding by which the problematic of communication is tackled: through the role of the viewer in the context of the work, through the analysis of the reception, or&#x2014;as proposed for instance by Fred Forest and the proponents of &#x2039;communication aesthetics&#x203A;&#x2014;from sociological viewpoints concerned with the influence of art on viewer, society or culture.</p>
</li>
<li><p>Art is an especially complex socio-cultural domain because in the process of communication it avails itself of a mainly metaphoric, symbolic and non-trivial language. If there are several domains of reality, and all of them are equally valid, the theories of art aesthetics cannot individually lay claim to universal acceptance; nor can they be viewed as inherent to the object. Sense and meaning do not lie in the work of art itself, and cannot be conveyed through the latter in the expectation that the work will be adequately interpreted. In art, meanings are time-bound, culture-specific, observer-dependent cognitive processes; therefore, works of art cannot speak for themselves.</p>
</li>
<li><p>A work of art should indeed invite the observer to enter its domain of reality and take an interest in its view of the world. If one viewer, or a group of viewers, is led to new consensual domains by a work of art, and hence to new cognition, then not only the creative act has been accomplished successfully, but communication has been, too: the spreading of a world-view to a community. Although art-works and communication are separate domains, neither works of art nor systems of art can exist without communication, no more so than art-communication is possible without art; accordingly, art-works serve the coupling of cognition and communication. [^12] This amounts to a new theoretical position that deviates from the cybernetic model.</p>
</li>
<li><p>Communication is no longer understood to mean the transmission of information, and nor is it seen as the transmission of knowledge from one system to another. It replaces the information-technical principle of communication with the model of the construction process within the cognitive systems and between systems. [^13] This process-oriented perspective is observer-dependent, i.e. as part of a network of social systems, every observer or observer community co-constitutessystems, and these naturally include art systems among others. Orientation has shifted from information objectivity to intersubjective interactivity.</p>
</li>
<li><p>One consequence is that art is becoming a kind of &#xAB;catalyst of society&#x2019;s cultural reflection.&#xBB; [^14] Proposals representing a threat to the existence of a consensus-based cognitive domain can meet with strong emotional rejection within the cultural community. By contrast, twentieth-century art offers countless examples of cases in which with the aid of intentional polemics cognition domains were expanded through the institution of &#x2039;art&#x203A; being forced to criticize itself.</p>
</li>
<li><p>The meaning of art and its aesthetics is to be sought in the function it exercises within the given observer communities, as well as in its ability to bring about by means of a language of its own an emotional and conceptual dialogue with the observer and the community.</p>
<h3 id="Interactivity-the-interface-question"><a href="#Interactivity-the-interface-question" class="headerlink" title="Interactivity: the interface question"></a>Interactivity: the interface question</h3><p>Just as people need the media for communication, technical interfaces enable different systems to be linked. It is a matter thereby of reducing spatio-temporal distances and of optimizing the response time and flexibility of the connection. The resultant re-definition of the positions adopted by both systems&#x2014;subject and machine&#x2014;influences the communication process. On the one hand, the subject is no longer merely an operator controlling a tool; on the other hand, the machine undergoes constant growth in regard to the independence of its functioning&#x2014;in other words, it is no longer a &#x2039;simple&#x203A; tool in the traditional sense.</p>
</li>
<li><p>This gradual assimilation of the position and weighting in the humanmachine communication process [^15] is clearly evident in the &#xAB;Interface Model&#xBB; of William Bricken. [^16] With it he attempts to minimize the distance between the systems (A) and (B) and at the same time to demonstrate the reciprocal influence exercised on the agents by the interaction processes. This means that every transmission of information influences and defines the linked systems. In &#xAB;Interface Model 4&#xBB; Bricken introduces a further factor: the context. According to Bricken the interface boundaryrepresents the knowledge of the interaction environment on the part of the interacting agents. On being introduced into the interaction process, the parameter of context becomes an influencing factor in the communication process. Context is a component of the interaction between two systems in the measure which they share this parameter, but can be altered in the course of the process.</p>
<h3 id="Context-and-environment"><a href="#Context-and-environment" class="headerlink" title="Context and environment"></a>Context and environment</h3></li>
<li><p>The position of Niklas Luhmann must be recalled to mind in regard to the factors of context/environment. System theory abandoned the idea of a totality constituted of parts in order to introduce the explicit reference to the environment. Luhmann goes one step further by making the structures and processes of a system dependent on their relationships to a specific environment, indicating that these structures and processes are comprehensible only in relation to this environment. This mutual dependence declares that one cannot design or create an interactive system in isolated form, since as a completed element it would a posteriori adapt to a random environment. &#xAB;Systems of interaction are formed when the presence of people is used to solve through communication the problem of dual contingency. Presence brings with it perceptibility, and insofar structural coupling to communicatively not controllable consciousness processes.&#xBB; [^17]<br>Communication, in Luhmann&#x2019;s view, is in real life an environmentadapted operation. This adaptation, however, is not completely controllable in terms of cognition or, put differently, no communication is capable of checking every single step of the process.</p>
</li>
<li><p>Alongside context/environment, time is another significant point of reference both from the perspective of optimizing interaction and recursivity as well as in regard to the response times between two systems. The endeavor to optimize the human-machine interaction process and the response times involved led to an enhancement of the visualization and sensorial perception of computer-processed information.</p>
<h3 id="Translation"><a href="#Translation" class="headerlink" title="Translation"></a>Translation</h3></li>
<li><p>A further, crucial question is aimed directly at the notion of translation. Abraham A. Moles had already addressed the subject of &#x2039;translation&#x203A; [^18] as one of the main factors in the human-machine relationship. From the technical viewpoint the interface assumes the function of translating and conveying information between two interconnected systems. As Halbach emphasizes, the problem lies precisely in the notion of &#x2039;translation,&#x203A; because not only does it connect various input and output channels, it also regulates and communicates various coding methods. &#xAB;When it is a matter of interfaces of human-machine interaction, then (a) input and output channels cannot be adjusted to each other, since they are precisely what a human being, as an autopoietic system, does not possess, and (b) is it not possible to speak of a translation of the coding method, since the subsymbolic representation forms of the human nervous have not (yet) been decrypted.&#xBB; [^19]<br>Due to the employment of technical media, interaction based on a human-machine interface denotes a qualitative expansion of communication computer displays and interfaces function as control mechanisms that maintain the equivalence of communication. For this reason, control&#x2014;conscious or unconscious&#x2014;is among the most relevant research tasks in the area of interactive systems.</p>
</li>
<li><p>Today&#x2019;s systems convey to the user impressions or sensations that are only partially attributable to his own sensory or motor activities, since the possibilities of interaction and the generation of outputs (for instance, moving three-dimensional images, or sound) are determined by the particular program constituting the user&#x2019;s field of action. In the measure to which the user cannot completely control the cognitive processes of interactive communication in the simulated environment, part of the control must necessarily be exercised by the system itself.</p>
<h3 id="Models-of-interactive-systems"><a href="#Models-of-interactive-systems" class="headerlink" title="Models of interactive systems"></a>Models of interactive systems</h3></li>
<li><p>The actions of the observer thus exercise a fundamental and complementary function in interactive systems. The resultant need for synchronous humanmachine reactions, and the interdependence between the context of the subject and that of the systemenvironment, lead to the question of the different typologies of interactive systems and their strategies.</p>
</li>
<li><p>Various works of media art deploying reactive systems and digital images at the same time directly or indirectly investigate the changes that the observer, by means of data manipulation over interfaces, can bring about in the work. Three models of interactive system can be roughly distinguished on the basis of media-assisted forms of interactivity: [^20]<br>&#x2014; Discrete or active systems: although the user can control the content called up, and the sequence in which this occurs, he/she has no influence on the transmitted information, since the management of this information, which demonstrates predictable behavior, is integrated.<br>&#x2014; Reactive systems: the work&#x2019;s behavior, which is media-assisted and based on feedback structures, results from the direct reaction to external stimuli, for instance user control or altered environmental conditions. Selection methods and recursive events create cognitive situations for the participative user.<br>&#x2014; Interactive systems: open program structuring, over which the receiver can also act as transmitter. Since the user can influence the procedure and appearance of the work, or even add new information in the case of more complex systems, it is a matter of content-related interactivity. Temporal, spatial, or content-based relations are established between interactor and work.</p>
</li>
<li><p>Heinz von Foerster makes a distinction between trivial and non-trivial machines in regard to technical specificity. Trivial machines are causally describable and predictable, and conceivable only in non-physical areas such as mathematics. Machines in physical space are always non-trivial, since this space is subject to entropic processes. Two types of non-trivial machines can be distinguished: those which attempt to adjust their behavior to the trivial machines, and those which behave non-trivially. The former are purposeoriented machines, the latter are ones which are potentially suitable for interactivity. [^21]</p>
</li>
<li><p>According to Peter Weibel three different models of interactivity can be drawn up from the viewpoints of behavior and consciousness: synaesthetic interactivity, which consists of interactivity between variousmaterials and elements, such as image and sound, color and music; synergetic interactivity, which takes place between states of energy, as in works that react to changes in their environment; and communicative or kinetic interactivity between different people and between persons and objects.<br>In all cases, environment or context are of crucial importance to the human-machine performance. As stated already, the integration of context into the interactivity process means acknowledging it as a conditioning factor in the communication process. Peter Weibel reflects upon the relationship of dependence between observer and context in his interactive installation &#xAB;Cartesian Chaos&#xBB; of 1992.</p>
<h3 id="Art-system"><a href="#Art-system" class="headerlink" title="Art/system"></a>Art/system</h3></li>
<li><p>Interactivity in art is therefore composed, as Peter Weibel proposes, of three digital characteristics: virtuality, variability, and viability.[^22] On the other hand, the human-machine interface attests to the transformation of a culture based on narratively logocentric and sequential structures into a &#x2039;digital culture&#x203A; that is visual, sensory, retroactive and nonlinear (hypertextual) in orientation. The special potentiality of digital technology (including the telematic) is applied in order to overcome the boundaries of the purely instrumental and so accomplish the transformation into a medium of the imaginary generating cognitively and sensorially experiencable (virtual) environments.</p>
</li>
<li><p>On the basis of all these factors associated with media art in general and with interactive art in particular, a crucial shift in the meaning of &#x2039;art&#x203A; towards that of &#x2039;system&#x203A;[^23] is clearly discernible (without wanting to simply replace one term with another).</p>
</li>
<li><p>The analysis of interactive systems leads to the conclusion that the interest lies no longer in the production of a work of art that reflects upon world- views through the reproduction or interpretation of ways of seeing, but that the work of art, as a &#x2039;system,&#x203A; attempts to scrutinize the world itself: the realities, the contexts, the life, the biological system of humanity. It is a system that opens up new &#x2039;world-views.&#x203A; Contemporary art creation assisted by processbased methods and systemic models is gainingnew significance in the sociocultural context, and thereby contradicting art&#x2019;s postulated loss of function in the present-day world. Moreover, the idiosyncrasy of the process as well as the interactive and systemic character of the work produced inevitably entails a transformation of aesthetic paradigms.</p>
</li>
<li><p>The systemic practices based on the use of interactive technologies demand an aesthetic theory appropriate to their methods. Endo-physics, which is closely linked with Constructivism, hereby offers ideal foundations for concepts inspiring proposals for an &#xAB;endo-aesthetics,&#xBB;[^24]a theory considered to be suitable for recording the different manifestations of interactive and artificial systems.<br>Translation by Tom Morrison<br><a href="https://hackmd.io/FJJo8niERte-bt4mvpE3cQ" rel="external nofollow noopener noreferrer" target="_blank">&#x5168;&#x7F51;&#x534F;&#x4F5C;</a></p>
</li>
</ol>
<p>[^1]: Alexander Bogdanov, Tektolog&#xED;a, published in three volumes in Russia between 1912 and 1917.<br>[^2]: Little notice was taken of Bogdanov&#x2019;s writings during his lifetime, however, and the lack of promulgation meant that it was the Austrian biologist Ludwig von Bertalanffy&#x2019;s ideas in regard to general system theory which turned into a scientific current the transformation of systemic thought. See Ludwig von Bertalanffy, &#xAB;Der Organismus als physikalisches System betrachtet,&#xBB; in Die Naturwissenschaften, Bd. 28, 1940, pp. 521&#x2013;531; &#xAB;The Theory of Open Systems in Physics and Biology,&#xBB; in Science, vol. 111, 1950, pp. 23&#x2013;29; General System Theory, New York, 1968.<br>[^3]: Like, for example, Ilya Prigogine and dissipative structures; Manfred Eigen and hyper-cycles; Hermann Haken and laser theory.<br>[^4]: &#x2039;Autopoiesis&#x203A;&#x2014;from the Greek &#x2039;auto&#x203A; (self) and &#x2039;poiein&#x203A; (shaping)&#x2014;means &#x2039;self-shaping.&#x203A;<br>[^5]: &#xAB;The nervous system is a closed network of interacting active neuronal elements (neurons, effectors and receptors) that are structurally realized as cellular components of the organism. As such, it operates as a closed network of changing relations of activity between its components; that is, it is constitutive to the organization of the nervous system that any change of relations of activity between its components leads to further changes of relations of activity between them, and that in that sense it operates without inputs or outputs. Therefore, any action upon an environment that an observer sees as a result of the operation of the nervous system is a feature of the structural changes that take place in the nervous system as a cellular network, and not a feature of its operation as such.&#xBB; Humberto Maturana, &#xAB;Ontology of Observing. The biological foundations of self consciousness and the physical domain of existence&#xBB; in chapter 9 &#xAB;Consequences&#xBB;. See Humberto Maturana and Francisco Varela, Autopoiesis and Cognition: The Realization of the Living, Boston, 1980.<br>[^6]: &#xAB;In the distinction of living systems, this distinction as entities engaged as adequate action consists in bringing them forth (in the praxis of living of the observer), both in conservation of autopoiesis and of adaptation and as a moment in their ontongenic drift in a medium. In other words, I have shown that for any particular circumstance of distinction of a living system, conservation of living (conservation of autopiesis and of adaptation) constitutes adequate action in those circumstances, and, hence, knowledge: living systems are cognitive systems, and to live is to know.&#xBB; Humberto Maturana, &#xAB;Ontology of Observing. The biological foundations of self consciousness and the physical domain of existence&#xBB; in chapter 8 &#xAB;Consequences&#xBB;. See Humberto Maturana<br>[^7]: Humberto Maturana, La realidad: &#xBF;objetiva o construida? II, Barcelona,1996, p. 214. Cf. Humberto Maturana and Francisco J. Varela, The Tree of Knowledge: The Biological Roots of Human Understanding, Boston, 1987.<br>[8] Humberto Maturana, &#xAB;Kognition,&#xBB; in Der Diskurs des Radikalen Konstruktivismus, Siegfried J. Schmidt (ed.), Frankfurt-on-Main, 1987, p. 114. See Humberto Maturana and Francisco Varela, Autopoiesis and Cognition: The Realization of the Living, Boston, 1980.<br>[^9]: Humberto Maturana, &#xAB;Kognition,&#xBB; in Der Diskurs des Radikalen Konstruktivismus, Siegfried J. Schmidt (ed.), Frankfurt/Main, 1987, pp. 89&#x2013;118.<br>[^10]: Cf. Gerhard Roth, &#xAB;Erkenntnis und Realit&#xE4;t: Das reale Gehirn und seine Wirklichkeit,&#xBB; in Der Diskurs des Radikalen Konstruktivismus, Siegfried J. Schmidt (ed.), Frankfurt/Main, 1987, p. 241. This would be one of the counter-arguments to Maturana&#x2019;s assertion that cognitive systems are autopoietic (cf. Humberto Maturana, &#xAB;Kognition,&#xBB; in Der Diskurs des Radikalen<br>[^11]: Gerhard Roth, &#xAB;Autopoise und Kognition: Die Theorie H. R. Maturanas und die Notwendigkeit ihrer Weiterentwicklung&#xBB;, in Der Diskurs des Radikalen Konstruktivismus, Siegfried J. Schmidt (ed.), Frankfurt/Main, 1987, p. 282.<br>[^12]: Cf. Siegfried J. Schmidt, Kalte Faszination, Weilerswist, 2000, p. 297.<br>[13] Cf. Erich Jantsch, &#xAB;Erkenntnistheoretische Aspekte der Selbstorganisation nat&#xFC;rlicher Systeme&#xBB; in Der Diskurs des Radikalen Konstruktivismus, Siegfried J. Schmidt (ed.), Frankfurton- Main, 1987, p. 170.<br>[^14]: Siegfried J. Schmidt, Kalte Faszination, Weilerswist, 2000, p. 288.<br>[^15]: Cf. the text section on &#xAB;Man&#x2013;Machine&#x2013;Communication&#xBB; in Claudia Giannetti, &#xAB;Art, Science, and Technology.&#xBB;<br>[^16]: William Bricken, &#xAB;An Interface Model,&#xBB; internal paper of ATARI Systems Research, Ms (draft), 1983, p. 5, cited after Wulf R. Halbach, Interfaces: Medien- und kommunikationstheoretische Elemente einer Interface-Theorie, Munich, 1994, p. 161.<br>[^17]: Niklas Luhmann, Die Gesellschaft der Gesellschaft, Frankfurt-on-Main, 1997, p. 814.<br>[^18]: Cf. Claudia Giannetti, &#xAB;Information Aesthetics.&#xBB;<br>[^19]: Wulf R. Halbach, Interfaces: Medien- und kommunikationstheoretische Elemente einer Interface-Theorie, Munich, 1994, p. 166.<br>[^20]: For further suggestions see Fran&#xE7;oise Holtz-Bonneau, L&#x2019;image et l&#x2019;ordinateur, Paris, 1986.<br>[^21]: See Peter Krieg, &#xAB;Versuch &#xFC;ber Interaktion und Medien,&#xBB; in K&#xFC;nstliche Spiele, Georg Hartwagner et al. (eds), Munich, 1993, pp. 180&#x2013;181.<br>[^22]: See Peter Weibel, &#xAB;The Unreasonable Effectiveness of the Methodological Convergence of Art and Science,&#xBB; in Art @ Science, Christa Sommerer/Laurent Mignonneau (eds), Vienna/New York, 1998.<br>[^23]: Fred Forest wrote in 1985: &#xAB;Replacer l&#x2019;art, aujourd&#x2019;hui, dans les syst&#xE8;mes situ&#xE9;s aux divers niveaux d&#x2019;organisation de la r&#xE9;alit&#xE9;, en faisant sauter les cloisonnements disciplinaires, me para&#xEE;t une t&#xE2;che n&#xE9;cessaire et &#xE0; la fois en&#xE9;vitable.&#xBB; See Fred Forest, &#xAB;Manifeste pour une esth&#xE9;tique de la communication&#xBB; in Esth&#xE9;tique des Arts M&#xE9;diatiques, Louise Poissant (ed.), Qu&#xE9;bec, 1995, p. 36. In the catalog for the Interactive Media Festival, San Francisco, 1995, Roy Ascott replaced the notion of art with that of the system. Besides Weibel cf. also Louis Bec.<br>[^24]: Cf. also the text section &#xAB;Principles of endo-physics&#xBB; in Claudia Giannetti, &#xAB;Endoaesthetics.&#xBB;<br>&#xA9; Media Art Net 2004</p>

    
    </div>
    
    
</article>




    
        <article class="article content gallery" itemscope="" itemprop="blogPost">
    <h1 class="article-title is-size-3 is-size-4-mobile" itemprop="name">
        
            <a href="/2018/11/10/艺术，科学和技术/" itemprop="url">艺术，科学与技术</a>
        
    </h1>
    <div class="article-meta columns is-variable is-1 is-multiline is-mobile is-size-7-mobile">
        <span class="column is-narrow">
            <time datetime="2018-11-10T12:15:41.000Z" itemprop="datePublished">11月 10 2018</time>
        </span>
        
        
        <span class="column is-narrow">
            
            
            1 小时 读完 (约 8080 字)
        </span>
        
    </div>
    <div class="article-entry is-size-6-mobile" itemprop="articleBody">
    
        <h1 id="ART-SCIENCE-AND-TECHNOLOGY&#x827A;&#x672F;&#xFF0C;&#x79D1;&#x5B66;&#xFF0C;&#x548C;&#x6280;&#x672F;"><a href="#ART-SCIENCE-AND-TECHNOLOGY&#x827A;&#x672F;&#xFF0C;&#x79D1;&#x5B66;&#xFF0C;&#x548C;&#x6280;&#x672F;" class="headerlink" title="ART, SCIENCE, AND TECHNOLOGY&#x827A;&#x672F;&#xFF0C;&#x79D1;&#x5B66;&#xFF0C;&#x548C;&#x6280;&#x672F;"></a>ART, SCIENCE, AND TECHNOLOGY&#x827A;&#x672F;&#xFF0C;&#x79D1;&#x5B66;&#xFF0C;&#x548C;&#x6280;&#x672F;</h1>
        <p class="article-more-link">
            <a href="/2018/11/10/艺术，科学和技术/#more">阅读更多</a>
        </p>
    
    </div>
    
    
</article>




    
    
    </div>
</section>
    <footer class="footer">
    <div class="container">
        <div class="columns content">
            <div class="column is-narrow has-text-centered">
                &copy; 2019 liudixian&nbsp;
                Powered by <a href="http://hexo.io/" target="_blank" rel="external nofollow noopener noreferrer">Hexo</a> & <a href="http://github.com/ppoffice/hexo-theme-minos" rel="external nofollow noopener noreferrer" target="_blank">Minos</a>
            </div>
            <div class="column is-hidden-mobile"></div>

            
            <div class="column is-narrow">
                <div class="columns is-mobile is-multiline is-centered">
                
                    
                <a class="column is-narrow has-text-black" title="GitHub" href="https://github.com/ppoffice/hexo-theme-minos" rel="external nofollow noopener noreferrer" target="_blank">
                    
                    GitHub
                    
                </a>
                
                </div>
            </div>
            
            
<div class="column is-narrow has-text-centered">
    <div class="dropdown is-up is-right is-hoverable" style="margin-top: -0.2em;">
        <div class="dropdown-trigger">
            <button class="button is-small" aria-haspopup="true" aria-controls="dropdown-menu7">
                <span class="icon">
                    <i class="fas fa-globe"></i>
                </span>
                <span>简体中文</span>
                <span class="icon is-small">
            <i class="fas fa-angle-down" aria-hidden="true"></i>
          </span>
            </button>
        </div>
        <div class="dropdown-menu has-text-left" role="menu">
            <div class="dropdown-content">
            
                <a href="/tags/MediaArtNetII/index.html" class="dropdown-item">
                    简体中文
                </a>
            
                <a href="/en/tags/MediaArtNetII/index.html" class="dropdown-item">
                    English
                </a>
            
            </div>
        </div>
    </div>
</div>

        </div>
    </div>
</footer>
    <script src="//cdnjs.cloudflare.com/ajax/libs/jquery/3.3.1/jquery.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/moment.js/2.22.2/moment-with-locales.min.js"></script>

<!-- test if the browser is outdated -->
<div id="outdated">
    <h6>Your browser is out-of-date!</h6>
    <p>Update your browser to view this website correctly. <a id="btnUpdateBrowser" href="http://outdatedbrowser.com/" rel="external nofollow noopener noreferrer" target="_blank">Update my browser now </a></p>
    <p class="last"><a href="#" id="btnCloseUpdateBrowser" title="Close">&times;</a></p>
</div>
<script src="//cdnjs.cloudflare.com/ajax/libs/outdated-browser/1.1.5/outdatedbrowser.min.js"></script>
<script>
    $(document).ready(function () {
        // plugin function, place inside DOM ready function
        outdatedBrowser({
            bgColor: '#f25648',
            color: '#ffffff',
            lowerThan: 'flex'
        })
    });
</script>

<script>
    window.FontAwesomeConfig = {
        searchPseudoElements: true
    }
    moment.locale("zh-CN");
</script>


    
    
<script src="https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.4/MathJax.js?config=TeX-MML-AM_CHTML"></script>
<script>
    MathJax.Hub.Config({
        "HTML-CSS": {
            matchFontHeight: false
        },
        SVG: {
            matchFontHeight: false
        },
        CommonHTML: {
            matchFontHeight: false
        },
        tex2jax: {
            inlineMath: [
                ['$','$'],
                ['\\(','\\)']
            ]
        }
    });
</script>

    
    
    
    
<script src="//cdnjs.cloudflare.com/ajax/libs/lightgallery/1.6.8/js/lightgallery-all.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/justifiedGallery/3.6.5/js/jquery.justifiedGallery.min.js"></script>
<script>
    (function ($) {
        $(document).ready(function () {
            if (typeof($.fn.lightGallery) === 'function') {
                $('.article.gallery').lightGallery({ selector: '.gallery-item' });
            }
            if (typeof($.fn.justifiedGallery) === 'function') {
                $('.justified-gallery').justifiedGallery();
            }
        });
    })(jQuery);
</script>

    
    
    <script src="https://cdnjs.cloudflare.com/ajax/libs/clipboard.js/2.0.0/clipboard.min.js"></script>
    <style>
        .hljs {
            position: relative;
        }

        .hljs .clipboard-btn {
            float: right;
            color: #9a9a9a;
            background: none;
            border: none;
            cursor: pointer;
        }

        .hljs .clipboard-btn:hover {
          color: #8a8a8a;
        }

        .hljs > .clipboard-btn {
            display: none;
            position: absolute;
            right: 4px;
            top: 4px;
        }

        .hljs:hover > .clipboard-btn {
            display: inline;
        }

        .hljs > figcaption > .clipboard-btn {
            margin-right: 4px;
        }
    </style>
    <script>
      $(document).ready(function () {
        $('figure.hljs').each(function(i, figure) {
          var codeId = 'code-' + i;
          var code = figure.querySelector('.code');
          var copyButton = $('<button>Copy <i class="far fa-clipboard"></i></button>');
          code.id = codeId;
          copyButton.addClass('clipboard-btn');
          copyButton.attr('data-clipboard-target-id', codeId);

          var figcaption = figure.querySelector('figcaption');

          if (figcaption) {
            figcaption.append(copyButton[0]);
          } else {
            figure.prepend(copyButton[0]);
          }
        })

        var clipboard = new ClipboardJS('.clipboard-btn', {
          target: function(trigger) {
            return document.getElementById(trigger.getAttribute('data-clipboard-target-id'));
          }
        });
        clipboard.on('success', function(e) {
          e.clearSelection();
        })
      })
    </script>

    
    

    


<script src="/js/script.js"></script>

    
    <div class="searchbox ins-search">
    <div class="searchbox-mask"></div>
    <div class="searchbox-container ins-search-container">
        <div class="searchbox-input-wrapper">
            <input type="text" class="searchbox-input ins-search-input" placeholder="站内搜索">
            <span class="searchbox-close ins-close ins-selectable"><i class="fa fa-times-circle"></i></span>
        </div>
        <div class="searchbox-result-wrapper ins-section-wrapper">
            <div class="ins-section-container"></div>
        </div>
    </div>
</div>
<script>
    (function (window) {
        var INSIGHT_CONFIG = {
            TRANSLATION: {
                POSTS: '文章',
                PAGES: '页面',
                CATEGORIES: '分类',
                TAGS: '标签',
                UNTITLED: '(无标题)',
            },
            CONTENT_URL: '/content.json',
        };
        window.INSIGHT_CONFIG = INSIGHT_CONFIG;
    })(window);
</script>
<script src="/js/insight.js"></script>
    
</body>
</html>