<!DOCTYPE html>
<html class="has-navbar-fixed-top">
<head><meta name="generator" content="Hexo 3.8.0">
    <meta charset="utf-8">
<title>地磁 - 刘迪先</title>
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">

<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/outdated-browser/1.1.5/outdatedbrowser.min.css">


<link href="/en/2018/11/21/地磁/" rel="alternate" hreflang="en">
    




<meta name="keywords" content="media art and theory">



    <meta name="keywords" content="media art and theory">
<meta property="og:type" content="article">
<meta property="og:title" content="地磁">
<meta property="og:url" content="http://liudixian.github.io/2018/11/21/地磁/index.html">
<meta property="og:site_name" content="刘迪先">
<meta property="og:locale" content="zh-cn">
<meta property="og:image" content="http://ilotresor.com/wp-content/uploads/pmlo.gif">
<meta property="og:image" content="http://ilotresor.com/wp-content/uploads/pmlo.gif">
<meta property="og:image" content="http://ilotresor.com/wp-content/uploads/bdfc.gif">
<meta property="og:image" content="http://ilotresor.com/wp-content/uploads/sendwg.gif">
<meta property="og:image" content="http://ilotresor.com/wp-content/uploads/aabd.gif">
<meta property="og:image" content="http://ilotresor.com/wp-content/uploads/aagvf.gif">
<meta property="og:image" content="http://ilotresor.com/wp-content/uploads/aacn.gif">
<meta property="og:image" content="http://ilotresor.com/wp-content/uploads/aasch.gif">
<meta property="og:image" content="http://ilotresor.com/wp-content/uploads/mcschp.gif">
<meta property="og:image" content="http://ilotresor.com/wp-content/uploads/squarewave.gif">
<meta property="og:image" content="http://liudixian.github.io/2018/11/21/地磁/Magnum.png">
<meta property="og:image" content="http://liudixian.github.io/2018/11/21/地磁/rawdata.jpg">
<meta property="og:image" content="http://liudixian.github.io/2018/11/21/地磁/7.2.jpg">
<meta property="og:image" content="http://liudixian.github.io/2018/11/21/地磁/7.3.jpg">
<meta property="og:image" content="http://liudixian.github.io/2018/11/21/地磁/7.4.jpg">
<meta property="og:image" content="http://liudixian.github.io/2018/11/21/地磁/7.5.jpg">
<meta property="og:image" content="http://liudixian.github.io/2018/11/21/地磁/7.6.jpg">
<meta property="og:image" content="http://liudixian.github.io/2018/11/21/地磁/7.7.jpg">
<meta property="og:image" content="https://gd1.alicdn.com/imgextra/i4/134803376/TB2e_dQpHZnBKNjSZFKXXcGOVXa_!!134803376.jpg">
<meta property="og:image" content="https://gd3.alicdn.com/imgextra/i3/2972316446/TB2P38hXYEF6uJjSZFOXXXUvVXa_!!2972316446.jpg">
<meta property="og:image" content="https://gd3.alicdn.com/imgextra/i3/1087172351/O1CN011TEnbl2dsAriZaO_!!1087172351.jpg">
<meta property="og:image" content="https://gd3.alicdn.com/imgextra/i4/1087172351/O1CN011TEncsVQGl3CTxD_!!1087172351.jpg">
<meta property="og:updated_time" content="2019-06-14T20:17:39.181Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="地磁">
<meta name="twitter:image" content="http://ilotresor.com/wp-content/uploads/pmlo.gif">





<link rel="icon" href="/favicon.png">


<link rel="stylesheet" href="//fonts.googleapis.com/css?family=Ovo|Source+Code+Pro">
<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/bulma/0.6.2/css/bulma.min.css">


<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/lightgallery/1.6.8/css/lightgallery.min.css">
<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/justifiedGallery/3.6.5/css/justifiedGallery.min.css">


<link rel="stylesheet" href="//cdnjs.cloudflare.com/ajax/libs/highlight.js/9.12.0/styles/atom-one-light.min.css">

<link rel="stylesheet" href="/css/style.css">

<script defer src="//use.fontawesome.com/releases/v5.0.8/js/all.js"></script>


    
    
    
    
    
    
    
    
    
    

    


</head>
<body>
    
<nav class="navbar is-transparent is-fixed-top navbar-main" role="navigation" aria-label="main navigation">
    <div class="container">
        <div class="navbar-brand">
            <a class="navbar-item navbar-logo" href="/">
                
                <img src="/images/logo.png" alt="" height="28">
                
            </a>
            <div class="navbar-burger">
                <span></span>
                <span></span>
                <span></span>
            </div>
        </div>
        
        <div class="navbar-menu navbar-start">
            
            <a class="navbar-item " href="/archives">Archives</a>
            
            <a class="navbar-item " href="/categories/媒介理论">Media Theory</a>
            
            <a class="navbar-item " href="/categories/works">Works</a>
            
            <a class="navbar-item " href="/categories/技术">Technology</a>
            
            <a class="navbar-item " href="/categories/coding">Coding</a>
            
            <a class="navbar-item " href="/about">About</a>
            
        </div>
        
        <div class="navbar-menu navbar-end">
            
            <a class="navbar-item search" title="搜索" href="javascript:;">
                <i class="fas fa-search"></i>
            </a>
            
            
            
            <a class="navbar-item" title="GitHub" href="https://github.com/ppoffice/hexo-theme-minos" rel="external nofollow noopener noreferrer" target="_blank">
                
                <i class="fab fa-github"></i>
                
            </a>
               
            
        </div>
    </div>
</nav>

    <section class="section">
    <div class="container">
    <article class="article content gallery" itemscope="" itemprop="blogPost">
    <h1 class="article-title is-size-3 is-size-4-mobile" itemprop="name">
        
            地磁
        
    </h1>
    <div class="article-meta columns is-variable is-1 is-multiline is-mobile is-size-7-mobile">
        <span class="column is-narrow">
            <time datetime="2018-11-21T05:43:13.000Z" itemprop="datePublished">11月 21 2018</time>
        </span>
        
        
        <span class="column is-narrow">
            
            
            1 小时 读完 (约 9503 字)
        </span>
        
    </div>
    <div class="article-entry is-size-6-mobile" itemprop="articleBody">
    
        <p><img src="http://ilotresor.com/wp-content/uploads/pmlo.gif" alt="&#x6784;&#x5EFA;&#x4E00;&#x4E2A;&#x666E;&#x987F;&#x7CBE;&#x5EA6;&#x78C1;&#x529B;&#x8BA1;"></p>
<a id="more"></a>
<p><em>&#x4EE5;&#x4E0B;&#x5747;&#x4E3A;&#x642C;&#x8FD0;&#xFF1A;</em></p>
<p>&#x4F60;&#x597D;&#xFF0C;<br>
&#x6211;&#x6B63;&#x5728;&#x7528;WordPress&#x91CD;&#x5EFA;&#x6211;&#x7684;&#x65E7;&#x7F51;&#x7AD9;&#xFF0C;&#x5F53;&#x6211;&#x5206;&#x6790;404&#x9519;&#x8BEF;&#x65F6;&#xFF0C;&#x6211;&#x770B;&#x5230;&#x6709;&#x6570;&#x767E;&#x4EBA;&#x60F3;&#x770B;&#x4E00;&#x4E2A;&#x540D;&#x4E3A;&#xAB;&#x6784;&#x5EFA;&#x8D28;&#x5B50;&#x8FDB;&#x52A8;&#x78C1;&#x529B;&#x8BA1;&#xBB;&#x7684;&#x524D;&#x4E00;&#x9875;&#x3002; &#x4E3B;&#x8981;&#x63A8;&#x8350;&#x4EBA;&#x662F;&#xFF1A;<br>
<a href="https://www.1010.co.uk/org/geophysics.html" rel="external nofollow noopener noreferrer" target="_blank">https://www.1010.co.uk/org/geophysics.html</a></p>
<p>&#x6240;&#x4EE5;&#xFF0C;&#x6211;&#x518D;&#x6B21;&#x590D;&#x5236;&#x524D;&#x4E00;&#x7BC7;&#x6587;&#x7AE0;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x6CA1;&#x6709;&#x5728;&#x7F51;&#x4E0A;&#x627E;&#x5230;&#x5B83;&#xFF0C;&#x9664;&#x4E86;&#x8FD9;&#x91CC;&#xFF1A;<br>
<a href="https://vdocuments.site/build-a-proton-precession-magnetometer.html" rel="external nofollow noopener noreferrer" target="_blank">https://vdocuments.site/build-a-proton-precession-magnetometer.html</a></p>
<p>&#x548C;&#x8FD9;&#x513F;&#xFF1A;<br>
<a href="https://fr.scribd.com/doc/148525063/Build-a-Proton-Precession-Magnetometer" rel="external nofollow noopener noreferrer" target="_blank">https://fr.scribd.com/doc/148525063/Build-a-Proton-Precession-Magnetometer</a></p>
<p>&#x6587;&#x7AE0;&#x4E2D;&#x7684;&#x201C;&#x6211;&#x201D;&#x4E0D;&#x662F;&#x201C;&#x6211;&#x201D;&#x3002; &#x6240;&#x4EE5;&#xFF0C;&#x8BF7;&#x4E0D;&#x8981;&#x8054;&#x7CFB;&#x6211;&#x83B7;&#x53D6;&#x6709;&#x5173;&#x6B64;&#x9879;&#x76EE;&#x7684;&#x4FE1;&#x606F;&#x3002; &#x4E0A;&#x9762;&#x7684;&#x6587;&#x7AE0;&#x662F;aol.com&#x4E0A;&#x53D1;<br>
&#x73B0;&#x7684;1999&#x5E74;&#x539F;&#x521B;&#x6587;&#x7AE0;&#x7684;&#x526F;&#x672C;&#xFF08;<a href="http://members.aol.com/_ht_a/alka1/ProMag.html%EF%BC%89" rel="external nofollow noopener noreferrer" target="_blank">http://members.aol.com/_ht_a/alka1/ProMag.html&#xFF09;</a></p>
<h1 id="&#x6784;&#x5EFA;&#x4E00;&#x4E2A;&#x666E;&#x987F;&#x7CBE;&#x5EA6;&#x78C1;&#x529B;&#x8BA1;"><a class="markdownIt-Anchor" href="#&#x6784;&#x5EFA;&#x4E00;&#x4E2A;&#x666E;&#x987F;&#x7CBE;&#x5EA6;&#x78C1;&#x529B;&#x8BA1;"></a> &#x6784;&#x5EFA;&#x4E00;&#x4E2A;&#x666E;&#x987F;&#x7CBE;&#x5EA6;&#x78C1;&#x529B;&#x8BA1;</h1>
<p>&#x4E00;&#x4E2A;&#x6559;&#x80B2;&#x6027;&#x7684;&#x201C;&#x540E;&#x9662;&#x201D;&#x9879;&#x76EE;&#xFF0C;&#x4F7F;&#x7528;&#x6613;&#x4E8E;&#x83B7;&#x5F97;&#x7684;&#x7535;&#x5B50;&#x96F6;&#x4EF6;&#x6784;&#x5EFA;&#x3002; &#x9891;&#x7387;&#x8BA1;&#x6570;&#x5668;&#x7528;&#x4E8E;&#x6D4B;&#x91CF;&#x540E;&#x6781;&#x5316;&#x8109;&#x51B2;&#x8D28;&#x5B50;&#x8FDB;&#x52A8;&#x9891;&#x7387;&#x3002; &#x6D4B;&#x91CF;&#x7684;&#x9891;&#x7387;&#x901A;&#x8FC7;&#x7269;&#x7406;&#x5E38;&#x6570;&#x4E0E;&#x5C40;&#x90E8;&#x5730;&#x78C1;&#x573A;&#x7684;&#x5927;&#x5C0F;&#x76F8;&#x5173;&#x3002;</p>
<hr>
<h3 id="&#x80CC;&#x666F;"><a class="markdownIt-Anchor" href="#&#x80CC;&#x666F;"></a> &#x80CC;&#x666F;&#xFF1A;</h3>
<p>&#x6709;&#x5173;&#x8D28;&#x5B50;&#x78C1;&#x529B;&#x8BA1;&#x7684;&#x4E00;&#x4E9B;&#x80CC;&#x666F;&#x4FE1;&#x606F;&#x548C;&#x5B9E;&#x9645;&#x5E94;&#x7528;&#x7684;&#x63CF;&#x8FF0;&#xFF0C;&#x8BF7;&#x53C2;&#x9605;1968&#x5E74;2&#x6708;&#x51FA;&#x7248;&#x7684;&#x201C;&#x79D1;&#x5B66;&#x7F8E;&#x56FD;&#x4EBA;&#x201D;&#x6742;&#x5FD7;&#x4E0A;&#x7684;&#x201C;&#x4E1A;&#x4F59;&#x79D1;&#x5B66;&#x5BB6;&#x201D;&#x4E00;&#x680F;&#x3002;&#x63CF;&#x8FF0;&#x4E86;&#x53CC;&#x7EBF;&#x5708;&#x78C1;&#x529B;&#x8BA1;&#x7684;&#x6784;&#x9020;&#x3002;&#x8BE5;&#x6761;&#x4E2D;&#x7684;&#x4FE1;&#x606F;&#x6784;&#x6210;&#x4E86;&#x6B64;&#x5904;&#x6240;&#x793A;&#x7EC6;&#x8282;&#x7684;&#x57FA;&#x7840;&#x3002;</p>
<p>&#x51E0;&#x5E74;&#x524D;&#x6211;&#x5EFA;&#x9020;&#x4E86;&#x78C1;&#x901A;&#x95E8;&#x78C1;&#x529B;&#x8BA1;&#x3002;&#x5B83;&#x57FA;&#x4E8E;&#x7406;&#x67E5;&#x5FB7;&#xB7;&#x8BFA;&#x5E03;&#x5C14;&#x5728;1991&#x5E74;9&#x6708;&#x7684;&#x201C;&#x7535;&#x5B50;&#x4E16;&#x754C;+&#x65E0;&#x7EBF;&#x4E16;&#x754C;&#x201D;&#x6742;&#x5FD7;&#x4E0A;&#x53D1;&#x8868;&#x7684;&#x6587;&#x7AE0;&#x3002;&#x4F7F;&#x7528;&#x56FE;&#x8868;&#x8BB0;&#x5F55;&#x4EEA;&#xFF0C;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x5730;&#x7403;&#x78C1;&#x573A;&#x7684;&#x4E1C;&#x897F;&#x5411;&#x5206;&#x91CF;&#x7684;&#x65E5;&#x53D8;&#x5316;&#xFF0C;&#x5728;&#x6D88;&#x9664;&#x4E86;&#x538B;&#x5012;&#x6027;&#x7684;&#x603B;&#x548C;&#x5357;&#x5317;&#x5206;&#x91CF;&#x4E4B;&#x540E;&#x3002;</p>
<p>&#x5728;&#x627E;&#x5230;1968&#x5E74;2&#x6708;&#x7684;&#x201C;&#x79D1;&#x5B66;&#x7F8E;&#x56FD;&#x4EBA;&#x201D;&#x6587;&#x7AE0;&#x4E4B;&#x540E;&#xFF0C;&#x6211;&#x8BA4;&#x4E3A;&#x5C1D;&#x8BD5;&#x5728;&#x8D28;&#x5B50;&#x78C1;&#x529B;&#x8BA1;&#x4E0A;&#x6DFB;&#x52A0;&#x4E00;&#x4E2A;&#x9891;&#x7387;&#x8BA1;&#x6570;&#x5668;&#x5C06;&#x662F;&#x4E00;&#x4E2A;&#x6709;&#x8DA3;&#x7684;&#x9879;&#x76EE;&#x3002;&#x8FD9;&#x5C06;&#x662F;&#x4E00;&#x4E2A;&#x6709;&#x8DA3;&#x7684;&#x201C;&#x540E;&#x9662;&#x79D1;&#x5B66;&#x201D;&#x9879;&#x76EE;&#xFF0C;&#x7528;&#x5B83;&#x6765;&#x63D0;&#x4F9B;&#x5730;&#x7403;&#x603B;&#x91CF;&#x7684;&#x6D4B;&#x91CF;&#x78C1;&#x573A;&#x3002;&#x589E;&#x52A0;&#x6570;&#x6A21;&#x8F6C;&#x6362;&#x5668;&#x53EF;&#x4EE5;&#x63D0;&#x4F9B;&#x9002;&#x5408;&#x56FE;&#x8868;&#x8BB0;&#x5F55;&#x5668;&#x7684;&#x8F93;&#x51FA;&#x3002;</p>
<p>&#x7136;&#x800C;&#xFF0C;&#x90CA;&#x533A;&#x7684;&#x540E;&#x9662;&#x73AF;&#x5883;&#x76F8;&#x5F53;&#x5608;&#x6742;&#x3002;&#x7535;&#x6E90;&#x7EBF;&#x9891;&#x7387;&#x7684;&#x8C10;&#x6CE2;&#x4E00;&#x76F4;&#x5EF6;&#x4F38;&#x5230;&#x97F3;&#x9891;&#x8303;&#x56F4;&#x3002;&#x8FD9;&#x4E9B;&#x4E0E;&#x8870;&#x9000;&#x7684;&#x8FDB;&#x52A8;&#x9891;&#x7387;&#x97F3;&#x8C03;&#x7ADE;&#x4E89;&#x3002;&#x91C7;&#x7528;&#x5DEE;&#x52A8;&#x4E32;&#x8054;&#x65B9;&#x5F0F;&#x8FDE;&#x63A5;&#x4F20;&#x611F;&#x5668;&#x7EBF;&#x5708;&#xFF0C;&#x4F20;&#x611F;&#x5668;&#x7684;&#x5B9A;&#x4F4D;&#x548C;&#x97F3;&#x9891;&#x4FE1;&#x53F7;&#x7684;&#x77AC;&#x65F6;&#x91C7;&#x6837;&#x6709;&#x52A9;&#x4E8E;&#x5BF9;&#x6297;&#x566A;&#x58F0;&#x3002;</p>
<p>&#x7269;&#x7406;&#x5B66;&#x4E2D;&#x6709;&#x4E00;&#x4E2A;&#x91CF;&#x53EB;&#x505A;&#x201C;&#x62C9;&#x83AB;&#x5C14;&#x9891;&#x7387;&#x201D;&#xFF0C;&#x5B83;&#x5B9A;&#x4E49;&#x4E86;&#x5728;&#x78C1;&#x573A;&#x5B58;&#x5728;&#x4E0B;&#x8FDB;&#x884C;&#x8FDB;&#x52A8;&#x7684;&#x8D28;&#x5B50;&#x7684;&#x89D2;&#x52A8;&#x91CF;&#x3002;</p>
<p>&#x76EE;&#x524D;&#x6709;&#x4E00;&#x4E9B;&#x91CF;&#x5B50;&#x529B;&#x5B66;&#x7684;&#x89C2;&#x70B9;&#x53EF;&#x4EE5;&#x89E3;&#x91CA;&#x7C92;&#x5B50;&#x5C81;&#x5DEE;&#xFF0C;&#x4F46;&#x662F;&#x7ECF;&#x5178;&#x7684;&#x89E3;&#x91CA;&#x4F3C;&#x4E4E;&#x66F4;&#x5BB9;&#x6613;&#x7406;&#x89E3;&#x3002;&#x4E00;&#x4E2A;&#x8D28;&#x5B50;&#xFF0C;&#x4E00;&#x4E2A;&#x5E26;&#x7535;&#x7C92;&#x5B50;&#xFF0C;&#x53EF;&#x4EE5;&#x88AB;&#x8BA4;&#x4E3A;&#x662F;&#x5177;&#x6709;&#x56F4;&#x7ED5;&#x4E00;&#x4E2A;&#x8F74;&#x7684;&#x786E;&#x5B9A;&#x7684;&#x201C;&#x81EA;&#x65CB;&#x201D;&#xFF0C;&#x5B83;&#x8D77;&#x7740;&#x4E00;&#x4E2A;&#x5C0F;&#x78C1;&#x94C1;&#x7684;&#x4F5C;&#x7528;&#x3002;&#x5916;&#x52A0;&#x78C1;&#x573A;&#x4E0D;&#x4F1A;&#x6539;&#x53D8;&#x81EA;&#x65CB;&#x901F;&#x7387;&#xFF0C;&#x4F46;&#x4F1A;&#x4F7F;&#x7C92;&#x5B50;&#x4EE5;&#x8F83;&#x6162;&#x7684;&#x901F;&#x7387;&#x7ED5;&#x8FDB;&#x52A8;&#x8F74;&#x6446;&#x52A8;&#x3002;&#x8FD9;&#x4E2A;&#x8F74;&#x503E;&#x5411;&#x4E8E;&#x4E0E;&#x5916;&#x90E8;&#x78C1;&#x573A;&#x5BF9;&#x9F50;&#x3002;&#x7136;&#x800C;&#x5728;&#x5F31;&#x78C1;&#x573A;&#x4E2D;&#xFF0C;&#x7531;&#x4E8E;&#x70ED;&#x6548;&#x5E94;&#x548C;&#x5176;&#x4ED6;&#x5206;&#x5B50;&#x76F8;&#x4E92;&#x4F5C;&#x7528;&#xFF0C;&#x4EFB;&#x4F55;&#x6392;&#x5217;&#x90FD;&#x8D8B;&#x5411;&#x4E8E;&#x968F;&#x673A;&#x6027;&#x3002;</p>
<p>&#x8D28;&#x5B50;&#x5BF9;&#x5916;&#x754C;&#x65BD;&#x52A0;&#x7684;&#x78C1;&#x529B;&#x7684;&#x6270;&#x52A8;&#x4F5C;&#x7528;&#x4F5C;&#x51FA;&#x53CD;&#x5E94;&#xFF0C;&#x5176;&#x8FDB;&#x52A8;&#x901F;&#x7387;&#x4E0E;&#x79F0;&#x4E3A;&#x65CB;&#x78C1;&#x6BD4;&#x7684;&#x7CBE;&#x786E;&#x5E38;&#x6570;&#x4E00;&#x81F4;&#x3002;&#x5BF9;&#x4E8E;&#x8D28;&#x5B50;&#xFF0C;&#x8FD9;&#x4E2A;&#x91CF;&#x5927;&#x7EA6;&#x7B49;&#x4E8E;267.53 x 1E6&#x5F27;&#x5EA6;/&#x79D2;/&#x7279;&#x65AF;&#x62C9;&#xFF0C;&#x6216;42.58 mHz/&#x7279;&#x65AF;&#x62C9;&#x3002;</p>
<p>&#x5728;&#x7F8E;&#x56FD;&#x5317;&#x7EAC;&#x5730;&#x533A;&#xFF0C;&#x603B;&#x78C1;&#x573A;&#x5F3A;&#x5EA6;&#x7EA6;&#x4E3A;5&#x4E07;&#x5230;5.5&#x4E07;&#x7EB3;&#x7279;&#x65AF;&#x62C9;&#xFF0C;&#x800C;&#x4E14;&#x5404;&#x5730;&#x78C1;&#x573A;&#x5F3A;&#x5EA6;&#x4E0D;&#x540C;&#x3002;&#x7531;&#x78C1;&#x66B4;&#x5F15;&#x8D77;&#x7684;&#x77ED;&#x5468;&#x671F;&#x53D8;&#x5316;&#x53EF;&#x80FD;&#x8FBE;&#x5230;&#x51E0;&#x767E;&#x7EB3;&#x7279;&#x65AF;&#x62C9;&#x3002;&#x7531;&#x592A;&#x9633;&#x8BF1;&#x5BFC;&#x7684;&#x7535;&#x79BB;&#x5C42;&#x7535;&#x6D41;&#x5F15;&#x8D77;&#x7684;&#x65E5;&#x53D8;&#x5316;&#x7EA6;&#x4E3A;&#x51E0;&#x5341;&#x7EB3;&#x7279;&#x65AF;&#x62C9;&#x3002;&#x76EE;&#x524D;&#xFF0C;&#x6574;&#x4E2A;&#x78C1;&#x573A;&#x7684;&#x957F;&#x671F;&#x8D8B;&#x52BF;&#x662F;&#x6BCF;&#x5E74;&#x8D1F;90&#x7EB3;&#x7C73;&#x7279;&#x65AF;&#x62C9;(&#x9010;&#x6E10;&#x51CF;&#x5C11;)&#x3002;</p>
<p>&#x5408;&#x9002;&#x7684;&#x4F20;&#x611F;&#x5668;&#x5728;&#x5730;&#x7403;&#x5730;&#x78C1;&#x573A;&#x4E2D;&#x68C0;&#x6D4B;&#x5230;&#x7684;&#x8D28;&#x5B50;&#x8FDB;&#x52A8;&#x9891;&#x7387;&#x5C06;&#x5728;&#x97F3;&#x9891;&#x8303;&#x56F4;&#x5185;:</p>
<p>Example: 42.58 mHz / Tesla x 52500 x 1E-9 Tesla= 2235 Hz</p>
<p>&#x5728;&#x6211;&#x4E1C;&#x5317;&#x7684;&#x4F4D;&#x7F6E;&#xFF0C;&#x9891;&#x7387;&#x8BFB;&#x6570;&#x5E73;&#x5747;&#x7EA6;2275&#x8D6B;&#x5179;&#xFF0C;&#x76F8;&#x5F53;&#x4E8E;&#x5927;&#x7EA6;53,400&#x7EB3;&#x7C73;&#x7279;&#x65AF;&#x62C9;&#x7684;&#x603B;&#x78C1;&#x573A;&#x3002;&#x8FD9;&#x4F3C;&#x4E4E;&#x4E0E;&#x5DF2;&#x53D1;&#x8868;&#x7684;&#x6A21;&#x578B;&#x6709;&#x5173;&#x3002;&#x8FD9;&#x4E2A;&#x6570;&#x5B57;&#x4E5F;&#x4E0E;&#x4F7F;&#x7528;&#x4EA5;&#x59C6;&#x970D;&#x5179;&#x7EBF;&#x5708;&#x6821;&#x51C6;&#x7684;&#x78C1;&#x901A;&#x95E8;&#x78C1;&#x5F3A;&#x8BA1;&#x5F97;&#x5230;&#x7684;&#x503C;&#x4E00;&#x81F4;&#x3002;&#x78C1;&#x901A;&#x95E8;&#x4F20;&#x611F;&#x5668;&#x4ECE;&#x6C34;&#x5E73;&#x4F4D;&#x7F6E;&#x5411;&#x4E0A;&#x503E;&#x659C;&#x5230;&#x63A5;&#x8FD1;&#x5782;&#x76F4;&#x4F4D;&#x7F6E;&#xFF0C;&#x4EE5;&#x83B7;&#x5F97;&#x5730;&#x7403;&#x78C1;&#x573A;&#x7684;&#x6700;&#x5927;&#x8BFB;&#x6570;&#x3002;</p>
<p>&#x6211;&#x6CE8;&#x610F;&#x5230;&#x5728;&#x8FC7;&#x53BB;&#x7684;&#x51E0;&#x4E2A;&#x6708;&#x91CC;&#xFF0C;&#x4F20;&#x611F;&#x5668;&#x5B89;&#x88C5;&#x5728;&#x540E;&#x9662;&#x7684;&#x9891;&#x7387;&#x8BFB;&#x6570;&#x4E0B;&#x964D;&#x4E86;&#x4E00;&#x5230;&#x4E24;&#x8D6B;&#x5179;&#x3002;&#x8FD9;&#x4F3C;&#x4E4E;&#x4E5F;&#x4E0E;&#x9884;&#x6D4B;&#x7684;&#x957F;&#x671F;&#x53D8;&#x5316;&#x5E45;&#x5EA6;&#x4E00;&#x81F4;&#x3002;</p>
<hr>
<p>&#x8FD9;&#x662F;&#xAB;&#x53EA;&#x542C;&#xBB;&#x7248;&#x672C;&#x7684;&#x6846;&#x56FE;&#x3002;&#x9891;&#x7387;&#x8BA1;&#x6570;&#x7535;&#x8DEF;&#x6CA1;&#x6709;&#x4F7F;&#x7528;&#x3002;&#x4EC5;&#x5305;&#x62EC;&#x4F20;&#x611F;&#x5668;&#x7EBF;&#x5708;&#x3001;&#x97F3;&#x9891;&#x653E;&#x5927;&#x5668;&#x548C;&#x76F4;&#x6D41;&#x7535;&#x6E90;&#x3002;&#x5B9A;&#x65F6;&#x5668;IC&#x7528;&#x4E8E;&#x5411;&#x7EE7;&#x7535;&#x5668;&#x63D0;&#x4F9B;&#x5F00;&#x5173;&#x63A7;&#x5236;&#xFF0C;&#x7EE7;&#x7535;&#x5668;&#x4EA4;&#x66FF;&#x8FDE;&#x63A5;&#x6781;&#x5316;&#x7535;&#x6D41;&#x6E90;&#x548C;&#x97F3;&#x9891;&#x653E;&#x5927;&#x5668;&#x8F93;&#x5165;&#x4E4B;&#x95F4;&#x7684;&#x611F;&#x5E94;&#x7EBF;&#x5708;&#x3002;(&#x5355;&#x51FB;figure&#x67E5;&#x770B;&#x66F4;&#x5927;&#x7684;&#x56FE;)&#x3002;</p>
<p><img src="http://ilotresor.com/wp-content/uploads/pmlo.gif" alt="pmlo"></p>
<hr>
<p>&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x78C1;&#x5F3A;&#x8BA1;&#x8BBE;&#x8BA1;&#x7684;&#x6846;&#x56FE;&#xFF0C;&#x589E;&#x52A0;&#x4E86;&#x6D4B;&#x91CF;&#x7535;&#x538B;&#x9891;&#x7387;&#x7684;&#x80FD;&#x529B;&#xFF0C;&#x5728;&#x4F20;&#x611F;&#x5668;&#x7EBF;&#x5708;&#x7531;&#x9884;&#x5904;&#x7406;&#x8D28;&#x5B50;&#x8BF1;&#x5BFC;&#x540E;&#x6781;&#x5316;&#x7535;&#x6D41;&#x6301;&#x7EED;&#x51E0;&#x79D2;&#x949F;&#x7684;&#x65F6;&#x95F4;&#x3002;&#x4E00;&#x4E2A;40&#x5E74;&#x7684;BCD&#x8BA1;&#x6570;&#x5668;dis-&#x64AD;&#x653E;&#x9891;&#x7387;&#x53EF;&#x9009;&#x62E9;&#x7684;&#x5206;&#x8FA8;&#x7387;&#x4E3A;1&#x6216;0.1&#x8D6B;&#x5179;&#x3002;&#x4E00;&#x79CD;&#x9891;&#x7387;&#x500D;&#x589E;&#x5668;&#x65B9;&#x6CD5;&#x4F7F;&#x7528;&#x9501;&#x76F8;&#x73AF;&#x63D0;&#x4F9B;&#x8FD9;&#x4E9B;&#x5206;&#x8FA8;&#x7387;&#xFF0C;&#x4F7F;&#x7528;&#x7684;&#x662F;&#x8FDC;&#x5C0F;&#x4E8E;&#x4E00;&#x79D2;&#x7684;&#x8BA1;&#x6570;&#x95E8;&#x95F4;&#x9694;&#x3002;<br>
<img src="http://ilotresor.com/wp-content/uploads/bdfc.gif" alt="bdfc"></p>
<hr>
<p>&#x4F20;&#x611F;&#x5668;&#x7ED3;&#x6784;<br>
<img src="http://ilotresor.com/wp-content/uploads/sendwg.gif" alt="sendwg"><br>
&#x6211;&#x53D1;&#x73B0;&#x5F53;&#x5730;&#x7684;&#x8D85;&#x5E02;&#x53EF;&#x4EE5;&#x627E;&#x5230;&#x5F88;&#x597D;&#x7684;&#x7EBF;&#x5708;&#x6765;&#x6E90;&#xFF0C;&#x5728;&#x4E0A;&#x9762;&#x7F20;&#x7ED5;&#x78C1;&#x5F3A;&#x8BA1;&#x7EBF;&#x5708;&#x548C;&#x5305;&#x542B;&#x8D28;&#x5B50;&#x4ECB;&#x8D28;&#x3002;&#x68C0;&#x67E5;&#x9999;&#x6599;&#x6446;&#x653E;&#x7684;&#x5730;&#x65B9;&#x3002;&#x7279;&#x522B;&#x8981;&#x627E;&#x5546;&#x5E97;&#x54C1;&#x724C;&#x7684;&#x9999;&#x6599;&#x3002;&#x6211;&#x53D1;&#x73B0;&#x5B83;&#x4EEC;&#x4F7F;&#x7528;&#x7684;&#x662F;&#x8584;&#x58C1;&#x5851;&#x6599;&#x5BB9;&#x5668;&#xFF0C;&#x5728;&#x5E95;&#x90E8;&#x548C;&#x76D6;&#x5B50;&#x4E0B;&#x65B9;&#x6709;&#x73AF;&#x7ED5;&#x7684;&#x810A;&#x3002;&#x8FD9;&#x6837;&#x5C31;&#x5F62;&#x6210;&#x4E86;&#x4E00;&#x79CD;&#x591A;&#x5C42;&#x7EBF;&#x5708;&#x6613;&#x4E8E;&#x7F20;&#x7ED5;&#x7684;&#x5F62;&#x5F0F;&#x3002;</p>
<p>&#x4E0A;&#x9762;&#x5F15;&#x7528;&#x7684;&#x9875;&#x9762;&#x663E;&#x793A;&#x4E86;&#x6240;&#x4F7F;&#x7528;&#x7684;&#x7279;&#x5B9A;&#x5927;&#x5C0F;&#x3002;&#x6709;&#x8BB8;&#x591A;&#x5C3A;&#x5BF8;&#x53EF;&#x4F9B;&#x9009;&#x62E9;&#x3002;&#x8FD8;&#x53D1;&#x73B0;&#x4E86;&#x4E00;&#x4E9B;&#x66F4;&#x9AD8;&#x7684;&#x7EBF;&#x5708;&#xFF0C;&#x53EF;&#x4EE5;&#x63D0;&#x4F9B;&#x5927;&#x7EA6;3.75&#x82F1;&#x5BF8;&#x7684;&#x7EBF;&#x5708;&#x957F;&#x5EA6;&#x3002;&#x7A0D;&#x5FAE;&#x5927;&#x4E00;&#x70B9;&#x7684;&#x5BB9;&#x5668;&#x53EF;&#x4EE5;&#x65B9;&#x4FBF;&#x5730;&#x4F7F;&#x7528;&#x66F4;&#x5927;&#x7684;&#x7535;&#x7EBF;&#x3002;&#x5B83;&#x7684;&#x4F18;&#x70B9;&#x662F;:&#x7EBF;&#x5708;&#x7535;&#x963B;&#x4F4E;&#xFF0C;&#x7EBF;&#x5708;Q&#x503C;&#x9AD8;&#xFF0C;&#x6781;&#x5316;&#x7535;&#x6D41;&#x4E5F;&#x53EF;&#x80FD;&#x5927;(&#x5982;&#x679C;&#x7535;&#x6E90;&#x80FD;&#x63D0;&#x4F9B;&#x7684;&#x8BDD;)&#x3002;&#x6781;&#x5316;&#x7535;&#x6D41;&#x8D8A;&#x9AD8;&#xFF0C;&#x8870;&#x51CF;&#x4FE1;&#x53F7;&#x7684;&#x521D;&#x59CB;&#x632F;&#x5E45;&#x8D8A;&#x5927;&#x3002;</p>
<p>&#x7EBF;&#x5708;Q&#x8D8A;&#x9AD8;&#xFF0C;&#x8870;&#x51CF;&#x4FE1;&#x53F7;&#x5F15;&#x8D77;&#x7684;&#x632F;&#x94C3;&#x6548;&#x5E94;&#x6301;&#x7EED;&#x65F6;&#x95F4;&#x8D8A;&#x957F;&#x3002;&#x6CE8;&#x610F;&#xFF0C;&#x7EBF;&#x5708;&#x7535;&#x611F;&#x968F;&#x531D;&#x6570;&#x7684;&#x5E73;&#x65B9;&#x800C;&#x589E;&#x52A0;&#xFF0C;&#x800C;&#x7EBF;&#x5708;&#x7535;&#x963B;&#x968F;&#x531D;&#x6570;&#x7684;&#x7EBF;&#x6027;&#x51FD;&#x6570;&#x800C;&#x589E;&#x52A0;&#x3002;&#x8FD9;&#x8868;&#x660E;&#xFF0C;&#x5728;&#x5B9E;&#x9645;&#x5E94;&#x7528;&#x4E2D;&#xFF0C;&#x4F7F;&#x7528;&#x6700;&#x5927;&#x531D;&#x6570;&#x548C;&#x6700;&#x5927;&#x7EBF;&#x5F84;&#x53EF;&#x4EE5;&#x83B7;&#x5F97;&#x6700;&#x4F73;&#x7ED3;&#x679C;(&#x9AD8;Q&#x548C;&#x8C03;&#x8C10;&#x7535;&#x8DEF;&#x9009;&#x62E9;&#x6027;)&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x4E5F;&#x8BB8;&#x6700;&#x91CD;&#x8981;&#x7684;&#x662F;&#xFF0C;&#x7EBF;&#x5708;&#x5C06;&#x901A;&#x8FC7;&#x589E;&#x52A0;&#x5E76;&#x8054;&#x7535;&#x5BB9;&#x6765;&#x8FDB;&#x884C;&#x8C03;&#x8C10;&#x2014;&#x2014;&#x8FD9;&#x53EF;&#x80FD;&#x662F;&#x6700;&#x91CD;&#x8981;&#x7684;&#x5143;&#x4EF6;&#x3002;</p>
<p>&#x7EBF;&#x5708;&#x7535;&#x611F;&#x5E94;&#x8DB3;&#x591F;&#x9AD8;&#xFF0C;&#x4EE5;&#x5141;&#x8BB8;&#x4F7F;&#x7528;&#x4E00;&#x4E2A;&#x5408;&#x7406;&#x7684;&#x4EF7;&#x503C;&#x975E;&#x6781;&#x5316;&#x7535;&#x5BB9;&#x5668;&#x3002;&#x66F4;&#x9AD8;&#x7684;Q&#x503C;&#x4E5F;&#x6709;&#x52A9;&#x4E8E;&#x63D0;&#x4F9B;&#x66F4;&#x7A84;&#x7684;&#x8C03;&#x8C10;&#x7535;&#x8DEF;&#x5E26;&#x5BBD;&#xFF0C;&#x8FD9;&#x5BF9;&#x4E8E;&#x63D0;&#x9AD8;&#x4FE1;&#x566A;&#x6BD4;&#x548C;&#x51CF;&#x5C11;&#x9AD8;&#x9636;&#x7535;&#x529B;&#x7EBF;&#x8C10;&#x6CE2;&#x7684;&#x62FE;&#x53D6;&#x975E;&#x5E38;&#x91CD;&#x8981;&#x3002;</p>
<hr>
<h3 id="&#x97F3;&#x9891;&#x653E;&#x5927;&#x5668;"><a class="markdownIt-Anchor" href="#&#x97F3;&#x9891;&#x653E;&#x5927;&#x5668;"></a> &#x97F3;&#x9891;&#x653E;&#x5927;&#x5668;</h3>
<p>&#x97F3;&#x9891;&#x653E;&#x5927;&#x5668;&#x91C7;&#x7528;&#x56DB;&#x4E2A;&#x53CC;&#x6781;&#x6676;&#x4F53;&#x7BA1;&#x548C;&#x4E00;&#x4E2A;&#x53CC;&#x8FD0;&#x653E;&#x96C6;&#x6210;&#x7535;&#x8DEF;&#x3002;&#x5DE6;&#x8FB9;&#x7684;&#x6846;&#x56FE;&#x663E;&#x793A;&#x4E86;&#x7EA7;&#x589E;&#x76CA;&#x5206;&#x5E03;&#x3002;&#x8FD0;&#x7B97;&#x653E;&#x5927;&#x5668;&#x63D0;&#x4F9B;&#x4EE5;&#x8D28;&#x5B50;&#x8FDB;&#x52A8;&#x7684;&#x671F;&#x671B;&#x9891;&#x7387;&#x4E3A;&#x4E2D;&#x5FC3;&#x7684;&#x4E24;&#x7EA7;&#x6709;&#x6E90;&#x5E26;&#x901A;&#x6EE4;&#x6CE2;&#x5668;&#x3002;&#x6700;&#x5927;&#x53EF;&#x7528;&#x589E;&#x76CA;&#x8D85;&#x8FC7;130&#x5206;&#x8D1D;&#x3002;&#x7406;&#x8BBA;&#x589E;&#x76CA;&#x4E0E;&#x9891;&#x7387;&#x7684;&#x5173;&#x7CFB;&#x5982;&#x56FE;&#x6240;&#x793A;&#x3002;&#x6709;&#x4E86;&#x8FD9;&#x6837;&#x7684;&#x9AD8;&#x589E;&#x76CA;&#xFF0C;&#x9700;&#x8981;&#x8C28;&#x614E;&#x7684;&#x7ED3;&#x6784;&#x6765;&#x9632;&#x6B62;&#x632F;&#x8361;&#x3002;<br>
<img src="http://ilotresor.com/wp-content/uploads/aabd.gif" alt="audio Amplifier"><br>
<img src="http://ilotresor.com/wp-content/uploads/aagvf.gif" alt=""><br>
&#x4E0A;&#x56FE;&#x7B80;&#x8981;&#x6982;&#x8FF0;&#x4E86;&#x7269;&#x7406;&#x7EC6;&#x8282;&#x3002;&#x653E;&#x5927;&#x5668;&#x91C7;&#x7528;&#x53CC;&#x9762;&#x9540;&#x94DC;PCB&#x6750;&#x6599;&#x5236;&#x4F5C;&#x3002;&#x7EC4;&#x4EF6;&#x88AB;&#x710A;&#x63A5;&#x5230;&#x9694;&#x79BB;&#x7AEF;&#x5B50;&#x4E0A;&#x3002;&#x91C7;&#x7528;&#x63A8;&#x5165;&#x5F0F;&#x5C3C;&#x9F99;&#x6216;&#x805A;&#x56DB;&#x6C1F;&#x4E59;&#x70EF;&#x7AEF;&#x5B50;&#x3002;&#x77E2;&#x91CF;&#x677F;&#x5F88;&#x96BE;&#x7528;&#x4E8E;&#x5B8C;&#x5168;&#x7531;&#x5206;&#x7ACB;&#x5143;&#x4EF6;&#x7EC4;&#x6210;&#x7684;&#x7535;&#x8DEF;&#x3002;&#x7535;&#x8DEF;&#x677F;&#x5C01;&#x88C5;&#x5728;Radio Shack&#x6A21;&#x5236;&#x7684;&#x9879;&#x76EE;&#x6848;&#x4F8B;&#x4E2D;&#x3002;&#x7BB1;&#x5185;&#x5185;&#x886C;&#x6709;&#x5E26;&#x80F6;&#x80CC;&#x7684;&#x94DD;&#x5E26;&#x3002;<br>
<img src="http://ilotresor.com/wp-content/uploads/aacn.gif" alt=""></p>
<hr>
<h3 id="&#x97F3;&#x9891;&#x653E;&#x5927;&#x5668;-2"><a class="markdownIt-Anchor" href="#&#x97F3;&#x9891;&#x653E;&#x5927;&#x5668;-2"></a> &#x97F3;&#x9891;&#x653E;&#x5927;&#x5668;</h3>
<p>&#x8F93;&#x5165;&#x7EA7;&#x4F7F;&#x7528;&#x4E00;&#x4E2A;100&#x6B27;&#x59C6;&#x7684;&#x672A;&#x65C1;&#x8DEF;&#x53D1;&#x5C04;&#x6781;&#x7535;&#x963B;&#x5C06;&#x8F93;&#x5165;&#x963B;&#x6297;&#x63D0;&#x9AD8;&#x5230;&#x5927;&#x7EA6;12&#x5343;&#x6B27;&#x59C6;&#xFF0C;&#x4EE5;&#x51CF;&#x5C11;&#x8C03;&#x8C10;&#x4F20;&#x611F;&#x5668;&#x7EBF;&#x5708;&#x4E0A;&#x7684;&#x8D1F;&#x8F7D;&#x3002;&#x7531;&#x7EBF;&#x5708;&#x548C;&#x8C10;&#x632F;&#x7535;&#x5BB9;&#x5668;&#x7EC4;&#x6210;&#x7684;&#x8C03;&#x8C10;&#x7535;&#x8DEF;&#x5177;&#x6709;&#x5927;&#x7EA6;3000&#x6B27;&#x59C6;&#x7684;&#x5E76;&#x8054;&#x963B;&#x6297;&#x3002;&#x4E3A;&#x4E86;&#x627E;&#x5230;&#x4E00;&#x79CD;&#x5177;&#x6709;&#x6700;&#x4F73;&#x4FE1;&#x566A;&#x6BD4;&#x7684;&#x8BBE;&#x5907;&#xFF0C;&#x5728;&#x8F93;&#x5165;&#x9636;&#x6BB5;&#x968F;&#x673A;&#x9009;&#x62E9;&#x82E5;&#x5E72;&#x4E0D;&#x540C;&#x7684;&#x8BBE;&#x5907;&#x8FDB;&#x884C;&#x8BD5;&#x9A8C;&#x3002;&#x53EF;&#x4EE5;&#x68C0;&#x6D4B;&#x5230;&#x8DE8;&#x8F93;&#x5165;&#x7AEF;&#x710A;&#x63A5;&#x7684;560&#x6B27;&#x59C6;&#x7535;&#x963B;&#x7684;&#x566A;&#x58F0;&#x8D21;&#x732E;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x6765;&#x81EA;&#x4F20;&#x611F;&#x5668;&#x7EBF;&#x5708;&#x548C;&#x5916;&#x90E8;&#x62FE;&#x97F3;&#x5668;&#x7684;&#x566A;&#x58F0;&#x8D85;&#x8FC7;&#x4E86;&#x56FA;&#x6709;&#x653E;&#x5927;&#x5668;&#x7684;&#x566A;&#x58F0;&#x8D21;&#x732E;&#x3002;<br>
<img src="http://ilotresor.com/wp-content/uploads/aasch.gif" alt="aasch"></p>
<p>&#x4E0B;&#x4E00;&#x9875;&#x8FDE;&#x7ED3;&#x5230;&#x6D4B;&#x91CF;&#x8FDB;&#x52A8;&#x9891;&#x7387;&#x7684;&#x8BA1;&#x6570;&#x5668;&#x5B9E;&#x4F5C;&#x7684;&#x793A;&#x610F;&#x56FE;&#x3002;&#x5B83;&#x7684;&#x76EE;&#x7684;&#x662F;&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x6559;&#x80B2;&#x9879;&#x76EE;&#xFF0C;&#x8BD5;&#x56FE;&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;&#x6D4B;&#x91CF;&#x5F53;&#x5730;&#x5730;&#x78C1;&#x573A;&#x7684;&#x5927;&#x5C0F;&#x3002;&#x672C;&#x7F51;&#x7AD9;&#x4EC5;&#x4F9B;&#x53C2;&#x8003;&#x4E4B;&#x7528;&#x3002;&#x5176;&#x4ED6;&#x4EBA;&#x53EF;&#x80FD;&#x4F1A;&#x5BF9;&#x5B83;&#x611F;&#x5174;&#x8DA3;&#xFF0C;&#x4E5F;&#x53EF;&#x80FD;&#x4F1A;&#x5C06;&#x5B83;&#x7528;&#x4E8E;&#x7279;&#x5B9A;&#x7684;&#x5B9E;&#x9645;&#x5E94;&#x7528;&#x3002;&#x6211;&#x7684;&#x76EE;&#x6807;&#x4E4B;&#x4E00;&#x662F;&#x8282;&#x7EA6;&#xFF0C;&#x4F7F;&#x7528;&#x73B0;&#x6210;&#x7684;&#x6216;&#x5BB9;&#x6613;&#x5F97;&#x5230;&#x7684;&#x6807;&#x51C6;&#x90E8;&#x4EF6;&#x3002;&#x5BF9;&#x4E8E;&#x6765;&#x81EA;&#x7535;&#x6C60;&#x7535;&#x6E90;&#x7684;&#x64CD;&#x4F5C;&#xFF0C;&#x8F83;&#x4F4E;&#x7684;&#x529F;&#x8017;&#x7B49;&#x6548;CMOS&#x903B;&#x8F91;&#x5143;&#x4EF6;&#x53EF;&#x4EE5;&#x66FF;&#x4EE3;&#x6240;&#x793A;&#x7684;TTL&#x5143;&#x4EF6;&#x3002;</p>
<h3 id="&#x8BA1;&#x6570;&#x5668;&#x7535;&#x8DEF;&#x63CF;&#x8FF0;"><a class="markdownIt-Anchor" href="#&#x8BA1;&#x6570;&#x5668;&#x7535;&#x8DEF;&#x63CF;&#x8FF0;"></a> &#x8BA1;&#x6570;&#x5668;&#x7535;&#x8DEF;&#x63CF;&#x8FF0;</h3>
<p>&#x6240;&#x793A;&#x7535;&#x8DEF;&#x9664;&#x5176;&#x4ED6;&#x5206;&#x7ACB;&#x5143;&#x4EF6;&#x5916;&#xFF0C;&#x8FD8;&#x9700;&#x8981;12&#x4E2A;&#x96C6;&#x6210;&#x7535;&#x8DEF;&#x3002;&#x96C6;&#x6210;&#x7535;&#x8DEF;&#x7684;&#x9009;&#x62E9;&#x662F;&#x57FA;&#x4E8E;&#x7ECF;&#x6D4E;&#x6027;&#x7684;&#x2014;&#x2014;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x4F7F;&#x7528;&#x73B0;&#x6709;&#x7684;&#x90E8;&#x4EF6;&#x3002;&#x6709;&#x8BB8;&#x591A;&#x53EF;&#x66FF;&#x4EE3;&#x7684;&#x96C6;&#x6210;&#x7535;&#x8DEF;&#x53EF;&#x4EE5;&#x4EE3;&#x66FF;&#x4E0E;&#x975E;&#x95E8;&#x3001;&#x8BA1;&#x6570;&#x5668;&#x548C;&#x591A;&#x8C10;&#x632F;&#x8361;&#x5668;&#x3002;&#x5728;&#x4EFB;&#x4F55;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;4060&#x8BA1;&#x6570;&#x5668;/&#x632F;&#x8361;&#x5668;&#x548C;4046&#x9501;&#x76F8;&#x73AF;&#x96C6;&#x6210;&#x7535;&#x8DEF;&#x53EF;&#x80FD;&#x662F;&#x5F88;&#x597D;&#x7684;&#x9009;&#x62E9;&#xFF0C;&#x4F46;&#x4E5F;&#x6709;&#x5176;&#x4ED6;&#x53EF;&#x80FD;&#x6027;&#x3002;&#x5982;&#x679C;&#x7535;&#x80FD;&#x6765;&#x81EA;&#x7535;&#x6C60;&#xFF0C;&#x7528;&#x7B49;&#x6548;CMOS&#x903B;&#x8F91;&#x7535;&#x8DEF;&#x4EE3;&#x66FF;TTL&#x7C7B;&#x578B;&#x5C06;&#x51CF;&#x5C11;&#x76F4;&#x6D41;&#x7535;&#x6D41;&#x7684;&#x8981;&#x6C42;&#x3002;<br>
<img src="http://ilotresor.com/wp-content/uploads/mcschp.gif" alt=""></p>
<p>(&#x5728;&#x4E00;&#x4E2A;&#x5355;&#x72EC;&#x7684;&#x90E8;&#x5206;&#x4E2D;&#x663E;&#x793A;&#x4E86;&#x53E6;&#x4E00;&#x4E2A;&#x7535;&#x8DEF;&#xFF0C;&#x5B83;&#x662F;&#x4E00;&#x4E2A;&#x66F4;&#x7B80;&#x5355;&#x7684;&#x53EA;&#x542C;&#x7248;&#x672C;&#x3002;&#x5B83;&#x6D88;&#x9664;&#x4E86;&#x9891;&#x7387;&#x8BA1;&#x6570;&#x5668;&#xFF0C;&#x5E76;&#x4F7F;&#x7528;&#x8BA1;&#x65F6;&#x5668;&#x5FAA;&#x73AF;&#x6781;&#x5316;&#x7535;&#x6D41;&#x5230;&#x4F20;&#x611F;&#x5668;&#x7EBF;&#x5708;&#x7684;&#x5F00;&#x5173;&#x3002;</p>
<p>&#x504F;&#x632F;&#x4F20;&#x611F;&#x5668;&#x7684;&#x65F6;&#x95F4;&#x548C;&#x6D4B;&#x91CF;&#x9891;&#x7387;&#x662F;&#x7531;&#x4E00;&#x5757;&#x624B;&#x8868;&#x6676;&#x4F53;&#x63A8;&#x5BFC;&#x51FA;&#x6765;&#x7684;&#x3002;&#x8FD9;&#x4E9B;&#x662F;&#x5728;&#x4E00;&#x4E9B;&#x6570;&#x5B57;&#x8155;&#x8868;&#x4E2D;&#x53D1;&#x73B0;&#x7684;&#x5FAE;&#x5C0F;&#x5706;&#x67F1;&#x5F62;&#x90E8;&#x4EF6;&#x3002;&#x5B83;&#x4EEC;&#x5728;Active Electronics&#x7684;&#x552E;&#x4EF7;&#x7EA6;&#x4E3A;2&#x7F8E;&#x5143;&#xFF0C;&#x5728;Radio Shack&#x7684;&#x552E;&#x4EF7;&#x4E3A;1&#x7F8E;&#x5143;&#x3002;</p>
<p>&#x632F;&#x5B50;&#x7535;&#x8DEF;&#x57FA;&#x672C;&#x7B26;&#x5408;CD4060/MC14060&#x7684;&#x5E94;&#x7528;&#x8BF4;&#x660E;&#x3002;&#x632F;&#x8361;&#x5668;&#x90E8;&#x5206;&#x4EA7;&#x751F;32.768 kHz&#x7684;&#x8F93;&#x51FA;&#x9891;&#x7387;&#xFF0C;&#x8BE5;&#x8F93;&#x51FA;&#x9891;&#x7387;&#x5E94;&#x7528;&#x4E8E;14&#x7EA7;&#x8BA1;&#x6570;&#x5668;&#x3002;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x9636;&#x6BB5;&#x7684;&#x6700;&#x7EC8;&#x8F93;&#x51FA;&#x662F;2hz&#x6216;0.5&#x79D2;&#x7684;&#x8109;&#x51B2;&#x91CD;&#x590D;&#x7387;&#x3002;&#x8FD9;&#x9A71;&#x52A8;&#x4E00;&#x4E2A;4&#x7EA7;&#x4E8C;&#x8FDB;&#x5236;&#x8BA1;&#x6570;&#x5668;&#xFF0C;&#x5176;&#x6700;&#x540E;&#x4E00;&#x7EA7;&#x63D0;&#x4F9B;4&#x79D2;&#x9AD8;/ 4&#x79D2;&#x4F4E;&#x903B;&#x8F91;&#x7535;&#x5E73;&#x3002;&#x4E3A;&#x4E86;&#x7B80;&#x5355;&#x8D77;&#x89C1;&#xFF0C;&#x4F7F;&#x7528;&#x4E86;4&#x7EA7;&#x4E8C;&#x8FDB;&#x5236;&#x8BA1;&#x6570;&#x5668;&#x7684;&#x5168;&#x8BA1;&#x6570;&#x5468;&#x671F;&#x3002;&#x5982;&#x679C;&#x76EE;&#x7684;&#x662F;&#x5728;&#x4FBF;&#x643A;&#x5F0F;&#x641C;&#x7D22;&#x6A21;&#x5F0F;&#x4E2D;&#x4F7F;&#x7528;&#x78C1;&#x5F3A;&#x8BA1;&#xFF0C;&#x90A3;&#x4E48;&#x5C06;4&#x79D2;(&#x542C;)&#x975E;&#x6781;&#x5316;&#x95F4;&#x9694;&#x7F29;&#x77ED;&#x5230;&#x534A;&#x79D2;&#x53EF;&#x80FD;&#x662F;&#x6709;&#x7528;&#x7684;&#x3002;&#x8FD9;&#x5C06;&#x9700;&#x8981;&#x6DFB;&#x52A0;&#x81F3;&#x5C11;&#x4E00;&#x4E2A;4&#x8F93;&#x5165;NAND&#x95E8;&#x6765;&#x89E3;&#x7801;&#x8BA1;&#x6570;&#x5668;&#x72B6;&#x6001;(10&#x8BA1;&#x6570;)&#x5E76;&#x91CD;&#x7F6E;&#x8BA1;&#x6570;&#x5668;&#x3002;</p>
<p>&#x4E3A;&#x4E86;&#x4F7F;&#x8FDB;&#x52A8;&#x4FE1;&#x53F7;&#x7684;&#x632F;&#x5E45;&#x8FBE;&#x5230;&#x6700;&#x5927;&#xFF0C;&#x5E94;&#x5C06;&#x6781;&#x5316;&#x7535;&#x6D41;&#x65BD;&#x52A0;&#x5230;&#x611F;&#x5E94;&#x7EBF;&#x5708;&#x4E0A;&#x51E0;&#x79D2;&#x949F;&#x3002;&#x4E09;&#x79D2;&#x949F;&#x4F3C;&#x4E4E;&#x8DB3;&#x591F;&#x4E86;&#x3002;&#x9664;&#x53BB;&#x6781;&#x5316;&#x7535;&#x6D41;&#x540E;&#xFF0C;&#x7EE7;&#x7535;&#x5668;&#x5C06;&#x7EBF;&#x5708;&#x8FDE;&#x63A5;&#x5230;&#x97F3;&#x9891;&#x653E;&#x5927;&#x5668;&#x7684;&#x8F93;&#x5165;&#x7AEF;&#x3002;&#x97F3;&#x9891;&#x653E;&#x5927;&#x5668;&#x7684;&#x8F93;&#x51FA;&#x662F;&#x4E00;&#x4E2A;&#x8FDB;&#x52A8;&#x9891;&#x7387;&#x7684;&#x632F;&#x94C3;&#x97F3;&#xFF0C;&#x5176;&#x632F;&#x5E45;&#x8FC5;&#x901F;&#x51CF;&#x5C0F;&#x5230;&#x80CC;&#x666F;&#x566A;&#x58F0;&#x7EA7;&#x3002;&#x4E3A;&#x4E86;&#x83B7;&#x5F97;&#x51C6;&#x786E;&#x7684;&#x9891;&#x7387;&#x6D4B;&#x91CF;&#xFF0C;&#x8BA1;&#x6570;&#x5668;&#x5E94;&#x5728;&#x504F;&#x5149;&#x7535;&#x6D41;&#x6D88;&#x9664;&#x540E;&#x7ACB;&#x5373;&#x5F00;&#x59CB;&#x91C7;&#x6837;&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x53EA;&#x6709;&#x5F53;&#x4FE1;&#x53F7;&#x632F;&#x5E45;&#x8FDC;&#x9AD8;&#x4E8E;&#x566A;&#x58F0;&#x6C34;&#x5E73;&#x65F6;&#x624D;&#x5E94;&#x8FDB;&#x884C;&#x8BA1;&#x6570;&#x3002;</p>
<p>&#x76F4;&#x63A5;&#x6D4B;&#x91CF;&#x97F3;&#x9891;&#x653E;&#x5927;&#x5668;&#x7684;&#x8F93;&#x51FA;&#x9700;&#x8981;1&#x79D2;&#x7684;&#x8BA1;&#x6570;&#x95F4;&#x9694;&#xFF0C;&#x4EE5;&#x4FBF;&#x5728;&#x671F;&#x671B;&#x7684;&#x677E;&#x5F1B;&#x9891;&#x7387;&#x4E0B;&#x89E3;&#x6790;&#x5230;1hz&#xFF0C;&#x5E76;&#x9700;&#x8981;10&#x79D2;&#x6765;&#x89E3;&#x6790;&#x5230;0.1 Hz&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x5728;&#x6700;&#x540E;&#x4E00;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4FE1;&#x53F7;&#x4F1A;&#x5728;&#x653E;&#x5927;&#x5668;&#x566A;&#x58F0;&#x6216;&#x672C;&#x5730;&#x7535;&#x6E90;&#x7EBF;&#x8C10;&#x6CE2;&#x7684;&#x4F5C;&#x7528;&#x4E0B;&#x957F;&#x671F;&#x8870;&#x51CF;&#x3002;&#x5728;&#x540E;&#x9662;&#x73AF;&#x5883;&#x4E2D;&#xFF0C;&#x4E00;&#x79D2;&#x949F;&#x540E;&#xFF0C;&#x4FE1;&#x53F7;&#x5C31;&#x4F1A;&#x4E0E;&#x4EA4;&#x6D41;&#x7535;&#x6E90;&#x7EBF;&#x8C10;&#x6CE2;&#x76F8;&#x7ADE;&#x4E89;&#x3002;</p>
<p>&#x9501;&#x76F8;&#x73AF;&#x662F;&#x7528;&#x6765;&#x5141;&#x8BB8;&#x6D4B;&#x91CF;&#x8FDB;&#x52A8;&#x9891;&#x7387;&#x5230;1&#x7684;0.1&#x8D6B;&#x5179;&#x5206;&#x8FA8;&#x7387;&#x4F7F;&#x7528;&#x8BA1;&#x6570;&#x95F4;&#x9694;&#x8FDC;&#x8FDC;&#x5C0F;&#x4E8E;&#x4E00;&#x79D2;&#x3002;&#x76F8;&#x4F4D;&#x68C0;&#x6D4B;&#x5668;&#x7684;&#x4E00;&#x4E2A;&#x8F93;&#x5165;&#x662F;&#x97F3;&#x9891;&#x653E;&#x5927;&#x5668;&#x7684;&#x8F93;&#x51FA;&#x3002;&#x76F8;&#x4F4D;&#x68C0;&#x6D4B;&#x5668;&#x7684;&#x53E6;&#x4E00;&#x4E2A;&#x8F93;&#x5165;&#x6765;&#x81EA;&#x538B;&#x63A7;&#x632F;&#x8361;&#x5668;(VCO)&#xFF0C;&#x5176;&#x9891;&#x7387;&#x7531;&#x4E24;&#x4E2A;&#x63D2;&#x5165;&#x7684;&#x6570;&#x5B57;&#x5206;&#x538B;&#x5668;&#x5212;&#x5206;;a&#x9664;&#x4EE5;10&#xFF0C;&#x518D;&#x9664;&#x4EE5;8&#x3002;&#x9501;&#x5B9A;&#x65F6;&#xFF0C;VCO&#x9891;&#x7387;&#x7B49;&#x4E8E;&#x97F3;&#x9891;&#x653E;&#x5927;&#x5668;&#x8F93;&#x51FA;&#x9891;&#x7387;&#x4E58;&#x4EE5;&#x4E00;&#x4E2A;&#x56E0;&#x5B50;&#x7B49;&#x4E8E;&#x603B;&#x9664;&#x6CD5;(8&#xD7;10 =80)&#x3002;&#x6D4B;&#x91CF;VCO&#x8F93;&#x51FA;&#x9891;&#x7387;&#x5728;&#x8F93;&#x51FA;&#x9664;&#x4EE5;10&#x8BA1;&#x6570;&#x5668;&#x4F7F;&#x7528;&#x8BA1;&#x6570;&#x95F4;&#x9694;&#x516B;&#x5206;&#x4E4B;&#x4E00;&#x79D2;&#x5141;&#x8BB8;&#x5206;&#x8FA8;&#x7387;&#x4E3A;1&#x8D6B;&#x5179;&#x3002;&#x76F4;&#x63A5;&#x6D4B;&#x91CF;VCO&#x9891;&#x7387;(&#x5728;&#x9664;&#x4EE5;10&#x4E2A;&#x8BA1;&#x6570;&#x5668;&#x4E4B;&#x524D;)&#x53EF;&#x4EE5;&#x4F7F;&#x5206;&#x8FA8;&#x7387;&#x8FBE;&#x5230;0.1 Hz&#x3002;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x6700;&#x6709;&#x6548;&#x6570;&#x5B57;(&#x5343;)&#x6EA2;&#x51FA;&#x8BA1;&#x6570;&#x5668;&#x7684;&#x7B2C;&#x56DB;&#x9636;&#xFF0C;&#x7559;&#x4E0B;&#x767E;&#x4F4D;&#x3001;&#x5341;&#x4F4D;&#x3001;&#x4E2A;&#x4F4D;&#x548C;&#x5341;&#x5206;&#x4E4B;&#x4E00;&#x8D6B;&#x5179;&#x7684;&#x663E;&#x793A;&#x3002;</p>
<p>&#x4E3A;&#x4E86;&#x7B80;&#x5355;&#x548C;&#x7ECF;&#x6D4E;&#xFF0C;&#x5355;&#x4E2A;&#x53D1;&#x5149;&#x4E8C;&#x6781;&#x7BA1;&#x7528;&#x4E8E;&#x663E;&#x793A;&#x5341;&#x8FDB;&#x5236;&#x8BA1;&#x6570;&#x5668;&#x7684;&#x72B6;&#x6001;&#x3002;&#x8BE5;&#x793A;&#x610F;&#x56FE;&#x663E;&#x793A;&#x6700;&#x6709;&#x6548;&#x4F4D;&#x6709;&#x56DB;&#x4E2A;led&#xFF0C;&#x4E24;&#x4E2A;&#x6216;&#x4E09;&#x4E2A;&#x5E94;&#x8BE5;&#x8DB3;&#x591F;&#x4E86;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x4E2A;&#x9636;&#x6BB5;&#x901A;&#x5E38;&#x603B;&#x662F;&#x8BFB;&#x53D6;BCD&#x7B49;&#x6548;&#x4E8E;2(&#x6839;&#x636E;&#x9009;&#x62E9;&#x7684;&#x5206;&#x8FA8;&#x7387;&#x9009;&#x62E9;2000&#x6216;200)&#x3002;&#x5728;&#x7A33;&#x5B9A;&#x6761;&#x4EF6;&#x4E0B;&#xFF0C;&#x5F53;&#x4F7F;&#x7528;1&#x8D6B;&#x5179;&#x5206;&#x8FA8;&#x7387;&#x65F6;&#xFF0C;&#x53EA;&#x6709;&#x6700;&#x5C0F;&#x6709;&#x6548;&#x4F4D;&#x7684;&#x53D8;&#x5316;&#xFF0C;&#x5F53;&#x4F7F;&#x7528;1 / 10&#x8D6B;&#x5179;&#x5206;&#x8FA8;&#x7387;&#x65F6;&#xFF0C;&#x53EA;&#x6709;&#x6700;&#x540E;&#x4E24;&#x4E2A;&#x6709;&#x6548;&#x4F4D;&#x7684;&#x53D8;&#x5316;&#x3002;&#x5982;&#x679C;&#x6253;&#x7B97;&#x7528;&#x4E8E;&#x4FBF;&#x643A;&#x5F0F;&#x641C;&#x7D22;&#xFF0C;&#x6211;&#x60F3;&#x6700;&#x597D;&#x4F7F;&#x7528;&#x5341;&#x8FDB;&#x5236;&#x663E;&#x793A;&#xFF0C;&#x4EE5;&#x4FBF;&#x53EF;&#x4EE5;&#x5BB9;&#x6613;&#x5730;&#x770B;&#x5230;&#x8BFB;&#x6570;&#x7684;&#x53D8;&#x5316;&#x3002;(&#x5C3D;&#x7BA1;&#x53EA;&#x542C;&#x97F3;&#x9891;&#x8F93;&#x51FA;&#x53EF;&#x80FD;&#x8DB3;&#x4EE5;&#x68C0;&#x6D4B;&#x78C1;&#x6027;&#x5F02;&#x5E38;)&#x3002;&#x6709;&#x8BB8;&#x591A;&#x9009;&#x62E9;&#x6765;&#x5B9E;&#x73B0;&#x8FD9;&#x79CD;&#x590D;&#x5408;&#x6DB2;&#x6676;&#x663E;&#x793A;&#x5668;&#xFF0C;&#x4E03;&#x6BB5;&#x6DB2;&#x6676;&#x663E;&#x793A;&#x5668;&#x7B49;&#xFF0C;&#x8FD9;&#x4E9B;&#x5C06;&#x9700;&#x8981;&#x6DFB;&#x52A0;&#x9002;&#x5F53;&#x7684;BCD&#x6BB5;&#x89E3;&#x7801;&#x5668;/&#x9A71;&#x52A8;&#x5668;&#x6216;&#x4F7F;&#x7528;&#x6602;&#x8D35;&#x7684;&#x96C6;&#x6210;&#x8BA1;&#x6570;&#x5668;/&#x663E;&#x793A;&#x96C6;&#x6210;&#x7535;&#x8DEF;&#x3002;</p>
<p>&#x4E3A;&#x4E86;&#x7ECF;&#x6D4E;&#xFF0C;&#x5C3D;&#x91CF;&#x51CF;&#x5C11;&#x4E92;&#x8FDE;&#x63A5;&#x7EBF;&#x548C;&#x5143;&#x4EF6;&#x8BA1;&#x6570;&#xFF0C;&#x5355;&#x7A33;&#x6001;&#x591A;&#x8C10;&#x632F;&#x8361;&#x5668;(&#x4E00;&#x6B21;)&#x7528;&#x4E8E;&#x8BBE;&#x7F6E;&#x5341;&#x9891;&#x8BA1;&#x6570;&#x5668;&#x95E8;&#x63A7;&#x548C;&#x5B9A;&#x65F6;&#x95F4;&#x9694;&#x3002;&#x8FD9;&#x53EF;&#x80FD;&#x6BD4;&#x89E3;&#x7801;&#x6765;&#x81EA;32.768&#x6676;&#x4F53;&#x7684;CD4060&#x548C;74197&#x8BA1;&#x6570;&#x5668;(U1&#x548C;U2)&#x7684;&#x72B6;&#x6001;&#x66F4;&#x5BB9;&#x6613;&#x3002;&#x76F4;&#x8BD1;&#x7801;&#x9700;&#x8981;&#x591A;&#x4E2A;&#x8F93;&#x5165;NAND&#x95E8;&#x4EE5;&#x53CA;&#x9006;&#x53D8;&#x5668;(&#x56E0;&#x4E3A;&#x8BA1;&#x6570;&#x5668;&#x4E0D;&#x63D0;&#x4F9B;&#x4E92;&#x8865;&#x7684;&#x903B;&#x8F91;&#x8F93;&#x51FA;&#x2014;&#x2014;Q&#x548C;&#x5012;Q)&#x3002;</p>
<p><img src="http://ilotresor.com/wp-content/uploads/squarewave.gif" alt=""></p>
<p>&#x591A;&#x8C10;&#x632F;&#x8361;&#x5668;&#x7684;&#x5468;&#x671F;&#x5FC5;&#x987B;&#x6709;&#x4E00;&#x5B9A;&#x7684;&#x7CBE;&#x5EA6;&#xFF0C;&#x56E0;&#x4E3A;&#x5BF9;&#x5B9A;&#x65F6;&#x5143;&#x4EF6;&#x6807;&#x79F0;&#x503C;&#x7684;&#x516C;&#x5DEE;&#x4E0D;&#x8DB3;&#x4EE5;&#x4FDD;&#x8BC1;&#x6B63;&#x786E;&#x7684;&#x65F6;&#x5EF6;&#x3002;&#x5229;&#x7528;&#x73B0;&#x6709;&#x7684;&#x7CBE;&#x786E;&#x65F6;&#x57FA;&#x6CE2;&#x5F62;&#x548C;&#x5341;&#x8FDB;&#x5236;&#x8BA1;&#x6570;&#x5668;&#x5BF9;&#x65F6;&#x5EF6;&#x8FDB;&#x884C;&#x7CBE;&#x786E;&#x8BBE;&#x7F6E;&#x3002;&#x5B9A;&#x65F6;&#x7535;&#x963B;&#x5668;&#x7684;&#x503C;R3&#x548C;R4&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x9700;&#x8981;&#x8FDB;&#x884C;&#x66F4;&#x6539;&#xFF0C;&#x4EE5;&#x63D0;&#x4F9B;&#x6B63;&#x786E;&#x7684;&#x65F6;&#x95F4;&#x5EF6;&#x8FDF;&#x3002;</p>
<h3 id="&#x65F6;&#x95F4;&#x5EF6;&#x8FDF;&#x8C03;&#x6574;"><a class="markdownIt-Anchor" href="#&#x65F6;&#x95F4;&#x5EF6;&#x8FDF;&#x8C03;&#x6574;"></a> &#x65F6;&#x95F4;&#x5EF6;&#x8FDF;&#x8C03;&#x6574;</h3>
<p>CD4060&#x632F;&#x8361;&#x5668;/&#x8BA1;&#x6570;&#x5668;&#x8F93;&#x51FA;(Q4)&#x7684;&#x7B2C;&#x56DB;&#x4E2A;&#x4E8C;&#x8FDB;&#x5236;&#x7EA7;&#x5728;&#x5F15;&#x811A;7&#x5904;&#x53EF;&#x7528;&#x3002;&#x632F;&#x8361;&#x5668;&#x7684;&#x9891;&#x7387;&#x5728;&#x8FD9;&#x4E00;&#x70B9;&#x4E0A;&#x88AB;&#x9664;&#x4EE5;16&#xFF0C;&#x5F97;&#x5230;&#x9891;&#x7387;&#x4E3A;2048 Hz&#x3002;</p>
<h3 id="u3a&#x5EF6;&#x8FDF;"><a class="markdownIt-Anchor" href="#u3a&#x5EF6;&#x8FDF;"></a> U3A&#x5EF6;&#x8FDF;</h3>
<p>&#x8FDB;&#x884C;&#x4EE5;&#x4E0B;&#x4E34;&#x65F6;&#x8FDE;&#x63A5;:</p>
<ol>
<li>
<p>&#x70B9;A1&#x548C;&#x70B9;A2&#x4E4B;&#x95F4;&#x7684;&#x8FDE;&#x63A5;&#x6253;&#x5F00;&#x3002;&#x5C06;A2&#x8FDE;&#x63A5;&#x5230;U1&#x5F15;&#x811A;7&#x5904;&#x7684;2048&#x6D4B;&#x8BD5;&#x4FE1;&#x53F7;&#x3002;</p>
</li>
<li>
<p>&#x6253;&#x5F00;&#x70B9;TC1&#x548C;&#x70B9;TC2&#x4E4B;&#x95F4;&#x7684;&#x8FDE;&#x63A5;&#x3002;&#x8FD9;&#x4E3A;&#x5341;&#x8FDB;&#x8BA1;&#x6570;&#x5668;&#x8F93;&#x5165;&#x95E8;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x4E2A;&#x6FC0;&#x6D3B;&#x4FE1;&#x53F7;&#xFF0C;&#x8BE5;&#x4FE1;&#x53F7;&#x7B49;&#x4E8E;&#x591A;&#x8C10;&#x632F;&#x8361;&#x5668;U3A&#x7684;&#x65F6;&#x5EF6;&#x3002;</p>
</li>
</ol>
<p>&#x5C06;U10&#x5F15;&#x811A;11&#x5904;&#x7684;R12&#x503C;&#x8C03;&#x6574;&#x5230;8000&#x6B27;&#x59C6;&#x5DE6;&#x53F3;&#x3002;&#x8FD9;&#x5E94;&#x8BE5;&#x8C03;&#x6574;CD4046 VCO&#x7684;&#x81EA;&#x7531;&#x8FD0;&#x884C;&#x9891;&#x7387;&#xFF0C;&#x4F7F;&#x5176;&#x8FBE;&#x5230;&#x5141;&#x8BB8;&#x5BF9;&#x6D4B;&#x8BD5;&#x4FE1;&#x53F7;&#x8FDB;&#x884C;&#x9501;&#x76F8;&#x7684;&#x503C;&#x3002;&#x9501;&#x76F8;&#x65F6;VCO&#x9891;&#x7387;&#x4E3A;&#x6D4B;&#x8BD5;&#x4FE1;&#x53F7;&#x7684;80&#x500D;&#x6216;163840hz&#x3002;&#x5C06;&#x5206;&#x8FA8;&#x7387;&#x5F00;&#x5173;(S1)&#x8BBE;&#x7F6E;&#x4E3A;1hz&#x3002;&#x5B83;&#x5C06;16384&#x7684;&#x9664;&#x4EE5;(10)VCO&#x9891;&#x7387;&#x4E0E;&#x5341;&#x8FDB;&#x5236;&#x8BA1;&#x6570;&#x5668;&#x8F93;&#x5165;&#x95E8;&#x8FDE;&#x63A5;&#x8D77;&#x6765;&#x3002;</p>
<p>&#x4F7F;&#x7528;&#x6807;&#x79F0;&#x503C;56 kohms&#x6216;62 kohms&#x4F5C;&#x4E3A;R3&#x7684;&#x5B9A;&#x65F6;&#x7535;&#x963B;&#x5668;&#x3002;</p>
<p>&#x8BA1;&#x6570;&#x5668;&#x663E;&#x793A;&#x5E94;&#x8BE5;&#x6BCF;8&#x79D2;&#x4EA7;&#x751F;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x8BFB;&#x6570;&#x3002;&#x6240;&#x9700;&#x7684;&#x8BA1;&#x6570;&#x5668;&#x663E;&#x793A;&#x5E94;&#x8BE5;&#x7B49;&#x6548;&#x4E8E;0.2&#x79D2;&#xFF0C;0.2 X 16384&#x6216;3277&#x5C06;&#x88AB;&#x663E;&#x793A;&#x3002;&#x9009;&#x62E9;&#x7535;&#x963B;&#x5668;&#x7684;&#x503C;&#xFF0C;&#x4F7F;&#x65F6;&#x5EF6;&#x5728;190&#x5230;210&#x6BEB;&#x79D2;&#x4E4B;&#x95F4;&#xFF0C;&#x6216;&#x8005;&#x9009;&#x62E9;&#x8BA1;&#x6570;&#x5668;&#x8BFB;&#x6570;&#x5728;3112&#x5230;3440&#x4E4B;&#x95F4;&#x3002;</p>
<p>U3B&#x5EF6;&#x8FDF;:</p>
<p>&#x4FDD;&#x6301;&#x4EE5;&#x524D;&#x7684;&#x6D4B;&#x8BD5;&#x8FDE;&#x63A5;&#x4E0D;&#x53D8;&#x3002;&#x8FDB;&#x884C;&#x4EE5;&#x4E0B;&#x4E34;&#x65F6;&#x6D4B;&#x8BD5;&#x8FDE;&#x63A5;:</p>
<ol>
<li>
<p>&#x70B9;D1&#x548C;&#x70B9;D2&#x4E4B;&#x95F4;&#x7684;&#x8FDE;&#x63A5;&#x6253;&#x5F00;&#x3002;</p>
</li>
<li>
<p>&#x70B9;B1&#x548C;&#x70B9;B2&#x4E4B;&#x95F4;&#x7684;&#x8FDE;&#x63A5;&#x6253;&#x5F00;&#x3002;&#x5C06;&#x4E00;&#x6839;&#x77ED;&#x7EDD;&#x7F18;&#x7535;&#x7EBF;&#x8FDE;&#x63A5;&#x5230;B1&#x4E0A;&#xFF0C;&#x8FD9;&#x6837;&#x60A8;&#x5C31;&#x53EF;&#x4EE5;&#x624B;&#x52A8;&#x5C06;&#x5176;&#x89E6;&#x5730;&#x4EE5;&#x91CD;&#x7F6E;&#x5341;&#x8FDB;&#x5236;&#x8BA1;&#x6570;&#x5668;&#x96F6;&#x3002;</p>
</li>
<li>
<p>&#x4ECE;&#x70B9;E1&#x5230;D1&#x7684;&#x4E34;&#x65F6;&#x8FDE;&#x63A5;&#x3002;</p>
</li>
</ol>
<p>&#x624B;&#x52A8;&#x63A5;&#x5730;B1&#xFF0C;&#x624B;&#x52A8;&#x590D;&#x4F4D;&#x8BA1;&#x6570;&#x5668;&#x3002;&#x50CF;&#x4EE5;&#x524D;&#x4E00;&#x6837;&#x89C2;&#x5BDF;&#x8BA1;&#x6570;&#x5668;&#x8BFB;&#x6570;&#xFF0C;&#x5E76;&#x6839;&#x636E;&#x9700;&#x8981;&#x624B;&#x52A8;&#x91CD;&#x7F6E;&#x8BA1;&#x6570;&#x5668;&#x3002;R4&#x7684;&#x521D;&#x59CB;&#x503C;&#x4E3A;27 kohms&#x3002;</p>
<p>&#x8C03;&#x6574;R4&#x7684;&#x503C;&#x4EE5;&#x63D0;&#x4F9B;90&#x5230;100&#x6BEB;&#x79D2;&#x4E4B;&#x95F4;&#x7684;&#x5EF6;&#x8FDF;&#x65F6;&#x95F4;&#xFF0C;&#x76F8;&#x5F53;&#x4E8E;1475&#x5230;1638&#x4E4B;&#x95F4;&#x7684;&#x8BA1;&#x6570;&#x5668;&#x8BFB;&#x6570;&#x3002;</p>
<p>&#x6062;&#x590D;&#x6240;&#x6709;&#x8FDE;&#x63A5;&#x5230;&#x6B63;&#x5E38;&#x7684;&#x6BCF;&#x4E2A;&#x793A;&#x610F;&#x56FE;&#x3002;</p>
<p>VCO&#x9891;&#x7387;:</p>
<p>&#x6682;&#x65F6;&#x8FDE;&#x63A5;A1/A2&#x70B9;&#x81F3;&#x5730;&#x9762;&#x3002;&#x8C03;&#x6574;R12&#x7684;&#x503C;&#x4EE5;&#x4EA7;&#x751F;2230&#x5230;2250&#x7684;&#x8BA1;&#x6570;&#x5668;&#x8BFB;&#x6570;&#x3002;&#x5220;&#x9664;&#x4E34;&#x65F6;&#x5730;&#x9762;&#x3002;</p>
<hr>
<ul>
<li>Martin Hawse&#xFF1A;<a href="http://www.1010.co.uk/org/geophysics.html" rel="external nofollow noopener noreferrer" target="_blank">http://www.1010.co.uk/org/geophysics.html</a></li>
<li>&#x53C2;&#x8003;&#xFF1A;<a href="http://ilotresor.com/build-a-proton-precession-magnetometer/" rel="external nofollow noopener noreferrer" target="_blank">http://ilotresor.com/build-a-proton-precession-magnetometer/</a></li>
<li>&#x8BE6;&#x7EC6;&#x6559;&#x7A0B;&#xFF1A;<a href="http://www.exstrom.com/magnum/master-Z-H-4.html" rel="external nofollow noopener noreferrer" target="_blank">http://www.exstrom.com/magnum/master-Z-H-4.html</a></li>
<li>&#x4ECE;&#x5730;&#x78C1;&#x63A2;&#x6D4B;&#x4E2D;&#x5236;&#x9020;&#x58F0;&#x97F3;&#x7684;&#x53C2;&#x8003;&#xFF1A;<a href="http://marineemlab.ucsd.edu/~steve/bio/SoundMantle.pdf" rel="external nofollow noopener noreferrer" target="_blank">http://marineemlab.ucsd.edu/~steve/bio/SoundMantle.pdf</a></li>
</ul>
<hr>
<h1 id="&#x6765;&#x81EA;&#x4E9A;&#x539F;&#x5B50;&#x4E16;&#x754C;&#x7684;&#x4FE1;&#x53F7;-signals-from-subatomic-world"><a class="markdownIt-Anchor" href="#&#x6765;&#x81EA;&#x4E9A;&#x539F;&#x5B50;&#x4E16;&#x754C;&#x7684;&#x4FE1;&#x53F7;-signals-from-subatomic-world"></a> &#x6765;&#x81EA;&#x4E9A;&#x539F;&#x5B50;&#x4E16;&#x754C;&#x7684;&#x4FE1;&#x53F7;-Signals From subatomic world</h1>
<h2 id="&#x7B2C;&#x4E00;&#x7AE0;"><a class="markdownIt-Anchor" href="#&#x7B2C;&#x4E00;&#x7AE0;"></a> &#x7B2C;&#x4E00;&#x7AE0;</h2>
<h3 id="13-&#x6982;&#x89C8;"><a class="markdownIt-Anchor" href="#13-&#x6982;&#x89C8;"></a> 1.3 &#x6982;&#x89C8;</h3>
<p>&#x9996;&#x5148;&#x662F;&#x5982;&#x4F55;&#x64CD;&#x4F5C;Magnum&#x7684;&#x4E00;&#x822C;&#x63CF;&#x8FF0;&#x3002; &#x9996;&#x5148;&#x9009;&#x62E9;&#x4E00;&#x4E9B;&#x5BCC;&#x542B;&#x6C22;&#x7684;&#x7269;&#x8D28;&#xFF0C;&#x5982;&#x6C34;&#xFF0C;&#x9152;&#x7CBE;&#x6216;&#x77F3;&#x8721;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x4ECE;&#x8FD9;&#x91CC;&#x4F5C;&#x4E3A;&#x6837;&#x54C1;&#x53C2;&#x8003;&#x3002; &#x5C06;&#x7EA6;2&#x76CE;&#x53F8;&#xFF08;59&#x6BEB;&#x5347;&#xFF09;&#x7684;&#x6837;&#x54C1;&#x653E;&#x5165;&#x5706;&#x67F1;&#x5F62;&#x5851;&#x6599;&#x74F6;&#x4E2D;&#x3002; &#x5C06;&#x74F6;&#x5B50;&#x653E;&#x5728;&#x6837;&#x54C1;&#x7EBF;&#x5708;&#x5185;&#xFF0C;&#x7136;&#x540E;&#x5C06;&#x6837;&#x54C1;&#x7EBF;&#x5708;&#x653E;&#x5165;&#x504F;&#x632F;&#x7EBF;&#x5708;&#x5185;&#x3002; &#x6837;&#x54C1;&#x88AB;&#x6781;&#x5316;&#x7EBF;&#x5708;&#x4EA7;&#x751F;&#x7684;&#x573A;&#x504F;&#x632F;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x3002; &#x5F53;&#x504F;&#x632F;&#x7EBF;&#x5708;&#x5173;&#x95ED;&#x65F6;&#xFF0C;&#x7531;&#x6837;&#x672C;&#x4E2D;&#x7684;&#x8FDB;&#x52A8;&#x8D28;&#x5B50;&#x4EA7;&#x751F;&#x7684;&#x4FE1;&#x53F7;&#x7531;&#x6570;&#x636E;&#x91C7;&#x96C6;&#x7CFB;&#x7EDF;&#x8BB0;&#x5F55;&#x3002; &#x7136;&#x540E;&#x4F7F;&#x7528;&#x8F6F;&#x4EF6;&#x5904;&#x7406;&#x6570;&#x5B57;&#x5316;&#x4FE1;&#x53F7;&#x4EE5;&#x4EA7;&#x751F;&#x63D0;&#x4F9B;&#x8D28;&#x5B50;&#x7684;&#x8FDB;&#x52A8;&#x9891;&#x7387;&#x7684;&#x5149;&#x8C31;&#x3002;</p>
<p><img src="/2018/11/21/&#x5730;&#x78C1;/Magnum.png" alt=""></p>
<p>&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x63CF;&#x8FF0;&#x4EEA;&#x5668;&#x7684;&#x6574;&#x4F53;&#x8BBE;&#x8BA1;&#x3002; &#x4E00;&#x822C;&#x7CFB;&#x7EDF;&#x56FE;&#x5982;&#x56FE;1.3&#x6240;&#x793A;&#x3002; Magnum&#x53EF;&#x4EE5;&#x5927;&#x81F4;&#x5206;&#x4E3A;&#x4E09;&#x4E2A;&#x90E8;&#x5206;&#xFF1A; <strong>&#x6781;&#x5316;&#x7CFB;&#x7EDF;&#xFF0C;&#x4F20;&#x611F;&#x5668;&#x7CFB;&#x7EDF;&#xFF0C;&#x4EE5;&#x53CA;&#x63A7;&#x5236;&#x548C;&#x6570;&#x636E;&#x91C7;&#x96C6;&#x7CFB;&#x7EDF;&#x3002;</strong> &#x6211;&#x4EEC;&#x4ECE;&#x6781;&#x5316;&#x7CFB;&#x7EDF;&#x5F00;&#x59CB;&#x3002;</p>
<p><strong>&#x6781;&#x5316;&#x7CFB;&#x7EDF;</strong> &#x7684;&#x76EE;&#x7684;&#x662F;&#x4EA7;&#x751F;&#x4E00;&#x4E2A;&#x5782;&#x76F4;&#x4E8E;&#x5730;&#x7403;&#x7684;&#x5927;&#x78C1;&#x573A;(&#x76F8;&#x5BF9;&#x4E8E;&#x5730;&#x7403;)&#x3002;&#x6781;&#x5316;&#x573A;&#x662F;&#x7531;&#x5B89;&#x88C5;&#x5728;&#x503E;&#x659C;&#x5E73;&#x53F0;&#x4E0A;&#x7684;&#x5927;&#x7EBF;&#x5708;&#x4EA7;&#x751F;&#x7684;&#x3002;&#x8981;&#x6C42;&#x53EF;&#x503E;&#x659C;&#x7684;&#x5E73;&#x53F0;&#x4F7F;&#x504F;&#x632F;&#x573A;&#x4E0E;&#x5730;&#x9762;&#x573A;&#x5782;&#x76F4;&#x3002;&#x6781;&#x5316;&#x573A;&#x5FC5;&#x987B;&#x80FD;&#x591F;&#x5728;&#x89C4;&#x5B9A;&#x7684;&#x65F6;&#x95F4;&#x5185;&#x6253;&#x5F00;&#xFF0C;&#x7136;&#x540E;&#x8FC5;&#x901F;&#x5173;&#x95ED;&#x3002;&#x6781;&#x5316;&#x8109;&#x51B2;&#x63A7;&#x5236;&#x5668;&#x5C31;&#x662F;&#x4E3A;&#x6B64;&#x800C;&#x8BBE;&#x8BA1;&#x7684;&#x3002;&#x63A7;&#x5236;&#x5668;&#x53EF;&#x4EE5;&#x7531;&#x64CD;&#x4F5C;&#x5458;&#x901A;&#x8FC7;&#x4E32;&#x884C;&#x94FE;&#x8DEF;&#x7F16;&#x7A0B;&#x5230;PC&#x673A;&#x4E0A;&#x3002;&#x4E00;&#x65E6;&#x7F16;&#x7A0B;&#xFF0C;&#x63A7;&#x5236;&#x5668;&#x7B49;&#x5F85;&#x6765;&#x81EA;PC&#x7684;&#x4FE1;&#x53F7;&#x5F00;&#x59CB;&#x6781;&#x5316;&#x8FC7;&#x7A0B;&#x3002;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x5305;&#x62EC;&#x5728;&#x89C4;&#x5B9A;&#x7684;&#x65F6;&#x95F4;&#x5185;&#x63A5;&#x901A;&#x6781;&#x5316;&#x7EBF;&#x5708;&#x7684;&#x7535;&#x6D41;&#xFF0C;&#x8FC5;&#x901F;&#x5173;&#x95ED;&#x7535;&#x6D41;&#xFF0C;&#x7136;&#x540E;&#x53D1;&#x9001;&#x4FE1;&#x53F7;&#x901A;&#x77E5;&#x6570;&#x636E;&#x91C7;&#x96C6;&#x7CFB;&#x7EDF;&#x5F00;&#x59CB;&#x91C7;&#x96C6;&#x6570;&#x636E;&#x3002;&#x6781;&#x5316;&#x7EBF;&#x5708;&#x3001;&#x53EF;&#x503E;&#x5E73;&#x53F0;&#x548C;&#x8109;&#x51B2;&#x63A7;&#x5236;&#x5668;&#x5C06;&#x5728;&#x540E;&#x7EED;&#x7AE0;&#x8282;&#x4E2D;&#x8BE6;&#x7EC6;&#x4ECB;&#x7ECD;&#x3002;</p>
<p><strong>&#x4F20;&#x611F;&#x5668;&#x7CFB;&#x7EDF;</strong> &#x7531;&#x4E24;&#x90E8;&#x5206;&#x7EC4;&#x6210;&#xFF0C;&#x5373;&#x91C7;&#x6837;&#x7EBF;&#x5708;&#x548C;&#x653E;&#x5927;&#x5668;&#x3002;&#x6837;&#x54C1;&#x76D8;&#x7BA1;&#x5BB9;&#x7EB3;&#x542B;&#x6709;&#x6837;&#x54C1;&#x7684;&#x74F6;&#x5B50;&#x3002;&#x5B83;&#x7684;&#x76EE;&#x7684;&#x662F;&#x8BF1;&#x5BFC;&#x62FE;&#x53D6;&#x7531;&#x6781;&#x5316;&#x8D28;&#x5B50;&#x4EA7;&#x751F;&#x7684;&#x975E;&#x5E38;&#x5C0F;&#x7684;&#x632F;&#x8361;&#x78C1;&#x573A;&#xFF0C;&#x8BE5;&#x78C1;&#x573A;&#x5728;&#x5730;&#x7403;&#x7684;&#x78C1;&#x573A;&#x4E0A;&#x524D;&#x8FDB;&#x3002;&#x6837;&#x54C1;&#x7EBF;&#x5708;&#x5B9E;&#x9645;&#x4E0A;&#x7531;&#x4E24;&#x4E2A;&#x5E76;&#x6392;&#x653E;&#x7F6E;&#x7684;&#x76F8;&#x540C;&#x7EBF;&#x5708;&#x7EC4;&#x6210;&#x3002;&#x4E00;&#x4E2A;&#x7EBF;&#x5708;&#x7528;&#x4E8E;&#x5BB9;&#x7EB3;&#x6837;&#x54C1;&#xFF0C;&#x53E6;&#x4E00;&#x4E2A;&#x7528;&#x4E8E;&#x62B5;&#x6D88;&#x73AF;&#x5883;&#x78C1;&#x573A;&#x3002;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#x7EBF;&#x5708;&#x6765;&#x5BB9;&#x7EB3;&#x6837;&#x54C1;&#xFF0C;&#x4F46;&#x662F;&#x7531;&#x4E8E;&#x4E24;&#x4E2A;&#x4FE1;&#x53F7;&#x4F1A;&#x62B5;&#x6D88;&#xFF0C;&#x6240;&#x4EE5;&#x4E0D;&#x80FD;&#x5C06;&#x6837;&#x54C1;&#x653E;&#x5728;&#x4E24;&#x4E2A;&#x7EBF;&#x5708;&#x4E2D;&#x3002;&#x7531;&#x8FDB;&#x52A8;&#x8D28;&#x5B50;&#x4EA7;&#x751F;&#x7684;&#x4FE1;&#x53F7;&#x975E;&#x5E38;&#x5F31;&#x3002;&#x4E3A;&#x4E86;&#x589E;&#x5F3A;&#x4FE1;&#x53F7;&#xFF0C;&#x5FC5;&#x987B;&#x4F7F;&#x7528;&#x7535;&#x5BB9;&#x5668;&#x8C03;&#x8C10;&#x91C7;&#x6837;&#x7EBF;&#x5708;&#xFF0C;&#x4EE5;&#x4FBF;&#x5728;&#x8D28;&#x5B50;&#x8FDB;&#x52A8;&#x9891;&#x7387;&#x4E0B;&#x5F62;&#x6210;&#x8C10;&#x632F;&#x7535;&#x8DEF;&#x3002;&#x653E;&#x5927;&#x5668;&#x6709;&#x4E00;&#x7EC4;&#x7535;&#x5BB9;&#x5668;&#xFF0C;&#x53EF;&#x7528;&#x4E8E;&#x8C03;&#x8C10;&#x91C7;&#x6837;&#x7EBF;&#x5708;&#x3002;&#x653E;&#x5927;&#x5668;&#x8FD8;&#x5C06;&#x653E;&#x5927;&#x6765;&#x81EA;&#x8C03;&#x8C10;&#x6837;&#x672C;&#x7EBF;&#x5708;&#x7684;&#x4FE1;&#x53F7;&#x7EA6;380&#x4E07;&#x500D;&#x3002;&#x5177;&#x6709;&#x5982;&#x6B64;&#x9AD8;&#x589E;&#x76CA;&#x7684;&#x653E;&#x5927;&#x5668;&#x662F;&#x4E00;&#x79CD;&#x975E;&#x5E38;&#x7075;&#x654F;&#x7684;&#x5668;&#x4EF6;&#xFF0C;&#x5FC5;&#x987B;&#x975E;&#x5E38;&#x5C0F;&#x5FC3;&#x5730;&#x6784;&#x9020;&#x4EE5;&#x9632;&#x6B62;&#x5B83;&#x53D8;&#x6210;&#x632F;&#x8361;&#x5668;&#x3002;&#x653E;&#x5927;&#x5668;&#x548C;&#x6837;&#x54C1;&#x7EBF;&#x5708;&#x7684;&#x7ED3;&#x6784;&#x7EC6;&#x8282;&#x53EF;&#x4EE5;&#x5728;&#x4EE5;&#x4E0B;&#x7AE0;&#x8282;&#x4E2D;&#x627E;&#x5230;&#x3002;</p>
<p><strong>&#x6570;&#x636E;&#x91C7;&#x96C6;&#x200B;&#x200B;&#x548C;&#x63A7;&#x5236;&#x7CFB;&#x7EDF;</strong> &#x7531;&#x5E26;&#x6709;pci&#x6570;&#x636E;&#x91C7;&#x96C6;&#x5361;&#x7684;&#x4E2A;&#x4EBA;&#x8BA1;&#x7B97;&#x673A;&#x548C;&#x4E00;&#x4E9B;&#x8F6F;&#x4EF6;&#x7EC4;&#x6210;&#x3002;&#x8BE5;&#x8F6F;&#x4EF6;&#x5141;&#x8BB8;&#x64CD;&#x4F5C;&#x5458;&#x5BF9;&#x8109;&#x51B2;&#x63A7;&#x5236;&#x5668;&#x8FDB;&#x884C;&#x7F16;&#x7A0B;&#xFF0C;&#x7136;&#x540E;&#x542F;&#x52A8;&#x6781;&#x5316;&#x548C;&#x6570;&#x636E;&#x91C7;&#x96C6;&#x8FC7;&#x7A0B;&#x3002;&#x8F6F;&#x4EF6;&#x53EF;&#x4EE5;&#x63A7;&#x5236;&#x591A;&#x4E2A;&#x6781;&#x5316;&#x548C;&#x6570;&#x636E;&#x91C7;&#x96C6;&#x5468;&#x671F;&#x3002;&#x5C06;&#x6BCF;&#x4E2A;&#x5468;&#x671F;&#x7684;&#x6570;&#x636E;&#x5E73;&#x5747;&#x5728;&#x4E00;&#x8D77;&#x4EE5;&#x83B7;&#x5F97;&#x66F4;&#x9AD8;&#x7684;&#x4FE1;&#x566A;&#x6BD4;&#x3002;&#x8BE5;&#x8F6F;&#x4EF6;&#x53EF;&#x4EE5;&#x5BF9;&#x8109;&#x51B2;&#x63A7;&#x5236;&#x5668;&#x8FDB;&#x884C;&#x7F16;&#x7A0B;&#xFF0C;&#x4EE5;&#x5C06;&#x6781;&#x5316;&#x573A;&#x6253;&#x5F00;&#xFF0C;&#x4ECE;&#x51E0;&#x5206;&#x4E4B;&#x4E00;&#x79D2;&#x5230;&#x51E0;&#x79D2;&#x949F;&#x3002;&#x5728;&#x5B83;&#x5411;&#x8109;&#x51B2;&#x63A7;&#x5236;&#x5668;&#x53D1;&#x9001;&#x4FE1;&#x53F7;&#x4EE5;&#x542F;&#x52A8;&#x6781;&#x5316;&#x4E4B;&#x540E;&#xFF0C;&#x5B83;&#x521D;&#x59CB;&#x5316;&#x6570;&#x636E;&#x91C7;&#x96C6;&#x7CFB;&#x7EDF;&#x4EE5;&#x7B49;&#x5F85;&#x6765;&#x81EA;&#x63A7;&#x5236;&#x5668;&#x7684;&#x4FE1;&#x53F7;&#xFF0C;&#x6307;&#x793A;&#x6781;&#x5316;&#x5DF2;&#x7ECF;&#x5B8C;&#x6210;&#x5E76;&#x4E14;&#x6570;&#x636E;&#x91C7;&#x96C6;&#x53EF;&#x4EE5;&#x5F00;&#x59CB;&#x3002;&#x6570;&#x636E;&#x91C7;&#x96C6;&#x200B;&#x200B;&#x7CFB;&#x7EDF;&#x7684;&#x901A;&#x9053;&#x9009;&#x62E9;&#xFF0C;&#x8BBE;&#x7F6E;&#x548C;&#x91C7;&#x6837;&#x7387;&#x4E5F;&#x7531;&#x8F6F;&#x4EF6;&#x63A7;&#x5236;&#x3002;&#x5728;&#x6536;&#x96C6;&#x4E86;&#x6240;&#x6709;&#x6570;&#x636E;&#x4E4B;&#x540E;&#xFF0C;&#x4F7F;&#x7528;&#x9644;&#x52A0;&#x8F6F;&#x4EF6;&#x6765;&#x8FC7;&#x6EE4;&#x6570;&#x636E;&#x5E76;&#x8BA1;&#x7B97;&#x4FE1;&#x53F7;&#x7684;&#x9891;&#x8C31;&#x3002;&#x7136;&#x540E;&#x5149;&#x8C31;&#x7ED9;&#x51FA;&#x8D28;&#x5B50;&#x8FDB;&#x52A8;&#x9891;&#x7387;&#xFF0C;&#x4ECE;&#x4E2D;&#x53EF;&#x4EE5;&#x8BA1;&#x7B97;&#x51FA;&#x78C1;&#x6027;&#x3002;&#x6240;&#x6709;&#x8FD9;&#x4E9B;&#x5C06;&#x5728;&#x4EE5;&#x4E0B;&#x7AE0;&#x8282;&#x4E2D;&#x66F4;&#x8BE6;&#x7EC6;&#x5730;&#x63CF;&#x8FF0;&#x3002;</p>
<h2 id="&#x7B2C;&#x516D;&#x7AE0;-chapter-6-&#x6570;&#x636E;&#x91C7;&#x96C6;&#x4E0E;pc&#x63A7;&#x5236;-data-acquisition-and-pc-control"><a class="markdownIt-Anchor" href="#&#x7B2C;&#x516D;&#x7AE0;-chapter-6-&#x6570;&#x636E;&#x91C7;&#x96C6;&#x4E0E;pc&#x63A7;&#x5236;-data-acquisition-and-pc-control"></a> &#x7B2C;&#x516D;&#x7AE0; Chapter 6 &#x6570;&#x636E;&#x91C7;&#x96C6;&#x4E0E;PC&#x63A7;&#x5236;- Data Acquisition and PC control</h2>
<h3 id="61-&#x5982;&#x4F55;&#x4F7F;&#x7528;&#x62BD;&#x6837;-what-sampling-rate-to-use"><a class="markdownIt-Anchor" href="#61-&#x5982;&#x4F55;&#x4F7F;&#x7528;&#x62BD;&#x6837;-what-sampling-rate-to-use"></a> 6.1 &#x5982;&#x4F55;&#x4F7F;&#x7528;&#x62BD;&#x6837;-What sampling rate to Use</h3>
<p>&#x6709;&#x5173;&#x6570;&#x636E;&#x91C7;&#x96C6;&#x7684;&#x6700;&#x91CD;&#x8981;&#x95EE;&#x9898;&#x662F;&#x5982;&#x4F55;&#x91C7;&#x6837;&#x3002;&#x53EF;&#x7528;&#x4E8E;&#x91C7;&#x96C6;&#x4EFB;&#x4F55;&#x4FE1;&#x53F7;&#x7684;&#x9891;&#x7387;&#x662F;&#x6700;&#x9AD8;&#x9891;&#x7387;&#x7684;&#x4E24;&#x500D;&#x4FE1;&#x53F7;&#x4E2D;&#x5B58;&#x5728;&#x7684;&#x5206;&#x91CF;&#x3002; &#x4F8B;&#x5982;&#xFF0C;&#x5982;&#x679C;&#x4FE1;&#x53F7;&#x7684;&#x9891;&#x7387;&#x4E0D;&#x9AD8;&#x4E8E;1000 Hz&#xFF08;1 kHz&#xFF09;&#xFF0C;&#x5219;&#x6700;&#x5C0F;&#x91C7;&#x6837;&#x7387;&#x4E3A;&#x6BCF;&#x79D2;2000&#x4E2A;&#x6837;&#x672C;&#xFF08;2 ksps&#xFF09;&#x3002; &#x5982;&#x679C;&#x4EE5;&#x5C0F;&#x4E8E;2 ksps&#x7684;&#x901F;&#x5EA6;&#x91C7;&#x6837;1 kHz&#x6B63;&#x5F26;&#x6CE2;&#xFF0C;&#x90A3;&#x4E48;&#x5B83;&#x5C06;&#x4E0E;&#x8F83;&#x4F4E;&#x9891;&#x7387;&#x7684;&#x6B63;&#x5F26;&#x6CE2;&#x65E0;&#x6CD5;&#x533A;&#x5206;&#x3002; &#x8FD9;&#x79CD;&#x73B0;&#x8C61;&#x79F0;&#x4E3A;&#x6DF7;&#x53E0;&#xFF0C;&#x5982;&#x679C;&#x4E0D;&#x8FDB;&#x884C;&#x9884;&#x9632;&#xFF0C;&#x53EF;&#x80FD;&#x4F1A;&#x5BFC;&#x81F4;&#x865A;&#x5047;&#x7ED3;&#x679C;&#x3002;</p>
<p>&#x4E3A;&#x4E86;&#x9632;&#x6B62;&#x6570;&#x636E;&#x4E2D;&#x7684;&#x6DF7;&#x53E0;&#x95EE;&#x9898;&#xFF0C;&#x9996;&#x5148;&#x9009;&#x62E9;&#x4E00;&#x4E2A;&#x9891;&#x7387;fmax&#xFF0C;&#x5B83;&#x5927;&#x7EA6;&#x662F;&#x60A8;&#x53EF;&#x4EE5;&#x89C2;&#x5BDF;&#x5230;&#x7684;&#x6700;&#x5927;&#x8FDB;&#x52A8;&#x9891;&#x7387;&#x7684;&#x4E24;&#x500D;&#x3002; &#x7136;&#x540E;&#x786E;&#x4FDD;&#x6570;&#x636E;&#x91C7;&#x96C6;&#x7CFB;&#x7EDF;&#x7684;&#x8F93;&#x5165;&#x4FE1;&#x53F7;&#x6CA1;&#x6709;&#x5927;&#x4E8E;fmax&#x7684;&#x663E;&#x7740;&#x9891;&#x7387;&#x5206;&#x91CF;&#xFF0C;&#x5E76;&#x5C06;&#x91C7;&#x6837;&#x9891;&#x7387;&#x8BBE;&#x7F6E;&#x4E3A;fmax&#x7684;&#x81F3;&#x5C11;&#x4E24;&#x500D;&#x3002; &#x8FD9;&#x5C06;&#x786E;&#x4FDD;&#x8FDB;&#x52A8;&#x4FE1;&#x53F7;&#x7684;&#x91C7;&#x6837;&#x901F;&#x7387;&#x8D85;&#x8FC7;&#x6700;&#x5C0F;&#x901F;&#x7387;&#x7684;&#x4E24;&#x500D;&#xFF0C;&#x5E76;&#x4E14;&#x53EF;&#x4EE5;&#x9632;&#x6B62;&#x4EFB;&#x4F55;&#x6DF7;&#x53E0;&#x3002;</p>
<p>&#x4F8B;&#x5982;&#xFF0C;&#x5728;&#x5730;&#x7403;&#x7684;&#x78C1;&#x573A;&#x4E2D;&#xFF0C;&#x60A8;&#x4E0D;&#x5E94;&#x8BE5;&#x9047;&#x5230;1.5 - 2.4 kHz&#x8303;&#x56F4;&#x4E4B;&#x5916;&#x7684;&#x4EFB;&#x4F55;&#x8FDB;&#x52A8;&#x9891;&#x7387;&#x3002; &#x56E0;&#x6B64;&#xFF0C;&#x60A8;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;5 kHz&#x7684;fmax&#x548C;10 ksps&#x7684;&#x6700;&#x5C0F;&#x91C7;&#x6837;&#x7387;&#x3002; &#x4F7F;&#x7528;Magnum&#x653E;&#x5927;&#x5668;&#xFF0C;&#x60A8;&#x8FD8;&#x53EF;&#x4EE5;&#x786E;&#x4FDD;&#x6CA1;&#x6709;&#x9891;&#x7387;&#x5927;&#x4E8E;5 kHz&#x7684;&#x91CD;&#x8981;&#x4FE1;&#x53F7;&#x5C06;&#x8FDB;&#x5165;&#x6570;&#x636E;&#x91C7;&#x96C6;&#x7CFB;&#x7EDF;&#x3002;</p>
<h3 id="62-what-solution-to-use"><a class="markdownIt-Anchor" href="#62-what-solution-to-use"></a> 6.2 What solution to use</h3>
<p>&#x63A5;&#x4E0B;&#x6765;&#x8981;&#x8003;&#x8651;&#x7684;&#x662F;&#x4F7F;&#x7528;&#x4EC0;&#x4E48;&#x5206;&#x8FA8;&#x7387;&#x3002; &#x5206;&#x8FA8;&#x7387;&#x662F;&#x6307;&#x6570;&#x636E;&#x91C7;&#x96C6;&#x7CFB;&#x7EDF;&#x8BC6;&#x522B;&#x51FA;&#x591A;&#x5C11;&#x4E2A;&#x72EC;&#x7279;&#x7684;&#x7535;&#x538B;&#x7535;&#x5E73;&#xFF0C;&#x8FD9;&#x53D6;&#x51B3;&#x4E8E;&#x7528;&#x4E8E;&#x8868;&#x793A;&#x6BCF;&#x4E2A;&#x91C7;&#x6837;&#x7684;&#x4F4D;&#x6570;&#x3002; &#x6240;&#x53D1;&#x751F;&#x7684;&#x662F;&#x7CFB;&#x7EDF;&#x5C06;&#x8FDE;&#x7EED;&#x7535;&#x538B;&#x4FE1;&#x53F7;&#x8F6C;&#x6362;&#x4E3A;&#x56FA;&#x5B9A;&#x957F;&#x5EA6;&#x7684;&#x4E8C;&#x8FDB;&#x5236;&#x6570;&#xFF0C;&#x8BE5;&#x4E8C;&#x8FDB;&#x5236;&#x6570;&#x53EA;&#x80FD;&#x4EE3;&#x8868;&#x4E00;&#x5B9A;&#x6570;&#x91CF;&#x7684;&#x72EC;&#x7279;&#x7535;&#x538B;&#x3002;</p>
<p>&#x4F8B;&#x5982;&#xFF0C;&#x5047;&#x8BBE;&#x6570;&#x636E;&#x91C7;&#x96C6;&#x7CFB;&#x7EDF;&#x4F7F;&#x7528;8&#x4F4D;&#x6765;&#x8868;&#x793A;&#x6BCF;&#x4E2A;&#x6837;&#x672C;&#x3002; &#x7136;&#x540E;&#x5B83;&#x5C06;&#x80FD;&#x591F;&#x533A;&#x5206;28 = 256&#x4E2A;&#x552F;&#x4E00;&#x7EA7;&#x522B;&#x3002; &#x8FD9;&#x610F;&#x5473;&#x7740;&#x5982;&#x679C;&#x8F93;&#x5165;&#x7535;&#x538B;&#x8303;&#x56F4;&#x4E3A;-10&#x5230;+10&#x4F0F;&#xFF0C;&#x5219;&#x53EA;&#x80FD;&#x533A;&#x5206;&#x8D85;&#x8FC7;20/256 = 0.078&#x4F0F;&#x7684;&#x7535;&#x538B;&#x3002;</p>
<p>&#x6570;&#x636E;&#x91C7;&#x96C6;&#x7CFB;&#x7EDF;&#x4E0D;&#x80FD;&#x7CBE;&#x786E;&#x5730;&#x8868;&#x793A;&#x8F93;&#x5165;&#x4FE1;&#x53F7;&#x6837;&#x672C;&#x79F0;&#x4E3A;&#x91CF;&#x5316;&#x8BEF;&#x5DEE;&#x3002; &#x8FD9;&#x9519;&#x8BEF;&#x5730;&#x5C06;&#x566A;&#x58F0;&#x6709;&#x6548;&#x5730;&#x5F15;&#x5165;&#x6570;&#x636E;&#x4E2D;&#xFF0C;&#x8FD9;&#x53EF;&#x80FD;&#x964D;&#x4F4E;&#x6574;&#x4F53;&#x4FE1;&#x566A;&#x6BD4;&#x3002; &#x56E0;&#x6B64;&#xFF0C;&#x6240;&#x9700;&#x7684;&#x5206;&#x8FA8;&#x7387;&#x6216;&#x4F4D;&#x6570;&#x53D6;&#x51B3;&#x4E8E;&#x4FE1;&#x53F7;&#x7684;&#x7279;&#x5F81;&#x4EE5;&#x53CA;&#x60A8;&#x5C1D;&#x8BD5;&#x4ECE;&#x4E2D;&#x63D0;&#x53D6;&#x7684;&#x4FE1;&#x606F;&#x7C7B;&#x578B;&#x3002;</p>
<p>&#x5BF9;&#x4E8E;Magnum&#xFF0C;12&#x4F4D;&#x7684;&#x5206;&#x8FA8;&#x7387;&#x8DB3;&#x4EE5;&#x5141;&#x8BB8;&#x8FDB;&#x52A8;&#x4FE1;&#x53F7;&#x7684;&#x5CF0;&#x503C;&#x4EE5;&#x9AD8;&#x7CBE;&#x5EA6;&#x5B9A;&#x4F4D;&#x3002; &#x5982;&#x679C;&#x60A8;&#x53EA;&#x4F7F;&#x7528;Magnum&#x4F5C;&#x4E3A;&#x78C1;&#x529B;&#x8BA1;&#xFF0C;&#x90A3;&#x4E48;&#x8FD9;&#x5C31;&#x662F;&#x60A8;&#x9700;&#x8981;&#x7684;&#x6240;&#x6709;&#x4FE1;&#x606F;&#x3002; &#x5982;&#x679C;&#x60A8;&#x8BA1;&#x5212;&#x4F7F;&#x7528;Magnum&#x8FDB;&#x884C;&#x66F4;&#x4E00;&#x822C;&#x7684;NMR&#x7C7B;&#x578B;&#x5B9E;&#x9A8C;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x4E0D;&#x9700;&#x8981;&#x8BA8;&#x8BBA;&#xFF0C;&#x60A8;&#x53EA;&#x9700;&#x8981;&#x66F4;&#x9AD8;&#x7684;&#x5206;&#x8FA8;&#x7387;&#x3002;</p>
<h3 id="63-&#x83B7;&#x53D6;&#x6570;&#x636E;&#x7684;&#x65F6;&#x95F4;-how-long-to-take-data"><a class="markdownIt-Anchor" href="#63-&#x83B7;&#x53D6;&#x6570;&#x636E;&#x7684;&#x65F6;&#x95F4;-how-long-to-take-data"></a> 6.3 &#x83B7;&#x53D6;&#x6570;&#x636E;&#x7684;&#x65F6;&#x95F4; How long to take Data</h3>
<p>&#x83B7;&#x53D6;&#x6570;&#x636E;&#x7684;&#x65F6;&#x95F4;&#x957F;&#x5EA6;&#x51B3;&#x5B9A;&#x4E86;&#x53EF;&#x4EE5;&#x89E3;&#x51B3;&#x4E0D;&#x540C;&#x9891;&#x7387;&#x7684;&#x7A0B;&#x5EA6;&#x3002; &#x60A8;&#x6709;&#x591A;&#x5C11;&#x6570;&#x636E;&#x6216;&#x6837;&#x672C;&#x6709;&#x6548;&#x5730;&#x8BBE;&#x7F6E;&#x9891;&#x7387;&#x5206;&#x8FA8;&#x7387;&#x3002; &#x6837;&#x672C;&#x8D8A;&#x591A;&#xFF0C;&#x9891;&#x7387;&#x5206;&#x8FA8;&#x7387;&#x8D8A;&#x9AD8;&#x3002;</p>
<p>&#x5BF9;&#x4E8E;Magnum&#xFF0C;&#x60A8;&#x5E94;&#x8BE5;&#x83B7;&#x53D6;&#x81F3;&#x5C11;&#x534A;&#x79D2;&#x7684;&#x6570;&#x636E;&#x3002; &#x5982;&#x679C;&#x4F60;&#x660E;&#x663E;&#x5C11;&#x4E8E;&#x6B64;&#xFF0C;&#x5219;&#x8FDB;&#x52A8;&#x4FE1;&#x53F7;&#x9891;&#x8C31;&#x5C06;&#x5F00;&#x59CB;&#x53D8;&#x5BBD;&#xFF0C;&#x5E76;&#x4E14;&#x53EF;&#x80FD;&#x53D8;&#x5F97;&#x66F4;&#x96BE;&#x4EE5;&#x7CBE;&#x786E;&#x5B9A;&#x4F4D;&#x5CF0;&#x503C;&#x3002; &#x53EF;&#x7528;&#x7684;&#x8FDB;&#x52A8;&#x4FE1;&#x53F7;&#x5C06;&#x6301;&#x7EED;&#x4E0D;&#x8D85;&#x8FC7;2&#x5230;3&#x79D2;&#xFF0C;&#x56E0;&#x6B64;&#x4E0D;&#x9700;&#x8981;&#x6BD4;&#x8FD9;&#x66F4;&#x957F;&#x65F6;&#x95F4;&#x5730;&#x83B7;&#x53D6;&#x6570;&#x636E;&#x3002; &#x5BF9;&#x4E8E;&#x5927;&#x591A;&#x6570;&#x76EE;&#x7684;&#x800C;&#x8A00;&#xFF0C;&#x4ECE;0.5&#x5230;3.0&#x79D2;&#x7684;&#x4EFB;&#x4F55;&#x5730;&#x65B9;&#x83B7;&#x53D6;&#x6570;&#x636E;&#x5E94;&#x8BE5;&#x662F;&#x8DB3;&#x591F;&#x7684;&#x3002;</p>
<h3 id="64-&#x7528;magnum&#x5236;&#x4F5C;&#x7684;&#x6A21;&#x6570;&#x8F6C;&#x6362;&#x5668;-the-adc-board-used-in-the-magnum"><a class="markdownIt-Anchor" href="#64-&#x7528;magnum&#x5236;&#x4F5C;&#x7684;&#x6A21;&#x6570;&#x8F6C;&#x6362;&#x5668;-the-adc-board-used-in-the-magnum"></a> 6.4 &#x7528;Magnum&#x5236;&#x4F5C;&#x7684;&#x6A21;&#x6570;&#x8F6C;&#x6362;&#x5668; The ADC board used in the Magnum</h3>
<p>Magnum&#x4E2D;&#x4F7F;&#x7528;&#x7684;ADC&#x677F;&#x662F;IOtech&#xFF08;<a href="http://www.iotech.com/" rel="external nofollow noopener noreferrer" target="_blank">http://www.iotech.com/</a>)&#x7684;ADAC / 5501MF&#xFF08;<a href="ftp://ftp.iotech.com/ADAC.5500.20Series.20Users.20Manual.pdf%EF%BC%89%E3%80%82" rel="external nofollow noopener noreferrer" target="_blank">ftp://ftp.iotech.com/ADAC.5500.20Series.20Users.20Manual.pdf&#xFF09;&#x3002;</a> &#x5B83;&#x662F;&#x4E00;&#x4E2A;12&#x4F4D;ADC&#xFF0C;&#x5177;&#x6709;8&#x4E2A;&#x4E0D;&#x5BF9;&#x79F0;&#xFF08;&#x6216;16&#x4E2A;&#x5355;&#x7AEF;&#xFF09;&#x6A21;&#x62DF;&#x8F93;&#x5165;&#xFF0C;&#x6700;&#x5927;&#x91C7;&#x6837;&#x7387;&#x4E3A;100 kHz&#x3002;</p>
<p>&#x9700;&#x8981;&#x4ECE;IOtech&#x83B7;&#x53D6;&#x7684;&#x90E8;&#x4EF6;&#xFF1A;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br></pre></td><td class="code"><pre><span class="line"> - Data acquisition board: ADAC/5501MF $384</span><br><span class="line"> - Terminal board: ADAC-TB-16 $139</span><br><span class="line"> - Cable: CA-G55-ADAC $69</span><br></pre></td></tr></table></figure>
<p>&#x6CA1;&#x6709;&#x5FC5;&#x8981;&#x4F7F;&#x7528;&#x8FD9;&#x4E2A;&#x7279;&#x5B9A;&#x7684;&#x6570;&#x636E;&#x91C7;&#x96C6;&#x677F;&#xFF0C;&#x4F46;&#x672C;&#x4E66;&#x9644;&#x5E26;&#x7684;&#x8F6F;&#x4EF6;&#xFF08;&#x7528;&#x4E8E;&#x4E0E;&#x7535;&#x8DEF;&#x677F;&#x901A;&#x4FE1;&#x5E76;&#x83B7;&#x53D6;&#x6570;&#x636E;&#xFF09;&#x662F;&#x4E3A;&#x8BE5;&#x7535;&#x8DEF;&#x677F;&#x7F16;&#x5199;&#x7684;&#x3002;&#x5982;&#x679C;&#x60A8;&#x66F4;&#x559C;&#x6B22;&#x4F7F;&#x7528;&#x4E0D;&#x540C;&#x7684;&#x6570;&#x636E;&#x91C7;&#x96C6;&#x677F;&#xFF0C; &#x6240;&#x9700;&#x7684;&#x57FA;&#x672C;&#x529F;&#x80FD;&#x662F;&#xFF1A;</p>
<ol>
<li>&#x4E0D;&#x540C;&#x7684;&#x8F93;&#x5165;&#x53E3;</li>
<li>&#x7528;&#x4E8E;&#x89E6;&#x53D1;&#x6570;&#x636E;&#x91C7;&#x96C6;&#x7684;&#x5916;&#x90E8;&#x5F15;&#x811A;&#x3002;</li>
<li>&#x6700;&#x4F4E;&#x91C7;&#x6837;&#x7387;&#x4E3A;&#x6BCF;&#x79D2;10&#x5343;&#x6837;&#x672C;&#x3002;</li>
<li>&#x6BCF;&#x4E2A;&#x6837;&#x672C;12bit&#x6216;&#x66F4;&#x591A;&#x3002;</li>
</ol>
<h3 id="65-&#x8109;&#x51B2;&#x63A7;&#x5236;&#x5668;&#x548C;&#x6570;&#x636E;&#x91C7;&#x96C6;&#x8F6F;&#x4EF6;-pulse-controller-and-data-acquisition-software"><a class="markdownIt-Anchor" href="#65-&#x8109;&#x51B2;&#x63A7;&#x5236;&#x5668;&#x548C;&#x6570;&#x636E;&#x91C7;&#x96C6;&#x8F6F;&#x4EF6;-pulse-controller-and-data-acquisition-software"></a> 6.5 &#x8109;&#x51B2;&#x63A7;&#x5236;&#x5668;&#x548C;&#x6570;&#x636E;&#x91C7;&#x96C6;&#x8F6F;&#x4EF6; Pulse controller and data acquisition software</h3>
<p>Magnum&#x7684;&#x6574;&#x4F53;&#x63A7;&#x5236;&#x548C;&#x64CD;&#x4F5C;&#x7531;PC&#x4E0A;&#x8FD0;&#x884C;&#x7684;&#x540D;&#x4E3A;ADL&#xFF08;&#x540D;&#x79F0;&#x6CA1;&#x6709;&#x91CD;&#x8981;&#x6027;&#xFF09;&#x7684;&#x7A0B;&#x5E8F;&#x5904;&#x7406;&#x3002;&#x8BE5;&#x7A0B;&#x5E8F;&#x8BFB;&#x53D6;&#x4E00;&#x4E2A;&#x53C2;&#x6570;&#x6587;&#x4EF6;&#xFF0C;&#x8BE5;&#x6587;&#x4EF6;&#x6307;&#x5B9A;&#x5982;&#x4F55;&#x8FD0;&#x884C;Magnum&#x3002;&#x53C2;&#x6570;&#x6587;&#x4EF6;&#x662F;&#x7EAF;&#x6587;&#x672C;&#x6587;&#x4EF6;&#xFF0C;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x4EFB;&#x4F55;&#x6587;&#x672C;&#x7F16;&#x8F91;&#x5668;&#x521B;&#x5EFA;&#x3002;</p>
<p>ADL&#x5C06;&#x53C2;&#x6570;&#x6587;&#x4EF6;&#x4E2D;&#x7684;&#x4E00;&#x4E9B;&#x4FE1;&#x606F;&#x8F6C;&#x6362;&#x4E3A;&#x8109;&#x51B2;&#x5207;&#x6362;&#x5668;&#x4E2D;&#x5FAE;&#x63A7;&#x5236;&#x5668;&#x7684;&#x6307;&#x4EE4;&#x3002;&#x7136;&#x540E;&#xFF0C;&#x5B83;&#x901A;&#x8FC7;&#x4E32;&#x884C;RS232&#x8FDE;&#x63A5;&#x5C06;&#x8FD9;&#x4E9B;&#x6307;&#x4EE4;&#x53D1;&#x9001;&#x5230;&#x5207;&#x6362;&#x53F0;&#x3002;&#x6307;&#x4EE4;&#x544A;&#x8BC9;&#x5207;&#x6362;&#x5668;&#x6253;&#x5F00;&#x504F;&#x632F;&#x7EBF;&#x5708;&#x4E2D;&#x7684;&#x7535;&#x6D41;&#x591A;&#x957F;&#x65F6;&#x95F4;&#x4EE5;&#x53CA;&#x5173;&#x95ED;&#x7535;&#x6D41;&#x548C;&#x89E6;&#x53D1;&#x6570;&#x636E;&#x91C7;&#x96C6;&#x4E4B;&#x95F4;&#x7B49;&#x5F85;&#x7684;&#x65F6;&#x95F4;&#x3002;</p>
<p>&#x8BBE;&#x7F6E;&#x5207;&#x6362;&#x53F0;&#x540E;&#xFF0C;ADL&#x4F7F;&#x7528;&#x53C2;&#x6570;&#x6587;&#x4EF6;&#x4E2D;&#x7684;&#x9644;&#x52A0;&#x4FE1;&#x606F;&#x6765;&#x8BBE;&#x7F6E;&#x6570;&#x636E;&#x91C7;&#x96C6;&#x7CFB;&#x7EDF;&#x3002;&#x91CD;&#x8981;&#x7684;&#x6570;&#x636E;&#x91C7;&#x96C6;&#x53C2;&#x6570;&#x662F;&#x589E;&#x76CA;&#xFF0C;&#x91C7;&#x6837;&#x7387;&#x548C;&#x8981;&#x91C7;&#x6837;&#x7684;&#x6837;&#x672C;&#x6570;&#x3002;&#x8FD9;&#x4E9B;&#x5C06;&#x5728;&#x4E0B;&#x9762;&#x8FDB;&#x4E00;&#x6B65;&#x63CF;&#x8FF0;&#x3002;</p>
<p>&#x8981;&#x542F;&#x52A8;&#x8109;&#x51B2;&#xFF0C;ADL&#x5C06;&#x8FD0;&#x884C;&#x7A0B;&#x5E8F;&#x547D;&#x4EE4;&#x53D1;&#x9001;&#x5230;&#x8109;&#x51B2;&#x5207;&#x6362;&#x5668;&#x3002;&#x7136;&#x540E;&#x8109;&#x51B2;&#x5207;&#x6362;&#x5668;&#x5C06;&#x504F;&#x632F;&#x7EBF;&#x5708;&#x4E2D;&#x7684;&#x7535;&#x6D41;&#x63A5;&#x901A;&#x6307;&#x5B9A;&#x7684;&#x65F6;&#x95F4;&#x3002;&#x5173;&#x95ED;&#x7535;&#x6D41;&#x540E;&#xFF0C;&#x5207;&#x6362;&#x5668;&#x4F1A;&#x5728;&#x89E6;&#x53D1;&#x6570;&#x636E;&#x91C7;&#x96C6;&#x7CFB;&#x7EDF;&#xFF08;DAQ&#xFF09;&#x5F00;&#x59CB;&#x91C7;&#x96C6;&#x6570;&#x636E;&#x4E4B;&#x524D;&#x7B49;&#x5F85;&#x5F88;&#x77ED;&#x7684;&#x65F6;&#x95F4;&#x3002;</p>
<p>&#x6570;&#x636E;&#x91C7;&#x96C6;&#x5B8C;&#x6210;&#x540E;&#xFF0C;ADL&#x5C06;&#x5BF9;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x7F29;&#x653E;&#xFF0C;&#x4EE5;&#x4F7F;&#x503C;&#x53CD;&#x6620;&#x771F;&#x5B9E;&#x7684;&#x7535;&#x538B;&#x7535;&#x5E73;&#x3002; &#x5982;&#x679C;&#x6307;&#x5B9A;&#x4E86;&#x591A;&#x4E2A;&#x8109;&#x51B2;&#xFF0C;&#x5219;&#x5C06;&#x53E6;&#x4E00;&#x4E2A;&#x8FD0;&#x884C;&#x7A0B;&#x5E8F;&#x547D;&#x4EE4;&#x53D1;&#x9001;&#x5230;&#x8109;&#x51B2;&#x5207;&#x6362;&#x5668;&#xFF0C;&#x5E76;&#x91CD;&#x590D;&#x4E0A;&#x8FF0;&#x8FC7;&#x7A0B;&#x3002; &#x7A0B;&#x5E8F;&#x5E73;&#x5747;&#x6765;&#x81EA;&#x6240;&#x6709;&#x8109;&#x51B2;&#x7684;&#x6570;&#x636E;&#x5E76;&#x5C06;&#x7ED3;&#x679C;&#x5B58;&#x50A8;&#x5728;&#x6570;&#x636E;&#x6587;&#x4EF6;&#x4E2D;&#x3002;</p>
<p>&#x5982;&#x4E0A;&#x6240;&#x8FF0;&#xFF0C;ADL&#x6267;&#x884C;&#x7CFB;&#x7EDF;&#x8BBE;&#x7F6E;&#x548C;&#x8FD0;&#x884C;&#x6240;&#x9700;&#x7684;&#x53C2;&#x6570;&#x5305;&#x542B;&#x5728;&#x8FD0;&#x884C;&#x7A0B;&#x5E8F;&#x65F6;&#x5728;&#x547D;&#x4EE4;&#x884C;&#x4E0A;&#x6307;&#x5B9A;&#x7684;&#x53C2;&#x6570;&#x6587;&#x4EF6;&#x4E2D;&#x3002; &#x793A;&#x4F8B;&#x53C2;&#x6570;&#x6587;&#x4EF6;&#x5982;&#x4E0B;&#x6240;&#x793A;&#x3002;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br></pre></td><td class="code"><pre><span class="line">ADAC5501 // Device name (32 char max)</span><br><span class="line">D // Input type [D]ifferential or [S]ingle ended</span><br><span class="line">0 // Channel number [0-7] (Diff) or [0-15] (SE)</span><br><span class="line">B // Polarity [U]nipolar or [B]ipolar</span><br><span class="line">1 // Gain [1,2,4,8,16,32,64]</span><br><span class="line">16384 // Samples per second</span><br><span class="line">65536 // Number of samples</span><br><span class="line">6.0 // Pulse length in seconds [0-13]</span><br><span class="line">0.1 // Daq trigger delay in seconds</span><br><span class="line">4 // Number of pulses</span><br><span class="line">10.0 // Pulse delay in seconds</span><br><span class="line">magnum1.dat // Output file name</span><br></pre></td></tr></table></figure>
<p>&#x6240;&#x6709;&#x8FD9;&#x4E9B;&#x53C2;&#x6570;&#x5FC5;&#x987B;&#x51FA;&#x73B0;&#x5728;&#x6BCF;&#x4E2A;&#x53C2;&#x6570;&#x6587;&#x4EF6;&#x4E2D;&#xFF0C;&#x5E76;&#x4E14;&#x5FC5;&#x987B;&#x6309;&#x6240;&#x793A;&#x987A;&#x5E8F;&#x663E;&#x793A;&#x3002; &#x6BCF;&#x884C;&#x7684;&#x7B2C;&#x4E00;&#x9879;&#x662F;&#x53C2;&#x6570;&#x7684;&#x503C;&#xFF0C;&#x53CC;&#x659C;&#x6760;&#x6807;&#x8BB0;&#x540E;&#x9762;&#x7684;&#x6240;&#x6709;&#x5185;&#x5BB9;&#x90FD;&#x662F;&#x6CE8;&#x91CA;&#x3002; &#x6CE8;&#x91CA;&#x63CF;&#x8FF0;&#x4E86;&#x53C2;&#x6570;&#x662F;&#x4EC0;&#x4E48;&#x4EE5;&#x53CA;&#x5B83;&#x53EF;&#x4EE5;&#x91C7;&#x7528;&#x7684;&#x53EF;&#x80FD;&#x503C;&#x3002;</p>
<p>&#x524D;&#x4E03;&#x4E2A;&#x53C2;&#x6570;&#x7528;&#x4E8E;&#x521D;&#x59CB;&#x5316;&#x6570;&#x636E;&#x91C7;&#x96C6;&#x7CFB;&#x7EDF;&#x3002;&#x63A5;&#x4E0B;&#x6765;&#x7684;&#x56DB;&#x4E2A;&#x7528;&#x4E8E;&#x521D;&#x59CB;&#x5316;&#x8109;&#x51B2;&#x7F16;&#x7A0B;&#x5668;&#x548C;&#x8FD0;&#x884C;&#x8109;&#x51B2;&#x5E8F;&#x5217;&#x3002;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x53C2;&#x6570;&#x7ED9;&#x51FA;&#x4E86;&#x7A0B;&#x5E8F;&#x8FD0;&#x884C;&#x65F6;&#x521B;&#x5EFA;&#x7684;&#x6570;&#x636E;&#x6587;&#x4EF6;&#x7684;&#x540D;&#x79F0;&#x3002;&#x6211;&#x4EEC;&#x73B0;&#x5728;&#x5C06;&#x63CF;&#x8FF0;&#x6BCF;&#x4E2A;&#x53C2;&#x6570;&#x7684;&#x542B;&#x4E49;&#x3002;</p>
<p>&#x5982;&#x679C;&#x7CFB;&#x7EDF;&#x4F7F;&#x7528;&#x591A;&#x4E2A;&#x6570;&#x636E;&#x91C7;&#x96C6;&#x5361;&#xFF0C;&#x5219;&#x8BBE;&#x5907;&#x540D;&#x79F0;&#x53C2;&#x6570;&#x4EC5;&#x5177;&#x6709;&#x610F;&#x4E49;&#x3002;&#x8BE5;&#x53C2;&#x6570;&#x5B9E;&#x9645;&#x4E0A;&#x5E76;&#x672A;&#x7531;ADL&#x4F7F;&#x7528;&#xFF0C;&#x4F46;&#x5B83;&#x5305;&#x542B;&#x5728;&#x5185;&#xFF0C;&#x56E0;&#x6B64;&#x53EF;&#x4EE5;&#x8F7B;&#x677E;&#x4FEE;&#x6539;&#x7A0B;&#x5E8F;&#x4EE5;&#x4F7F;&#x7528;&#x591A;&#x4E2A;&#x6570;&#x636E;&#x91C7;&#x96C6;&#x5361;&#x3002;&#x4F46;&#x5B83;&#x5FC5;&#x987B;&#x4FDD;&#x7559;&#x4E3A;&#x53C2;&#x6570;&#x6587;&#x4EF6;&#x4E2D;&#x7684;&#x7B2C;&#x4E00;&#x9879;&#x3002;</p>
<p>&#x8F93;&#x5165;&#x7C7B;&#x578B;&#x53C2;&#x6570;&#x6709;&#x4E24;&#x4E2A;&#x53EF;&#x80FD;&#x7684;&#x503C;&#xFF1A;D&#x8868;&#x793A;&#x4E0D;&#x540C;&#x7684;&#x503C;&#xFF0C;S&#x8868;&#x793A;&#x5355;&#x7AEF;&#x7684;&#x503C;&#x3002;&#x8BE5;&#x53C2;&#x6570;&#x6307;&#x7684;&#x662F;&#x6570;&#x636E;&#x91C7;&#x96C6;&#x7CFB;&#x7EDF;&#x5904;&#x7406;&#x5176;&#x8F93;&#x5165;&#x901A;&#x9053;&#x4E0A;&#x5B58;&#x5728;&#x7684;&#x4FE1;&#x53F7;&#x7684;&#x65B9;&#x5F0F;&#x3002;&#x5355;&#x7AEF;&#x8F93;&#x5165;&#x7535;&#x538B;16&#x4E2A;&#x8F93;&#x5165;&#x901A;&#x9053;&#x76F8;&#x5BF9;&#x4E8E;&#x5730;&#x88AB;&#x6570;&#x5B57;&#x5316;&#x3002;&#x5BF9;&#x4E8E;&#x5DEE;&#x5206;&#x8F93;&#x5165;&#xFF0C;&#x6570;&#x5B57;&#x5316;&#x7684;&#x662F;&#x76F8;&#x90BB;&#x5947;&#x6570;&#x548C;&#x5076;&#x6570;&#x901A;&#x9053;&#x4E4B;&#x95F4;&#x7684;&#x7535;&#x538B;&#x5DEE;&#x3002;&#x5DEE;&#x5206;&#x8F93;&#x5165;&#x6BD4;&#x5355;&#x7AEF;&#x8F93;&#x5165;&#x63D0;&#x4F9B;&#x66F4;&#x9AD8;&#x7A0B;&#x5EA6;&#x7684;&#x6297;&#x566A;&#x58F0;&#x6295;&#x5165;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5EFA;&#x8BAE;&#x5C06;&#x5DEE;&#x503C;&#x8F93;&#x5165;&#x59CB;&#x7EC8;&#x4E0E;Magnum&#x4E00;&#x8D77;&#x4F7F;&#x7528;&#x3002;</p>
<hr>
<h2 id="&#x7B2C;&#x4E03;&#x7AE0;-&#x6570;&#x636E;&#x5904;&#x7406;&#x4E0E;&#x5206;&#x6790;-chapter-7-data-processing-and-analysis"><a class="markdownIt-Anchor" href="#&#x7B2C;&#x4E03;&#x7AE0;-&#x6570;&#x636E;&#x5904;&#x7406;&#x4E0E;&#x5206;&#x6790;-chapter-7-data-processing-and-analysis"></a> &#x7B2C;&#x4E03;&#x7AE0; &#x6570;&#x636E;&#x5904;&#x7406;&#x4E0E;&#x5206;&#x6790;-Chapter 7 Data Processing and Analysis</h2>
<h3 id="71-&#x4FE1;&#x53F7;&#x5E73;&#x5747;"><a class="markdownIt-Anchor" href="#71-&#x4FE1;&#x53F7;&#x5E73;&#x5747;"></a> 7.1 &#x4FE1;&#x53F7;&#x5E73;&#x5747;</h3>
<h4 id="711-&#x4E3A;&#x4EC0;&#x4E48;&#x5B83;&#x4F1A;&#x63D0;&#x9AD8;&#x4FE1;&#x566A;&#x6BD4;"><a class="markdownIt-Anchor" href="#711-&#x4E3A;&#x4EC0;&#x4E48;&#x5B83;&#x4F1A;&#x63D0;&#x9AD8;&#x4FE1;&#x566A;&#x6BD4;"></a> 7.11 &#x4E3A;&#x4EC0;&#x4E48;&#x5B83;&#x4F1A;&#x63D0;&#x9AD8;&#x4FE1;&#x566A;&#x6BD4;</h4>
<p>&#x4FE1;&#x53F7;&#x5E73;&#x5747;&#x662F;&#x5C06;&#x5728;&#x76F8;&#x540C;&#x6761;&#x4EF6;&#x4E0B;&#x91C7;&#x96C6;&#x7684;&#x6570;&#x636E;&#x96C6;&#x5408;&#x5728;&#x4E00;&#x8D77;&#x7684;&#x505A;&#x6CD5;&#x3002; &#x671F;&#x671B;&#x7684;&#x6548;&#x679C;&#x662F;&#x964D;&#x4F4E;&#x566A;&#x58F0;&#x5E76;&#x589E;&#x5F3A;&#x4FE1;&#x53F7;&#x3002; &#x4FE1;&#x53F7;&#x5E73;&#x5747;&#x7684;&#x5DE5;&#x4F5C;&#x539F;&#x7406;&#x662F;&#x566A;&#x58F0;&#x662F;&#x968F;&#x673A;&#x7684;&#xFF0C;&#x800C;&#x4FE1;&#x53F7;&#x5219;&#x5D4C;&#x5165;&#x5176;&#x4E2D;&#x566A;&#x97F3;&#x4E0D;&#x662F;&#x3002; &#x56E0;&#x6B64;&#xFF0C;&#x5C06;&#x591A;&#x4E2A;&#x6570;&#x636E;&#x96C6;&#x5408;&#x5728;&#x4E00;&#x8D77;&#x5F80;&#x5F80;&#x4F1A;&#x5728;&#x52A0;&#x5F3A;&#x4FE1;&#x53F7;&#x7684;&#x540C;&#x65F6;&#x6D88;&#x9664;&#x566A;&#x58F0;&#x3002;</p>
<h4 id="712-&#x7531;&#x4E8E;mosfet&#x7684;&#x51CF;&#x901F;&#x5BFC;&#x81F4;&#x7684;&#x9650;&#x5236;-limits-due-to-mosfet-slow-down"><a class="markdownIt-Anchor" href="#712-&#x7531;&#x4E8E;mosfet&#x7684;&#x51CF;&#x901F;&#x5BFC;&#x81F4;&#x7684;&#x9650;&#x5236;-limits-due-to-mosfet-slow-down"></a> 7.12 &#x7531;&#x4E8E;MOSFET&#x7684;&#x51CF;&#x901F;&#x5BFC;&#x81F4;&#x7684;&#x9650;&#x5236;-Limits due to MOSFET slow down</h4>
<p>Magnum&#x7684;&#x8109;&#x51B2;&#x63A7;&#x5236;&#x5668;&#x4F7F;&#x7528;MOSFET<sup class="footnote-ref"><a href="#fn1" id="fnref1">[1]</a></sup>&#x6765;&#x5173;&#x95ED;&#x6781;&#x5316;&#x7EBF;&#x5708;&#x4E2D;&#x7684;&#x7535;&#x6D41;&#x3002; &#x6BCF;&#x6B21;&#x5173;&#x95ED;&#x7535;&#x6D41;&#x65F6;&#xFF0C;&#x6267;&#x884C;&#x6B64;&#x64CD;&#x4F5C;&#x6240;&#x9700;&#x7684;&#x80FD;&#x91CF;&#x5728;MOSFET&#x4E2D;&#x8017;&#x6563;&#xFF0C;&#x5BFC;&#x81F4;&#x5B83;&#x4EEC;&#x5347;&#x6E29;&#x3002; &#x968F;&#x7740;&#x7535;&#x6D41;&#x5F00;&#x542F;&#x548C;&#x5173;&#x95ED;&#xFF0C;MOSFET&#x7EE7;&#x7EED;&#x53D8;&#x6696;&#x3002;</p>
<p>MOSFET&#x7684;&#x5173;&#x65AD;&#x65F6;&#x95F4;&#x968F;&#x7740;&#x6E29;&#x5EA6;&#x7684;&#x5347;&#x9AD8;&#x800C;&#x589E;&#x52A0;&#x3002; &#x7ED3;&#x679C;&#x662F;&#xFF0C;&#x5229;&#x7528;&#x8109;&#x51B2;&#x63A7;&#x5236;&#x5668;&#x83B7;&#x5F97;&#x7684;&#x6BCF;&#x4E2A;&#x8FDE;&#x7EED;&#x6570;&#x636E;&#x96C6;&#x5177;&#x6709;&#x7A0D;&#x5FAE;&#x51CF;&#x5C0F;&#x7684;&#x4FE1;&#x53F7;&#x5E76;&#x4E14;&#x7A0D;&#x540E;&#x7A0D;&#x5FAE;&#x79FB;&#x4F4D;&#x3002; &#x56E0;&#x6B64;&#xFF0C;&#x6BCF;&#x4E2A;&#x6570;&#x636E;&#x96C6;&#x4E2D;&#x7684;&#x4FE1;&#x53F7;&#x4E0D;&#x76F8;&#x540C;&#xFF0C;&#x5E76;&#x4E14;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#x7684;&#x4FE1;&#x53F7;&#x5E73;&#x5747;&#x4E0D;&#x5982;&#x7406;&#x8BBA;&#x4E0A;&#x6709;&#x6548;&#x3002;</p>
<p>&#x8BF7;&#x6CE8;&#x610F;&#xFF0C;&#x4FDD;&#x6301;MOSFET&#x70ED;&#x8FDE;&#x63A5;&#x5728;&#x4E00;&#x8D77;&#x5E76;&#x4E0E;&#x826F;&#x597D;&#x7684;&#x6563;&#x70ED;&#x5668;&#x63A5;&#x89E6;&#xFF0C;&#x5982;&#x8109;&#x51B2;&#x63A7;&#x5236;&#x5668;&#x4E2D;&#x6240;&#x505A;&#x7684;&#x90A3;&#x6837;&#xFF0C;&#x53EF;&#x4EE5;&#x6700;&#x5927;&#x9650;&#x5EA6;&#x5730;&#x51CF;&#x5C11;MOSFET&#x7684;&#x8FD9;&#x79CD;&#x9650;&#x5236;&#x3002;</p>
<h3 id="72-&#x8FC7;&#x6EE4;&#x6570;&#x636E;"><a class="markdownIt-Anchor" href="#72-&#x8FC7;&#x6EE4;&#x6570;&#x636E;"></a> 7.2 &#x8FC7;&#x6EE4;&#x6570;&#x636E;</h3>
<p>&#x539F;&#x59CB;&#x6570;&#x636E;&#x901A;&#x5E38;&#x5305;&#x542B;&#x5F88;&#x591A;&#x566A;&#x97F3;&#x3002; &#x56FE;7.1&#x663E;&#x793A;&#x4E86;&#x539F;&#x59CB;&#x6570;&#x636E;&#x7684;&#x524D;4&#x79D2;&#x56FE;&#xFF0C;DAQ&#x89E6;&#x53D1;&#x5EF6;&#x8FDF;&#x4E3A;0.1&#x79D2;&#xFF08;&#x91C7;&#x6837;&#x7387;&#xFF1A;16384&#xFF0C;&#x6837;&#x672C;&#xFF1A;&#x84B8;&#x998F;&#x6C34;&#xFF0C;&#x5730;&#x70B9;&#xFF1A;Longmont&#xFF0C;Colorado&#xFF0C;&#x65F6;&#x95F4;&#xFF1A;2007&#x5E74;2&#x6708;8&#x65E5;&#xFF0C;17&#xFF1A;34<br>
MST&#xFF09;&#x3002;</p>
<p><img src="/2018/11/21/&#x5730;&#x78C1;/rawdata.jpg" alt=""></p>
<p>&#x56FE;7.1&#xFF1A;&#x539F;&#x59CB;&#x6570;&#x636E;&#xFF1A;&#x7B2C;1&#x4E2A;4&#x79D2;&#xFF0C;&#x89E6;&#x53D1;&#x5EF6;&#x8FDF;0.1&#x79D2;&#xFF0C;&#x84B8;&#x998F;&#x6C34;&#x6837;&#x54C1;&#x3002;</p>
<p>&#x9996;&#x5148;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x662F;&#xFF0C;&#x5728;&#x5DE6;&#x4FA7;&#xFF0C;&#x6211;&#x4EEC;&#x4F1A;&#x770B;&#x5230;&#x7531;&#x4E8E;&#x5F53;&#x524D;&#x5207;&#x6362;&#x5F15;&#x8D77;&#x7684;&#x77AC;&#x6001;&#x3002; &#x6B64;&#x5916;&#xFF0C;&#x5B83;&#x975E;&#x5E38;&#x5608;&#x6742;&#xFF0C;&#x65E0;&#x6CD5;&#x770B;&#x5230;&#x4FE1;&#x53F7;&#x3002;</p>
<p>&#x8BA9;&#x6211;&#x4EEC;&#x5220;&#x9664;&#x7B2C;&#x4E00;&#x4E2A;2000&#x4E2A;&#x6570;&#x636E;&#x70B9;&#x4EE5;&#x6D88;&#x9664;&#x77AC;&#x6001;&#xFF0C;&#x7136;&#x540E;&#x4FDD;&#x6301;&#x7B2C;&#x4E00;&#x4E2A;2&#x79D2;&#xFF08;32768&#x70B9;&#xFF09;&#x3002; &#x56FE;7.2&#x663E;&#x793A;&#x4E86;&#x7ED3;&#x679C;&#x3002;</p>
<p><img src="/2018/11/21/&#x5730;&#x78C1;/7.2.jpg" alt="7.2"></p>
<p>&#x56FE;7.2&#xFF1A;&#x539F;&#x59CB;&#x6570;&#x636E;&#xFF1A;&#x53BB;&#x9664;&#x77AC;&#x53D8;&#x540E;&#x7684;&#x7B2C;2&#x79D2;&#x3002;</p>
<p>&#x6CE8;&#x610F;&#xFF1A;&#x4E0B;&#x9762;&#x63D0;&#x5230;&#x7684;&#x6240;&#x6709;&#x8F6F;&#x4EF6;&#x90FD;&#x53EF;&#x4EE5;&#x5728;&#x6211;&#x4EEC;&#x7684;&#x6570;&#x5B57;&#x4FE1;&#x53F7;&#x5904;&#x7406;&#x9875;&#x9762;&#xFF08;<a href="http://www.exstrom.com/journal/sigproc/" rel="external nofollow noopener noreferrer" target="_blank">http://www.exstrom.com/journal/sigproc/</a>)&#x4E0A;&#x627E;&#x5230;&#x3002;</p>
<p>&#x73B0;&#x5728;&#x8BA9;&#x6211;&#x4EEC;&#x901A;&#x8FC7;&#x5BF9;&#x8FD9;&#x4E9B;&#x6570;&#x636E;&#x5E94;&#x7528;6&#x9636;Butter-worth&#x5E26;&#x901A;&#x6EE4;&#x6CE2;&#x5668;&#x6765;&#x6D88;&#x9664;&#x4E00;&#x4E9B;&#x566A;&#x58F0;&#x3002; &#x6839;&#x636E;&#x6211;&#x4EEC;&#x5BF9;&#x7B2C;5&#x7AE0;&#x6240;&#x8FF0;&#x7684;&#x5730;&#x7403;&#x78C1;&#x573A;&#x5F3A;&#x5EA6;&#x7684;&#x4F30;&#x8BA1;&#xFF0C;&#x6211;&#x4EEC;&#x5728;&#x79D1;&#x7F57;&#x62C9;&#x591A;&#x5DDE;&#x6717;&#x8499;&#x7279;&#x7684;&#x8D28;&#x5B50;&#x8FDB;&#x52A8;&#x9891;&#x7387;&#x5E94;&#x8BE5;&#x662F;&#x5927;&#x7EA6;2250&#x8D6B;&#x5179;&#x3002; &#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x5C06;&#x622A;&#x6B62;&#x9891;&#x7387;&#x8BBE;&#x4E3A;2100&#x548C;2400 Hz&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x4E3A;&#x6211;&#x4EEC;&#x7684;6&#x9636;Butterworth&#x5E26;&#x901A;&#x6EE4;&#x6CE2;&#x5668;&#x521B;&#x5EFA;&#x7CFB;&#x6570;&#x6587;&#x4EF6;&#xFF0C;&#x5982;&#x4E0B;&#x6240;&#x793A;&#xFF1A;</p>
<p>bwbp 6 0.25620000 0.29280000 1 bpfmagnum.cof</p>
<p>&#x5176;&#x4E2D;&#x6D6E;&#x70B9;&#x6570;&#x662F;&#x65E0;&#x91CF;&#x7EB2;&#x622A;&#x6B62;&#x9891;&#x7387;&#xFF0C;&#x4F7F;&#x7528;&#x6211;&#x4EEC;&#x7684;&#x6570;&#x5B57;&#x4FE1;&#x53F7;&#x5904;&#x7406;&#x9875;&#x9762;&#x4E0A;&#x7684;&#x8BA1;&#x7B97;&#x5668;&#x4ECE;&#x5B9E;&#x9645;&#x9891;&#x7387;&#x8F6C;&#x6362;&#x800C;&#x6765;&#x3002; &#x8BF7;&#x6CE8;&#x610F;&#xFF0C;&#x8981;&#x8FDB;&#x884C;&#x6B64;&#x8F6C;&#x6362;&#xFF0C;&#x60A8;&#x5FC5;&#x987B;&#x77E5;&#x9053;&#x7528;&#x4E8E;&#x83B7;&#x53D6;&#x6570;&#x636E;&#x7684;&#x91C7;&#x6837;&#x7387;&#x3002; &#x5982;&#x679C;&#x4F7F;&#x7528;&#x672C;&#x4E66;&#x9644;&#x5E26;&#x7684;&#x8F6F;&#x4EF6;&#xFF0C;&#x5219;&#x5B83;&#x4F4D;&#x4E8E;&#x6570;&#x636E;&#x6587;&#x4EF6;&#x7684;&#x6807;&#x9898;&#x4E2D;&#x3002; &#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5B83;&#x662F;16393.4426 sps&#x3002;</p>
<p>&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x5F97;&#x5230;&#x4E86;&#x5E26;&#x901A;&#x6EE4;&#x6CE2;&#x5668;&#x7684;&#x9891;&#x7387;&#x54CD;&#x5E94;</p>
<p>rffr bpfmagnum.cof 32768 bpfmagnum.fft</p>
<p>&#x63D0;&#x53D6;&#x5E45;&#x5EA6;&#xFF0C;&#x8FD9;&#x662F;&#x8BE5;&#x6587;&#x4EF6;&#x7684;&#x7B2C;&#x4E00;&#x5217;&#xFF08;&#x7B2C;&#x4E8C;&#x5217;&#x662F;&#x9636;&#x6BB5;&#xFF09;&#xFF1A;</p>
<p>extract r bpfmagnum.fft 32768 bpfmagnum&#x3002;</p>
<p>&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5728;&#x56FE;7.3&#x4E2D;&#x770B;&#x5230;&#x6EE4;&#x6CE2;&#x5668;&#x7684;&#x9891;&#x7387;&#x54CD;&#x5E94;&#x662F;&#x4EC0;&#x4E48;&#x3002;</p>
<p><img src="/2018/11/21/&#x5730;&#x78C1;/7.3.jpg" alt="7.3"><br>
&#x56FE;7.3&#xFF1A;Butterworth&#x5E26;&#x901A;&#x6EE4;&#x6CE2;&#x5668;&#x9891;&#x7387;&#x54CD;&#x5E94;&#xFF0C;6&#x9636;&#xFF0C;fc = 2100,2400 Hz&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x73B0;&#x5728;&#x53EF;&#x4EE5;&#x5220;&#x9664;&#x6211;&#x4EEC;&#x7684;Magnum&#x6570;&#x636E;&#x6587;&#x4EF6;&#xFF1A;</p>
<figure class="highlight plain"><table><tr><td class="gutter"><pre><span class="line">1</span><br></pre></td><td class="code"><pre><span class="line">rdf bpfmagnum.cof elpaso1.dat 2000 32768 elpaso1bpf.dat</span><br></pre></td></tr></table></figure>
<p>&#x7ED3;&#x679C;&#x5982;&#x56FE;7.3&#x6240;&#x793A;&#x3002;</p>
<p><img src="/2018/11/21/&#x5730;&#x78C1;/7.4.jpg" alt="7.4"></p>
<p>&#x56FE;7.4&#xFF1A;&#x4F7F;&#x7528;Butterworth BPF&#x8F93;&#x5165;&#x7684;&#x6570;&#x636E;&#xFF0C;6&#x9636;&#x3002;</p>
<p>&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5728;&#x4E24;&#x4E2A;2&#x79D2;&#x7684;&#x6570;&#x636E;&#x4E2D;&#x770B;&#x5230;&#x6211;&#x4EEC;&#x7684;&#x81EA;&#x7531;&#x611F;&#x5E94;&#x8870;&#x51CF;&#x3002;</p>
<h3 id="73-&#x5229;&#x7528;fft&#x8FDB;&#x884C;&#x5149;&#x8C31;&#x5206;&#x6790;"><a class="markdownIt-Anchor" href="#73-&#x5229;&#x7528;fft&#x8FDB;&#x884C;&#x5149;&#x8C31;&#x5206;&#x6790;"></a> 7.3 &#x5229;&#x7528;FFT&#x8FDB;&#x884C;&#x5149;&#x8C31;&#x5206;&#x6790;</h3>
<p>&#x8BA9;&#x6211;&#x4EEC;&#x5BF9;&#x539F;&#x59CB;&#x6570;&#x636E;&#x548C;&#x8FC7;&#x6EE4;&#x6570;&#x636E;&#x8FDB;&#x884C;FFT&#xFF08;&#x8BB0;&#x4F4F;&#x8FC7;&#x6EE4;&#x540E;&#x7684;&#x6570;&#x636E;&#x5DF2;&#x7ECF;&#x5220;&#x9664;&#x4E86;&#x524D;2000&#x4E2A;&#x70B9;&#xFF09;</p>
<p>fft 2000 32768 elpaso1.dat elpaso1.fft<br>
fft 0 32768 elpaso1bpf.dat elpaso1bpf.fft</p>
<p>&#x8003;&#x8651;&#x6211;&#x4EEC;&#x7684;FFT&#x7684;&#x5E45;&#x5EA6;&#xFF1A;</p>
<p>&#x63D0;&#x53D6;m elpaso1.fft 32768 elpaso1.mag<br>
&#x63D0;&#x53D6;m elpaso1bpf.fft 32768 elpaso1bpf.mag</p>
<p>&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x7ED8;&#x5236;&#x548C;&#x6BD4;&#x8F83;FFT&#xFF0C;&#x5982;&#x56FE;7.5&#x548C;7.6&#x6240;&#x793A;</p>
<p>&#x60A8;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x6211;&#x4EEC;&#x7684;&#x5E26;&#x901A;&#x6EE4;&#x6CE2;&#x5668;&#x6709;&#x591A;&#x597D;&#x7528;&#x3002;</p>
<p>&#x56FE;7.7&#x663E;&#x793A;&#x4E86;&#x5CF0;&#x533A;&#x7684;&#x7279;&#x5199;&#x89C6;&#x56FE;&#x3002;</p>
<p>&#x60A8;&#x53EF;&#x80FD;&#x60F3;&#x77E5;&#x9053;&#xFF0C;&#x5728;&#x539F;&#x59CB;&#x6570;&#x636E;&#x7684;FFT&#x4E2D;&#x6709;&#x5982;&#x6B64;&#x591A;&#x7684;&#x566A;&#x58F0;&#xFF0C;&#x60A8;&#x5982;&#x4F55;&#x77E5;&#x9053;&#x54EA;&#x4E2A;&#x5CF0;&#x503C;&#x662F;&#x8D28;&#x5B50;&#x8FDB;&#x52A8;&#x9891;&#x7387;&#xFF1F; &#x5F88;&#x7B80;&#x5355;&#xFF0C;&#x53EA;&#x9700;&#x53D6;&#x4E0B;&#x6837;&#x54C1;&#x74F6;&#xFF0C;&#x518D;&#x53D6;&#x4E00;&#x7EC4;&#x6570;&#x636E;&#xFF0C;&#x7136;&#x540E;&#x4F60;&#x6240;&#x8FFD;&#x6C42;&#x7684;&#x5CF0;&#x503C;&#x5C31;&#x4F1A;&#x6D88;&#x5931;&#x3002; &#x5F53;&#x7136;</p>
<p><img src="/2018/11/21/&#x5730;&#x78C1;/7.5.jpg" alt="7.5"><br>
&#x56FE;7.5&#xFF1A;&#x539F;&#x59CB;&#x6570;&#x636E;&#x7684;FFT&#xFF0C;32768&#x70B9;&#x3002;</p>
<p><img src="/2018/11/21/&#x5730;&#x78C1;/7.6.jpg" alt=""><br>
&#x56FE;7.6&#xFF1A;&#x8FC7;&#x6EE4;&#x6570;&#x636E;&#x7684;FFT&#xFF0C;32768&#x70B9;&#x3002;</p>
<p><img src="/2018/11/21/&#x5730;&#x78C1;/7.7.jpg" alt="7.7"><br>
&#x56FE;7.7&#xFF1A;&#x56FE;7.7&#x7684;&#x7279;&#x5199;&#x89C6;&#x56FE;&#x3002;</p>
<h3 id="74-&#x5C06;bin&#x7F16;&#x53F7;&#x8F6C;&#x5316;&#x4E3A;&#x5B9E;&#x9645;&#x7684;&#x9891;&#x7387;-convert-bin-number-to-actual-frequency"><a class="markdownIt-Anchor" href="#74-&#x5C06;bin&#x7F16;&#x53F7;&#x8F6C;&#x5316;&#x4E3A;&#x5B9E;&#x9645;&#x7684;&#x9891;&#x7387;-convert-bin-number-to-actual-frequency"></a> 7.4 &#x5C06;bin&#x7F16;&#x53F7;&#x8F6C;&#x5316;&#x4E3A;&#x5B9E;&#x9645;&#x7684;&#x9891;&#x7387;-Convert bin number to actual frequency</h3>
<p>&#x4E00;&#x65E6;&#x4F60;&#x5728;FFT&#x56FE;&#x4E2D;&#x8BC6;&#x522B;&#x51FA;&#x8D28;&#x5B50;&#x8FDB;&#x52A8;&#x5CF0;&#x503C;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x8BFB;&#x51FA;&#x5CF0;&#x503C;&#x7684;&#x4E8C;&#x8FDB;&#x5236;&#x6570;&#x3002; &#x8BE5;&#x56FE;&#x8868;&#x544A;&#x8BC9;&#x60A8;bin&#x7F16;&#x53F7;&#x7684;&#x6D3B;&#x52A8;&#x57DF;&#xFF0C;&#x4F46;&#x60A8;&#x5B9E;&#x9645;&#x4E0A;&#x53EF;&#x4EE5;&#x67E5;&#x770B;FFT&#x5E45;&#x5EA6;&#x6570;&#x636E;&#x6587;&#x4EF6;&#x4EE5;&#x83B7;&#x5F97;&#x7CBE;&#x786E;&#x7684;bin&#x7F16;&#x53F7;&#x3002;</p>
<p>&#x5728;&#x4E0A;&#x9762;&#x7684;FFT&#x4E2D;&#xFF0C;&#x5CF0;&#x503C;&#x4F4D;&#x4E8E;&#x6570;&#x636E;&#x70B9;4492&#x5904;&#x3002;&#x8981;&#x83B7;&#x5F97;&#x9891;&#x7387;&#xFF0C;&#x6211;&#x4EEC;&#x5FC5;&#x987B;&#x8BA1;&#x7B97;Hz / bin&#x3002; &#x4ECE;&#x539F;&#x59CB;&#x6570;&#x636E;&#x6587;&#x4EF6;&#x4E2D;&#xFF0C;&#x91C7;&#x6837;&#x7387;&#x4E3A;16393.4426 sps&#x3002; &#x6211;&#x4EEC;&#x7684;FFT&#x4F7F;&#x7528;&#x4E86;32768&#x4E2A;&#x6570;&#x636E;&#x70B9;&#x3002; &#x56E0;&#x6B64;&#xFF0C;&#x6211;&#x4EEC;&#x6709;16393.4426 / 32768 = 0.500288 Hz / bin&#x3002; &#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x5728;&#x5CF0;&#x503C;&#x7684;&#x9891;&#x7387;&#x662F;&#xFF08;44921&#xFF09;* 0.500288 = 2246.7934&#x8D6B;&#x5179;&#x3002;</p>
<p>&#x4E86;&#x89E3;&#x5CF0;&#x503C;&#x7684;&#x9891;&#x7387;&#xFF0C;&#x60A8;&#x73B0;&#x5728;&#x53EF;&#x4EE5;&#x5728;&#x672C;&#x4E66;&#x7684;&#x7F51;&#x9875;&#xFF08;<a href="http://www.exstrom.com/magnum.html" rel="external nofollow noopener noreferrer" target="_blank">http://www.exstrom.com/magnum.html</a>)&#x4E0A;&#x4F7F;&#x7528;&#x9891;&#x7387;&#x5230;&#x78C1;&#x573A;&#x8F6C;&#x6362;&#x5668;&#x6765;&#x83B7;&#x5F97;&#x78C1;&#x573A;&#x3002;</p>
<p>&#x5F53;&#x7136;&#xFF0C;&#x4F60;&#x5E94;&#x8BE5;&#x77E5;&#x9053;&#x4F60;&#x5BF9;&#x5F53;&#x5730;&#x5730;&#x7403;&#x573A;&#x4F30;&#x8BA1;&#x7684;&#x9AD8;&#x5CF0;&#x4F4D;&#x7F6E;&#x3002; &#x5982;&#x679C;&#x4F7F;&#x7528;&#x53BB;&#x79BB;&#x5B50;&#x6C34;&#x4EE3;&#x66FF;&#x84B8;&#x998F;&#x6C34;&#xFF0C;&#x5CF0;&#x503C;&#x5E94;&#x663E;&#x7740;&#x589E;&#x5927;&#x3002;</p>
<h3 id="75-&#x5CF0;&#x503C;&#x4F4D;&#x7F6E;&#x7684;&#x9AD8;&#x5206;&#x8FA8;&#x7387;&#x5149;&#x8C31;"><a class="markdownIt-Anchor" href="#75-&#x5CF0;&#x503C;&#x4F4D;&#x7F6E;&#x7684;&#x9AD8;&#x5206;&#x8FA8;&#x7387;&#x5149;&#x8C31;"></a> 7.5 &#x5CF0;&#x503C;&#x4F4D;&#x7F6E;&#x7684;&#x9AD8;&#x5206;&#x8FA8;&#x7387;&#x5149;&#x8C31;</h3>
<hr>
<ul>
<li>&#x6570;&#x636E;&#x91C7;&#x96C6;&#x6307;&#x5357;&#xFF1A;<a href="http://www.ni.com/white-paper/11055/zhs/" rel="external nofollow noopener noreferrer" target="_blank">http://www.ni.com/white-paper/11055/zhs/</a></li>
</ul>
<table>
<thead>
<tr>
<th style="text-align:center">&#x540D;&#x79F0;\&#x53C2;&#x6570;</th>
<th style="text-align:center">&#x56FE;&#x7247;</th>
<th style="text-align:center">&#x7CFB;&#x7EDF;&#x652F;&#x6301;</th>
<th style="text-align:center">&#x4EF7;&#x683C;</th>
</tr>
</thead>
<tbody>
<tr>
<td style="text-align:center"><a href="https://item.taobao.com/item.htm?spm=a230r.1.14.101.5abf5f51SVSRXX&amp;id=534538408667&amp;ns=1&amp;abbucket=1#detail" rel="external nofollow noopener noreferrer" target="_blank">&#x5C71;&#x9752;&#x6C34;&#x9752;&#x7535;&#x5B50;&#x6D4B;&#x91CF;&#x6280;&#x672F;</a></td>
<td style="text-align:center"><img style="width:300px;" src="https://gd1.alicdn.com/imgextra/i4/134803376/TB2e_dQpHZnBKNjSZFKXXcGOVXa_!!134803376.jpg"></td>
<td style="text-align:center">xp,win7,win10</td>
<td style="text-align:center">585</td>
</tr>
<tr>
<td style="text-align:center"><a href="https://item.taobao.com/item.htm?spm=a230r.1.14.55.5abf5f51SVSRXX&amp;id=541538078385&amp;ns=1&amp;abbucket=1#detail" rel="external nofollow noopener noreferrer" target="_blank">&#x667A;&#x80FD;&#x6570;&#x91C7;</a></td>
<td style="text-align:center"><img style="width:300px;" src="https://gd3.alicdn.com/imgextra/i3/2972316446/TB2P38hXYEF6uJjSZFOXXXUvVXa_!!2972316446.jpg"></td>
<td style="text-align:center">win, linux</td>
<td style="text-align:center">999</td>
</tr>
<tr>
<td style="text-align:center"><a href="https://item.taobao.com/item.htm?spm=a230r.1.14.196.5abf5f51SVSRXX&amp;id=24347560618&amp;ns=1&amp;abbucket=1#detail" rel="external nofollow noopener noreferrer" target="_blank">&#x8FF7;&#x4F60;USB&#x6570;&#x636E;&#x91C7;&#x96C6;&#x5361;</a></td>
<td style="text-align:center"><img style="width:300px;" src="https://gd3.alicdn.com/imgextra/i3/1087172351/O1CN011TEnbl2dsAriZaO_!!1087172351.jpg"></td>
<td style="text-align:center">win,linux</td>
<td style="text-align:center">119</td>
</tr>
<tr>
<td style="text-align:center"><a href="https://item.taobao.com/item.htm?spm=2013.1.0.0.3a6f2671RpDrPv&amp;id=524320311827" rel="external nofollow noopener noreferrer" target="_blank">&#x9AD8;&#x6027;&#x4EF7;&#x6BD4;USB&#x591A;&#x529F;&#x80FD;&#x6570;&#x636E;&#x91C7;&#x96C6;-100K&#x5355;&#x7AEF;</a></td>
<td style="text-align:center"><img style="width:300px;" src="https://gd3.alicdn.com/imgextra/i4/1087172351/O1CN011TEncsVQGl3CTxD_!!1087172351.jpg"></td>
<td style="text-align:center">windows,linux,&#x6811;&#x8393;&#x6D3E;</td>
<td style="text-align:center">350</td>
</tr>
</tbody>
</table>
<hr class="footnotes-sep">
<section class="footnotes">
<ol class="footnotes-list">
<li id="fn1" class="footnote-item"><p>Mosfet:<a href="https://zh.wikipedia.org/wiki/%E9%87%91%E5%B1%AC%E6%B0%A7%E5%8C%96%E7%89%A9%E5%8D%8A%E5%B0%8E%E9%AB%94%E5%A0%B4%E6%95%88%E9%9B%BB%E6%99%B6%E9%AB%94" rel="external nofollow noopener noreferrer" target="_blank">&#x91D1;&#x5C5E;&#x6C27;&#x5316;&#x7269;&#x573A;&#x6548;&#x5E94;&#x7BA1;</a> <a href="#fnref1" class="footnote-backref">&#x21A9;&#xFE0E;</a></p>
</li>
</ol>
</section>

    
    </div>
    
    
    <div class="columns is-mobile is-multiline article-nav">
        <span class="column is-12-mobile is-half-desktop  article-nav-prev">
            
            <a href="/2018/11/21/Mechine-learning/">Mechine_learning</a>
            
        </span>
        <span class="column is-12-mobile is-half-desktop  article-nav-next">
            
            <a href="/2018/11/20/Vehicles-Vatentino/">Vehicles</a>
            
        </span>
    </div>
    
</article>


<div class="sharebox">
    
<div class="sharethis-inline-share-buttons"></div>
<script type="text/javascript" src="//platform-api.sharethis.com/js/sharethis.js#property=5d03e67f4351e90012650a82&amp;product=sticky-share-buttons" async="async"></script>

</div>



<div class="comments">
    <h3 class="title is-4">评论</h3>
    <script>(function(d, s, id) {
    var js, fjs = d.getElementsByTagName(s)[0];
    if (d.getElementById(id)) return;
    js = d.createElement(s); js.id = id;
    js.src = "//connect.facebook.net/zh-CN/sdk.js#xfbml=1&version=v2.8";
    fjs.parentNode.insertBefore(js, fjs);
}(document, 'script', 'facebook-jssdk'));</script>
<div class="fb-comments" data-width="100%" data-href="http://liudixian.github.io/2018/11/21/地磁/" data-num-posts="5"></div>

</div>

    </div>
</section>
    <footer class="footer">
    <div class="container">
        <div class="columns content">
            <div class="column is-narrow has-text-centered">
                &copy; 2020 liudixian&nbsp;
                Powered by <a href="http://hexo.io/" target="_blank" rel="external nofollow noopener noreferrer">Hexo</a> & <a href="http://github.com/ppoffice/hexo-theme-minos" rel="external nofollow noopener noreferrer" target="_blank">Minos</a>
            </div>
            <div class="column is-hidden-mobile"></div>

            
            <div class="column is-narrow">
                <div class="columns is-mobile is-multiline is-centered">
                
                    
                <a class="column is-narrow has-text-black" title="GitHub" href="https://github.com/ppoffice/hexo-theme-minos" rel="external nofollow noopener noreferrer" target="_blank">
                    
                    GitHub
                    
                </a>
                
                </div>
            </div>
            
            
<div class="column is-narrow has-text-centered">
    <div class="dropdown is-up is-right is-hoverable" style="margin-top: -0.2em;">
        <div class="dropdown-trigger">
            <button class="button is-small" aria-haspopup="true" aria-controls="dropdown-menu7">
                <span class="icon">
                    <i class="fas fa-globe"></i>
                </span>
                <span>简体中文</span>
                <span class="icon is-small">
            <i class="fas fa-angle-down" aria-hidden="true"></i>
          </span>
            </button>
        </div>
        <div class="dropdown-menu has-text-left" role="menu">
            <div class="dropdown-content">
            
                <a href="/2018/11/21/地磁/" class="dropdown-item">
                    简体中文
                </a>
            
                <a href="/en/2018/11/21/地磁/" class="dropdown-item">
                    English
                </a>
            
            </div>
        </div>
    </div>
</div>

        </div>
    </div>
</footer>
    <script src="//cdnjs.cloudflare.com/ajax/libs/jquery/3.3.1/jquery.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/moment.js/2.22.2/moment-with-locales.min.js"></script>

<!-- test if the browser is outdated -->
<div id="outdated">
    <h6>Your browser is out-of-date!</h6>
    <p>Update your browser to view this website correctly. <a id="btnUpdateBrowser" href="http://outdatedbrowser.com/" rel="external nofollow noopener noreferrer" target="_blank">Update my browser now </a></p>
    <p class="last"><a href="#" id="btnCloseUpdateBrowser" title="Close">&times;</a></p>
</div>
<script src="//cdnjs.cloudflare.com/ajax/libs/outdated-browser/1.1.5/outdatedbrowser.min.js"></script>
<script>
    $(document).ready(function () {
        // plugin function, place inside DOM ready function
        outdatedBrowser({
            bgColor: '#f25648',
            color: '#ffffff',
            lowerThan: 'flex'
        })
    });
</script>

<script>
    window.FontAwesomeConfig = {
        searchPseudoElements: true
    }
    moment.locale("zh-CN");
</script>


    
    
<script src="https://cdnjs.cloudflare.com/ajax/libs/mathjax/2.7.4/MathJax.js?config=TeX-MML-AM_CHTML"></script>
<script>
    MathJax.Hub.Config({
        "HTML-CSS": {
            matchFontHeight: false
        },
        SVG: {
            matchFontHeight: false
        },
        CommonHTML: {
            matchFontHeight: false
        },
        tex2jax: {
            inlineMath: [
                ['$','$'],
                ['\\(','\\)']
            ]
        }
    });
</script>

    
    
    
    
<script src="//cdnjs.cloudflare.com/ajax/libs/lightgallery/1.6.8/js/lightgallery-all.min.js"></script>
<script src="//cdnjs.cloudflare.com/ajax/libs/justifiedGallery/3.6.5/js/jquery.justifiedGallery.min.js"></script>
<script>
    (function ($) {
        $(document).ready(function () {
            if (typeof($.fn.lightGallery) === 'function') {
                $('.article.gallery').lightGallery({ selector: '.gallery-item' });
            }
            if (typeof($.fn.justifiedGallery) === 'function') {
                $('.justified-gallery').justifiedGallery();
            }
        });
    })(jQuery);
</script>

    
    
    <script src="https://cdnjs.cloudflare.com/ajax/libs/clipboard.js/2.0.0/clipboard.min.js"></script>
    <style>
        .hljs {
            position: relative;
        }

        .hljs .clipboard-btn {
            float: right;
            color: #9a9a9a;
            background: none;
            border: none;
            cursor: pointer;
        }

        .hljs .clipboard-btn:hover {
          color: #8a8a8a;
        }

        .hljs > .clipboard-btn {
            display: none;
            position: absolute;
            right: 4px;
            top: 4px;
        }

        .hljs:hover > .clipboard-btn {
            display: inline;
        }

        .hljs > figcaption > .clipboard-btn {
            margin-right: 4px;
        }
    </style>
    <script>
      $(document).ready(function () {
        $('figure.hljs').each(function(i, figure) {
          var codeId = 'code-' + i;
          var code = figure.querySelector('.code');
          var copyButton = $('<button>Copy <i class="far fa-clipboard"></i></button>');
          code.id = codeId;
          copyButton.addClass('clipboard-btn');
          copyButton.attr('data-clipboard-target-id', codeId);

          var figcaption = figure.querySelector('figcaption');

          if (figcaption) {
            figcaption.append(copyButton[0]);
          } else {
            figure.prepend(copyButton[0]);
          }
        })

        var clipboard = new ClipboardJS('.clipboard-btn', {
          target: function(trigger) {
            return document.getElementById(trigger.getAttribute('data-clipboard-target-id'));
          }
        });
        clipboard.on('success', function(e) {
          e.clearSelection();
        })
      })
    </script>

    
    

    


<script src="/js/script.js"></script>

    
    <div class="searchbox ins-search">
    <div class="searchbox-mask"></div>
    <div class="searchbox-container ins-search-container">
        <div class="searchbox-input-wrapper">
            <input type="text" class="searchbox-input ins-search-input" placeholder="站内搜索">
            <span class="searchbox-close ins-close ins-selectable"><i class="fa fa-times-circle"></i></span>
        </div>
        <div class="searchbox-result-wrapper ins-section-wrapper">
            <div class="ins-section-container"></div>
        </div>
    </div>
</div>
<script>
    (function (window) {
        var INSIGHT_CONFIG = {
            TRANSLATION: {
                POSTS: '文章',
                PAGES: '页面',
                CATEGORIES: '分类',
                TAGS: '标签',
                UNTITLED: '(无标题)',
            },
            CONTENT_URL: '/content.json',
        };
        window.INSIGHT_CONFIG = INSIGHT_CONFIG;
    })(window);
</script>
<script src="/js/insight.js"></script>
    
</body>
</html>